{"Learn programming, create video games - microStudio is a free game engine online.":"Programmieren lernen, Videospiele erstellen - microStudio ist eine kostenlose Online-Spiele-Engine.","Learn programming, create games":"Programmieren lernen, Spiele erstellen","Create My Account":"Mein Konto einrichten","About":"Über","Settings":"Optionen","Login":"Anmelden","Logout":"Abmelden","Documentation":"Dokumentation","Tutorials":"Tutorials","Create":"Erstellen","Explore":"Erkunden","Create Account":"Konto einrichten","Quit and Delete":"Beenden und  Löschen","microStudio is a free game engine online.":"microStudio ist eine kostenlose Online-Spielengine.","Create games, learn programming, play, share, prototype and jam!":"Spiele erstellen, Programmieren lernen, spielen, teilen, Prototypen bauen und jammen!","Online and integrated":"Online und integriert","microStudio includes all you need to write code, create sprites and maps for your 2D game.":"microStudio enthält alles was Sie brauchen um Code zu schreiben und Sprites und Maps für Ihr 2D-Spiel zu erstellen.","All from your web browser. Your project is stored in the cloud, accessible from anywhere.":"Alles von Ihrem Webbrowser aus. Ihr Projekt wird in der Cloud gespeichert und ist von überall aus zugänglich.","Get into programming":"Einstieg in die Programmierung","Write your game code in microScript, a simple language inspired by Lua.":"Schreiben Sie Ihren Spielcode in microScript, einer einfachen von Lua inspirierten Sprache.","The documentation is always there to help. Create cool demos in just a few lines of code.":"Die Dokumentation ist immer da um zu helfen. Erstellen Sie coole Demos in nur wenigen Zeilen Code.","Design":"Design","Create pixel art sprites and maps with the included editors.":"Erstellen Sie Pixel Art Sprites und Maps mit den mitgelieferten Editoren.","Using your sprites and maps from code is as easy as 1-2-3.":"Die Verwendung Ihrer Sprites und Maps aus dem Code ist so einfach wie 1-2-3.","Adjusting is a breeze":"Das Anpassen ist ein Kinderspiel","Change anything from your PC while testing your game on your mobile.":"Ändern Sie alles von Ihrem PC aus während Sie Ihr Spiel auf Ihrem Handy testen.","Your changes are immediately reflected in your ongoing playing session.":"Ihre Änderungen werden sofort in der laufenden Spielsitzung berücksichtigt.","Bring your friends":"Bringen Sie Ihre Freunde mit","You can invite others to your project and work in teams.":"Sie können andere zu Ihrem Projekt einladen und in Teams arbeiten.","microStudio automagically synchronizes all your project files in real time.":"microStudio synchronisiert automatisch alle Ihre Projektdateien in Echtzeit.","Get your gear ready":"Bereiten Sie Ihre Ausrüstung vor","Control your game using the gamepad, touchscreen, keyboard or mouse inputs.":"Steuern Sie Ihr Spiel mit dem Gamepad, dem Touchscreen, der Tastatur oder Mauseingaben.","Export your project in a single click to HTML5, Windows, Linux, macOS. More export options are coming!":"Exportieren Sie Ihr Projekt mit einem einzigen Klick nach HTML5, Windows, Linux, macOS. Weitere Exportoptionen sind in Vorbereitung!","Join the community":"Treten Sie der Community bei","Browse public games, demos, resources. Pick up what you need for your own project.":"Durchsuchen Sie öffentliche Spiele, Demos und Ressourcen. Nehmen Sie sich was Sie für Ihr eigenes Projekt brauchen.","Contribute your best creations and help others.":"Tragen Sie Ihre besten Kreationen bei und helfen Sie anderen.","So what now?":"Und was nun?","Explore public projects":"Öffentliche Projekte erkunden","Start creating!":"Beginnen Sie zu erstellen!","Created in Strasbourg, France. See 'About' for more information":"Erstellt in Strasbourg, Frankreich. Siehe 'Über' für weitere Informationen","You are not tracked here.":"Sie werden hier nicht verfolgt.","microStudio doesn't use any third-party tracking script.":"microStudio verwendet keine Tracking-Skripts von Drittanbietern.","Back":"Zurück","Hot":"Hot","Run":"Ausführen ","Clone":"Klonen","Comments":"Kommentare","Post":"Beitrag","Log in to post comments":"Einloggen um Kommentare zu schreiben","Validate your email to post comments":"Bestätigen Sie Ihre E-Mail, um Kommentare zu veröffentlichen","Code":"Code","Sprites":"Sprites","Doc":"Doku","Export all in a ZIP file":"Alles in eine ZIP-Datei exportieren","Changelog":"Änderungsprotokoll","Terms of use":"Nutzungsbedingungen","Privacy":"Datenschutz","Learn the basics of programming and how to create games with microStudio:":"Lernen Sie die Grundlagen der Programmierung und wie man Spiele mit microStudio erstellt:","User Settings":"Benutzereinstellungen","Nickname":"Spitzname","Change nickname":"Spitznamen ändern","Your nickname will be displayed publicly.":"Ihr Spitzname wird öffentlich angezeigt.","Public page":"Öffentliche Seite","Your public page displays a list of your public projects.":"Ihre öffentliche Seite zeigt eine Liste Ihrer öffentlichen Projekte an.","E-mail Address":"E-mail Addresse","Change e-mail":"E-Mail ändern","Your e-mail address is not validated yet. Check your e-mails and click on the validation link we sent to you. In case you did not receive the validation e-mail yet, use the button below to resend:":"Ihre E-Mail-Adresse ist noch nicht validiert. Prüfen Sie Ihre E-Mails und klicken Sie auf den Validierungslink, den wir Ihnen geschickt haben. Falls Sie die Bestätigungs-E-Mail noch nicht erhalten haben verwenden Sie die Schaltfläche unten um sie erneut zu senden:","Resend validation e-mail":"Validierungs-E-Mail erneut senden","We have just resent a validation e-mail.":"Wir haben soeben eine Bestätigungs-E-Mail zurückgesendet.","Receive newsletter":"Newsletter empfangen","We will send you an information email no more than once a month.":"Wir senden Ihnen maximal einmal im Monat eine Informations-E-Mail.","Account Type":"Konto-Typ","Storage":"Speicher","Open translation tool":"Übersetzungstool öffnen","Create New Project":"Neues Projekt erstellen","My Projects":"Meine Projekte","Back to Projects":"Zurück zu Projekten","Maps":"Maps","Assets":"Assets","Sounds":"Sounds","Music":"Musik","Publish":"Publiziere","Files":"Dateien","Create as a guest":"Als Gast erstellen","Add File":"Datei zufügen","Add Sprite":"Sprite zufügen","Apply":"Übernehmen","Undo":"Widerrufen","Redo":"Wiederholen","Copy":"Kopieren","Cut":"Schneiden","Paste":"Einfügen","Delete Sprite":"Sprite löschen","Hold down space bar to move view":"Leertaste gedrückt halten um die Ansicht zu verschieben","Zoom out":"Herauszoomen","Animation":"Animation","Zoom in":"Heranzoomen","Add new Frame":"Neuen Rahmen hinzufügen","Eyedropper tool":"Pipetten-Werkzeug","Lock palette":"Palette sperren","Move":"Bewegen","Strip to animation":"Strip zur Animation","Add Asset":"Asset hinzufügen","Delete Asset":"Asset löschen","Add Map":"Karte hinzufügen","Add Sound":"Sound hinzufügen","Delete Sound":"Sound löschen","Synthesizer":"Synthesizer","Add Music":"Musik hinzufügen","Project Title":"Projekt Titel","Project Secret Code":"Projekt Geheimcode","Project Slug":"Project Kurztitel","Secret URL for testing your project when not set to public":"Geheime URL zum Testen Ihres Projekts wenn nicht auf öffentlich gesetzt","Orientation":"Orientierung","Any":"Beliebig","Landscape":"Querformat","Portrait":"Hochformat","Aspect ratio":"Seitenverhältnis","Free":"Frei","Force 2:1":"Zwinge 2:1","Force 16:9":"Zwinge 16:9","Force 4:3":"Zwinge 4:3","Force 1:1 (square)":"Zwinge 1:1 (Quadrat)","2:1 or above":"2:1 oder höher","16:9 or above":"16:9 oder höher","4:3 or above":"4:3 oder höher","1:1 or above":"1:1 oder höher","Graphics library":"Grafik-Bibliothek","Storage used":"Verwendeter Speicher","Users":"Benutzer","Here is where your grant other users access to edit your project. Users added here are granted full control on your project, except for adding or deleting other users.":"Hier gewähren Sie anderen Benutzern Zugriff auf die Bearbeitung Ihres Projekts. Den hier hinzugefügten Benutzern wird die volle Kontrolle über Ihr Projekt gewährt, mit Ausnahme des Hinzufügens oder Löschens anderer Benutzer.","nickname":"Nickname","Add User":"Benutzer hinzufügen","Make public":"Publiziere","You must validate your e-mail address before you can make your project public.":"Sie müssen Ihre E-Mail-Adresse bestätigen bevor Sie Ihr Projekt veröffentlichen können.","This project is currently private.":"Dieses Projekt ist derzeit privat.","Make private again":"Wieder privat machen","This project is currently public.":"Dieses Projekt ist derzeit öffentlich.","Make public on microStudio":"Veröffentliche in microStudio","Making your project public will allow it to be listed in the Explore section of the site. Public projects can be run and used by anyone. Making a project public allows anyone to view and possibly reuse the source code.":"Wenn Sie Ihr Projekt öffentlich machen, wird es im Bereich \"Erkunden\" der Website aufgeführt. Öffentliche Projekte können von jedem ausgeführt und verwendet werden. Wenn Sie ein Projekt öffentlich machen, kann jeder den Quellcode einsehen und möglicherweise wiederverwenden.","Description":"Beschreibung","Tags":"Stichworte","Add":"hinzufügen","Export to HTML5":"Zu HTML5 exportieren","Exporting to HTML5 allows you to distribute your game as a web app or a standalone HTML app. Unzip contents, double-click index.html to start the game, or upload the contents to a subfolder of your existing web site.":"Das Exportieren nach HTML5 ermöglicht es Ihnen, Ihr Spiel als Web-App oder als eigenständige HTML-App zu vertreiben. Entpacken Sie den Inhalt, doppelklicken Sie auf index.html, um das Spiel zu starten, oder laden Sie den Inhalt in einen Unterordner Ihrer bestehenden Website hoch.","You can also easily publish your HTML5 game on a number of platforms supporting HTML5 games. We have listed a few popular ones below, which you can check out:":"Sie können Ihr HTML5-Spiel auch problemlos auf einer Reihe von Plattformen publizieren die HTML5-Spiele unterstützen. Wir haben unten ein paar beliebte aufgelistet die Sie ausprobieren können:","Build for Android":"Für Android exportieren","This will build an APK file of your game. An APK file is what you need to publish your game on the Google Play Store, for Android devices.":"Dadurch wird eine APK-Datei Ihres Spiels erstellt. Eine APK-Datei ist das was Sie brauchen um Ihr Spiel im Google Play Store für Android-Geräte zu publizieren.","Build for Windows":"Für Windows exportieren","This will build your game as an executable for Windows (.EXE).":"Dadurch wird Ihr Spiel als ausführbare Datei für Windows (.EXE) erstellt.","Build for macOS":"Für macOS exportieren","This will build your game as an executable for macOS.":"Dadurch wird Ihr Spiel als ausführbare Datei für macOS erstellt.","Build for Linux":"Für Linux exportieren","This will build your game as an executable for Linux (Ubuntu, x86).":"Damit wird Ihr Spiel als ausführbare Datei für Linux (Ubuntu, x86) erstellt.","Build for Raspberry Pi":"Für Raspberry Pi exportieren","This will build your game as an executable for Raspberry Pi (Raspbian).":"Dadurch wird Ihr Spiel als ausführbare Datei für Raspberry Pi (Raspbian) erstellt.","Start creating":"Beginnen Sie mit dem Erstellen","Start using microStudio without creating an account.":"Starten Sie mit microStudio ohne ein Konto zu erstellen.","Create my account":"Mein Konto einrichten","Save your projects, work in teams, publish, vote, comment...":"Speichern Sie Ihre Projekte, arbeiten Sie in Teams, publizieren Sie, stimmen Sie ab, kommentieren Sie...","Log in to your existing account.":"Loggen Sie sich in Ihr bestehendes Konto ein.","Registered User":"Registrierter Benutzer","Nickname or e-mail":"Nickname oder E-Mail","Password":"Passwort","Forgot password?":"Passwort vergessen?","Log in":"Einloggen","Don't have an account yet?":"Sie haben noch kein Konto?","Password Recovery":"Passwort-Wiederherstellung","E-mail":"E-Mail","Send password recovery e-mail":"E-Mail zur Passwortwiederherstellung senden","Back to login":"Zurück zur Anmeldung","New User":"Neuer Benutzer","E-mail address":"E-Mail Adresse","Accept the":"Akzeptieren Sie die","Terms of Use":"Nutzungsbedingungen","Receive news (maximum once per month)":"Nachrichten erhalten (maximal einmal pro Monat)","Already registered?":"Bereits registriert?","Log in to existing account":"In bestehendes Konto einloggen","Title":"Titel","Create Project":"Projekt erstellen","Tutorial":"Tutorial","[STORAGE] used of [MAX_STORAGE] ([PERCENT] %)":"[STORAGE] benutzt von [MAX_STORAGE] ([PERCENT] %)","Kb":"Kb","Gb":"Gb","Delete":"Löschen","Quit":"Beenden","Build":"Export","Duplicate Frame":"Frame duplizieren","Move Left":"Links bewegen","Move Right":"Rechts bewegen","Delete file":"Datei löschen","New":"Neu","Account created successfully!":"Konto erfolgreich erstellt!","Microstudio e-mail validation":"Microstudio E-Mail-Validierung","Thank you for using Microstudio!":"Vielen Dank dass Sie Microstudio verwenden!","Click on the link below to validate your e-mail address:":"Klicken Sie auf den unten stehenden Link um Ihre E-Mail-Adresse zu bestätigen:","Your e-mail address is now validated":"Ihre E-Mail-Adresse ist nun bestätigt","Stats & Achievements":"Statistiken & Erfolge","Profile":"Profil","microScript shines by its simplicity and interactivity. But you can also code in JavaScript, Python or Lua if you prefer.":"microScript glänzt durch seine Einfachheit und Interaktivität. Sie können aber auch in JavaScript, Python oder Lua programmieren, wenn Sie möchten.","Standalone, offline application":"Eigenständige Offline-Anwendung","Would you like to work completely offline? Download the microStudio standalone app for Windows, Mac, Linux and Raspberry Pi:":"Sie möchten komplett offline arbeiten? Laden Sie die eigenständige microStudio-App für Windows, Mac, Linux und Raspberry Pi herunter:","Export":"Export","Fundamentals":"Grundlagen","Quick Start":"Schnellstart","microScript programming":"microScript Programmierung","API reference":"API-Referenz","Advanced graphics":"Erweiterte Grafik","Optional libs":"Optionale Bibliotheken","More programming languages":"Weitere Programmiersprachen","Newsletter":"Newsletter","Experimental features":"Experimentelle Funktionen","Enable experimental features":"Experimentelle Funktionen aktivieren","Experimental features can change, break or be removed anytime. You are warned!":"Experimentelle Funktionen können jederzeit geändert, unterbrochen oder entfernt werden. Sie sind gewarnt!","Your Profile":"Ihr Profil","User Description":"Benutzerbeschreibung","Tell us more about yourself (only if you wish to). This text will be displayed on your public page.":"Erzählen Sie uns mehr über sich (nur wenn Sie möchten). Dieser Text wird auf Ihrer öffentlichen Seite angezeigt.","Profile Image":"Profilbild","Remove Profile Image":"Profilbild entfernen","Drop your image here. This image will be displayed publicly, along with your nickname.":"Legen Sie Ihr Bild hier ab. Dieses Bild wird zusammen mit Ihrem Spitznamen öffentlich angezeigt.","Check your public page":"Überprüfen Sie Ihre öffentliche Seite","Your public page displays your nickname, description, profile image and a list of your public projects.":"Ihre öffentliche Seite zeigt Ihren Spitznamen, Ihre Beschreibung, Ihr Profilbild und eine Liste Ihrer öffentlichen Projekte an.","Your Progress":"Ihr Fortschritt","Statistics":"Statistiken","Achievements":"Erfolge","Import Project":"Projekt importieren","Display warning when using an undefined variable":"Warnung anzeigen, wenn eine undefinierte Variable verwendet wird","Display warning when calling something that isn't a function":"Warnung anzeigen, wenn etwas aufgerufen wird, das keine Funktion ist","Display warning when setting property on an undefined variable":"Warnung anzeigen, wenn Eigenschaften für eine undefinierte Variable festgelegt werden","(Transpiler activation was moved to project settings)":"(Transpiler-Aktivierung wurde zu den Projekteinstellungen verschoben)","You can drop PNG or JPEG files here":"Hier können Sie PNG oder JPEG Dateien ablegen","Copy Color":"Farbe kopieren","Background":"Hintergrund","You can drop WAV files here":"Sie können WAV Dateien hier ablegen","Drop your sounds on the left. A sleek sound creation app will land here in the future!":"Legen Sie Ihre Sounds auf der linken Seite ab. In Zukunft wird hier eine schlanke Sound-Erstellungs-App landen!","You can drop MP3 files here":"Sie können MP3 Dateien hier ablegen","Drop your music files on the left. A sleek music creation app will land here in the future!":"Legen Sie Ihre Musikdateien auf der linken Seite ab. In Zukunft wird hier eine elegante App zur Musikerstellung landen!","Start Tutorial":"Tutorial starten","Show advanced options":"Erweiterte Optionen anzeigen","Language support":"Sprachunterstützung","microScript v1 - interpreted":"microScript v1 - interpretiert","microScript v1 - transpiled":"microScript v1 - transpiliert","Python":"Python","Lua":"Lua","JavaScript":"JavaScript","basic graphics API":"Basic Grafik-API","micro 2D - Experimental - Built on Pixi.js":"micro 2D – Experimentell – Basiert auf Pixi.js","micro 3D - Experimental - Built on Babylon.js":"micro 3D – Experimentell – Basiert auf Babylon.js","Pixi.js - Experimental":"Pixi.js – Experimentell","Babylon.js - Experimental":"Babylon.js – Experimentell","Additional tools and libraries":"Zusätzliche Werkzeuge und Bibliotheken","matter.js - 2D physics engine":"matter.js - 2D Physik Engine","Note: this integration is experimental":" Anmerkung: Diese Integration ist experimentell ","cannon.js - 3D physics engine":"cannon.js - 3D Physik Engine","Unlisted":"Nicht gelistet","If you mark your public project Unlisted, it will not show up in the main Explore section":"Wenn Sie Ihr öffentliches Projekt als nicht gelistet markieren, wird es nicht im Hauptbereich „Erkunden“ angezeigt","Public link":"Öffentlicher Link","Checklist before publishing":"Checkliste vor der Veröffentlichung","Before making your project public, please make sure to understand and comply with the following. Tick the boxes when you comply, then press the publication button again":"Bevor Sie Ihr Projekt veröffentlichen, stellen Sie bitte sicher, dass Sie die folgenden Punkte verstanden haben und einhalten. Kreuzen Sie die Kästchen an, wenn Sie dem zustimmen, und drücken Sie dann erneut auf Veröffentlichung","My project is an original work, not a barely modified clone of an existing project.":"Mein Projekt ist ein Originalwerk, keine kaum modifizierte Version eines bestehenden Projekts.","My project brings something interesting or fun to others, it's not just a test.":"Mein Projekt bringt anderen etwas Interessantes oder Lustiges, es ist nicht nur ein Test.","I have created a nice icon for it (the default project icon is not accepted, please create yours!).":"Ich habe dafür ein schönes Icon erstellt (das Standard-Projekt-Icon wird nicht akzeptiert, bitte erstelle dein eigenes!).","I made the assets in my project myself (sprites, sounds, music), or I made sure that I am allowed to use and publish the assets I imported into it.":"Ich habe die Assets in meinem Projekt selbst erstellt (Sprites, Sounds, Musik), oder ich habe sichergestellt, dass ich die importierten Assets verwenden und veröffentlichen darf.","If I am using an asset pack, I made sure to add the required credits and generally comply with the license of the asset packs.":"Wenn ich ein Asset-Paket verwende, habe ich darauf geachtet, die erforderlichen Credits hinzuzufügen und generell die Lizenz der Asset-Pakete einzuhalten.","Pencil":"Stift","Eraser":"Radierer","Fill":"Füllen","Enhance":"Verbessern","Select":"Auswählen","Hide advanced options":"Erweiterte Optionen verbergen","Pixels Drawn":"Gezeichnete Pixel","Map Cells Painted":"Kartenzellen gemalt","hours":"Stunden","Map Editor Time":"Karteneditor Zeit","Game Jam Contender":"Game Jam-Teilnehmer","You made a submission to a microStudio Game Jam":"Du hast einen Beitrag zu einer microStudio Game Jam eingereicht","Impressionism":"Impressionismus","You spent 1 hour drawing, amazing!":"Du hast 1 Stunde lang gezeichnet, unglaublich!","Joseph Jacquard":"Joseph Jacquard","You spent 2 hours coding, starts looking like an addiction!":"Sie haben 2 Stunden mit dem Programmieren verbracht, das sieht schon nach Sucht aus!","Joseph Jacquard was a French weaver and merchant. He built and demonstrated the Jacquard loom, a programmable mechanized loom controlled by a tape constructed from punched cards.":"Joseph Jacquard war ein französischer Weber und Kaufmann. Er baute und demonstrierte den Jacquard-Webstuhl, einen programmierbaren, mechanisierten Webstuhl, der durch einen Lochstreifen gesteuert wurde.","Active Community Member":"Aktives Mitglied der Gemeinschaft","You made a public post in the community forum!":"Sie haben einen öffentlichen Beitrag im Community-Forum verfasst!","Renaissance":"Renaissance","You spent 30 minutes drawing, well done!":"Du hast 30 Minuten lang gezeichnet, gut gemacht!","Gottfried Leibniz":"Gottfried Leibniz","You spent 1 hour coding, amazing!":"Du hast 1 Stunde für die programmiert, erstaunlich!","Gottfried Leibniz was a German mathematician, philosopher, scientist and diplomat. He made advances in symbolic logic and his work was crucial for the theoretical foundations of computer science.":"Gottfried Leibniz war ein deutscher Mathematiker, Philosoph, Naturwissenschaftler und Diplomat. Er machte Fortschritte in der symbolischen Logik und seine Arbeit war entscheidend für die theoretischen Grundlagen der Computerwissenschaft.","Greek Art":"Griechische Art","You spent 10 minutes drawing, keep it up!":"Du hast 10 Minuten lang gezeichnet, mach weiter so!","Blaise Pascal":"Blaise Pascal"}
