{
  "Learn programming, create video games - microStudio is a free game engine online.": "Aprende a programar, crea videojuegos: microStudio es un editor de juegos online gratuito",
  "Learn programming, create games": "Aprende a programar, haz juegos",
  "Create My Account": "Crear mi perfil",
  "Login": "Acceso",
  "Explore": "Explorar",
  "Create": "Crear",
  "Tutorials": "tutoriales",
  "Documentation": "Documentación",
  "Community": "Comunidad",
  "About": "Información",
  "Settings": "Opciones",
  "Profile": "Perfil",
  "Logout": "Desconexión",
  "Create Account": "Crear perfil",
  "Quit and Delete": "Salir y Eliminar",
  "microStudio is a free game engine online.": "microStudio es un motor de juegos online",
  "Create games, learn programming, play, share, prototype and jam!": "¡Crea juegos, aprende a programar, juega, comparte, crea prototipos y experimenta!",
  "Online and integrated": "Online e integrado",
  "microStudio includes all you need to write code, create sprites and maps for your 2D game.": "microStudio incluye todo lo que necesitas para escribir código, crear sprites y mapas para su juego 2D",
  "All from your web browser. Your project is stored in the cloud, accessible from anywhere.": "Todo desde tu navegador. Tu proyecto se guarda en la nube, accesible desde cualquier lugar.",
  "Get into programming": "Entrar en programación",
  "Write your game code in microScript, a simple language inspired by Lua.": "Escribe tu código en microScript, un lenguaje sencillo inspirado en Lua.",
  "The documentation is always there to help. Create cool demos in just a few lines of code.": "La documentación está disponible para ayudarte. Crea demos alucinantes en solo unas pocas líneas de código.",
  "Design": "Diseño",
  "Create pixel art sprites and maps with the included editors.": "Crea pixel art y mapas con los editores incluidos.",
  "Using your sprites and maps from code is as easy as 1-2-3.": "Usar tus sprites y mapas a través del código es tan simple como 1-2-3",
  "Adjusting is a breeze": "Editar es un momento",
  "Change anything from your PC while testing your game on your mobile.": "Cambia cualquier cosa desde tu PC mientras juegas desde tu teléfono.",
  "Your changes are immediately reflected in your ongoing playing session.": "Tus cambios se aplican inmediatamente a la sesión de juego actual",
  "Bring your friends": "Trae a tus amigos",
  "You can invite others to your project and work in teams.": "Puedes invitar a otras personas a unirse a tu proyecto como equipo",
  "microStudio automagically synchronizes all your project files in real time.": "microStudio sincroniza automágicamente todos sus proyectos en tiempo real",
  "Get your gear ready": "Prepara tu equipo",
  "Control your game using the gamepad, touchscreen, keyboard or mouse inputs.": "Controla tu juego a través de gamepad, pantalla táctil, teclado o ratón",
  "Export your project in a single click to HTML5, Windows, Linux, macOS. More export options are coming!": "Exporta tu proyecto con un solo clic a HTML5, Windows, Linux, macOS. \n¡Hay más opciones de exportación en camino!",
  "Join the community": "Únete a la communidad",
  "Browse public games, demos, resources. Pick up what you need for your own project.": "Explora juegos públicos, demos, recursos. Consigue lo que necesitas para tu proyecto.",
  "Contribute your best creations and help others.": "Aporta tus mejores creaciones y ayuda a los demás.",
  "So what now?": "¿Y ahora qué?",
  "Explore public projects": "Explora proyectos públicos",
  "Start creating!": "¡Empieza a crear!",
  "Created in Strasbourg, France. See 'About' for more information": "Creado en Estrasburgo, Francia. Ver 'Acerca de' para más detalles",
  "You are not tracked here.": "No eres rastreado aquí.",
  "microStudio doesn't use any third-party tracking script.": "microStudio no utiliza scripts de rastreo de terceros.",
  "Back": "Atrás",
  "Hot": "Hot",
  "Run": "Ejecutar",
  "Clone": "Clonar",
  "Export": "Exportar",
  "Comments": "Comentarios",
  "Post": "Post",
  "Log in to post comments": "Inicia sesión para escribir comentarios",
  "Validate your email to post comments": "Revisa tu e-mail para escribir comentarios",
  "Code": "Código",
  "Sprites": "Sprites",
  "Sounds": "Sonidos",
  "Music": "Música",
  "Doc": "Doc",
  "Export all in a ZIP file": "Exportar todo a un archivo ZIP",
  "Changelog": "Changelog",
  "Terms of use": "Términos de Uso",
  "Privacy": "Privacidad",
  "Learn the basics of programming and how to create games with microStudio:": "Aprende los conceptos básicos de programación y cómo hacer juegos con microStudio:",
  "User Settings": "Ajustes \nde usuario",
  "Nickname": "Nick",
  "Change nickname": "Cambiar nick",
  "Your nickname will be displayed publicly.": "Tu nick se mostrará públicamente.",
  "E-mail Address": "Dirección de e-mail",
  "Change e-mail": "Cambiar e-mail",
  "Your e-mail address is not validated yet. Check your e-mails and click on the validation link we sent to you. In case you did not receive the validation e-mail yet, use the button below to resend:": "Tu dirección de e-mail aún no ha sido validada. Revisa tus correos electrónicos y haz clic en el enlace de validación que te enviamos. Si aún no has recibido el correo electrónico de validación, usa el botón a continuación para reenviarlo:",
  "Resend validation e-mail": "Reenviar el correo electrónico de validación",
  "We have just resent a validation e-mail.": "Acabamos de enviarte un correo electrónico de validación.",
  "Receive newsletter": "Recibir el boletín",
  "We will send you an information email no more than once a month.": "Te enviaremos un correo electrónico de información no más de una vez al \nmes.",
  "Account Type": "Tipo de cuenta",
  "Storage": "Espacio de almacenamiento",
  "Open translation tool": "Abre la herramienta de traducción",
  "Your Profile": "Tu perfil",
  "User Description": "Descripción de usuario",
  "Tell us more about yourself (only if you wish to). This text will be displayed on your public page.": "Cuéntanos más sobre ti (solo si \nlo deseas). Este texto se mostrará en tu página pública.",
  "Profile Image": "Foto de perfil",
  "Remove Profile Image": "Quitar foto de perfil",
  "Drop your image here. This image will be displayed publicly, along with your nickname.": "Sube tu imagen aquí. Esta imagen se mostrará públicamente, junto con tu nick.",
  "Check your public page": "Revisa tu página pública",
  "Your public page displays your nickname, description, profile image and a list of your public projects.": "Tu página pública muestra tu nick, descripción, foto de perfil y una lista de tus proyectos públicos.",
  "My Projects": "Mis proyectos",
  "Create New Project": "Crear un nuevo proyecto",
  "Import Project": "Importar proyecto",
  "Back to Projects": "volver a proyectos",
  "Maps": "mapas",
  "Assets": "Recursos",
  "Publish": "Publicar",
  "Files": "Archivos",
  "Add File": "Agregar archivos",
  "Display warning when using an undefined variable": "Muestra una advertencia cuando se usa una variable no definida",
  "Display warning when calling something that isn't a function": "Mostrar una advertencia al llamar a algo que no es una función",
  "Display warning when setting property on an undefined variable": "Muestra una advertencia al establecer una propiedad en una variable no definida",
  "Use transpiler [Caution: alpha version, may not work]": "Use el transpiler [Advertencia: versión alfa, puede no funcionar].",
  "You can drop PNG or JPEG files here": "Puede soltar archivos PNG o JPEG aquí",
  "Add Sprite": "Agregar sprites",
  "Apply": "Aplicar",
  "Undo": "Deshacer",
  "Redo": "Repetir",
  "Copy": "Copiar",
  "Cut": "Cortar",
  "Paste": "Pegar",
  "Delete Sprite": "Eliminar sprite",
  "Hold down space bar to move view": "Mantenga presionada la barra espaciadora para mover la vista",
  "Zoom in": "Acercarse",
  "Zoom out": "Alejarse",
  "Animation": "Animación",
  "Add new Frame": "Añadir un fotograma nuevo",
  "Eyedropper tool": "recoger color",
  "Lock palette": "Bloquear la paleta",
  "Move": "Mover",
  "Strip to animation": "Tira a animación",
  "Add Map": "Añadir mapa",
  "Background": "Fondo",
  "Add Asset": "Agregar recurso",
  "Delete Asset": "Eliminar recurso",
  "You can drop WAV files here": "Puede soltar archivos WAV aquí",
  "Add Sound": "Agregar sonido",
  "Delete Sound": "Eliminar Sonido",
  "Drop your sounds on the left. A sleek sound creation app will land here in the future!": "Arrastra tus archivos de sonido a la izquierda. ¡En el futuro habrá una aplicación de creación de sonido aquí!",
  "Synthesizer": "Sintetizador",
  "You can drop MP3 files here": "Soltar archivos MP3 aquí",
  "Add Music": "Agregar música",
  "Drop your music files on the left. A sleek music creation app will land here in the future!": "Arrastra tus archivos de música a la izquierda. Próximamente habrá una aplicación de creación de música.",
  "Start Tutorial": "Iniciar tutorial",
  "Project Title": "Título del Proyecto",
  "Project Slug": "Abreviatura del proyecto",
  "Project Secret Code": "código secreto del proyecto",
  "Secret URL for testing your project when not set to public": "URL secreta para probar su proyecto cuando no está configurado como público",
  "Orientation": "Orientación",
  "Any": "Cualquiera",
  "Portrait": "Vertical",
  "Landscape": "Horizontal",
  "Aspect ratio": "ratio de aspecto",
  "Free": "Libre",
  "Force 2:1": "Forzar 2:1",
  "Force 16:9": "Forzar 16:9",
  "Force 4:3": "Forzar 4:3",
  "Force 1:1 (square)": "Forzar 1:1 \n(cuadrado)",
  "2:1 or above": "2:1 o mayor",
  "16:9 or above": "16:9 o mayor",
  "4:3 or above": "4:3 o mayor",
  "1:1 or above": "1:1: o mayor",
  "Graphics library": "biblioteca de gráficos",
  "Storage used": "Espacio usado",
  "Users": "Usuarios",
  "Here is where your grant other users access to edit your project. Users added here are granted full control on your project, except for adding or deleting other users.": "Aquí es donde das acceso a otros usuarios para editar tu proyecto. Los usuarios agregados aquí tienen control total sobre el proyecto, excepto para agregar o eliminar otros usuarios.",
  "nickname": "nick",
  "Add User": "Agregar usuario",
  "Make public": "Hacer público",
  "You must validate your e-mail address before you can make your project public.": "Debes validar tu dirección de correo electrónico antes de poder hacer público tu proyecto.",
  "This project is currently private.": "Este proyecto es actualmente privado.",
  "Make private again": "Hazlo privado de nuevo",
  "This project is currently public.": "Este proyecto es actualmente público.",
  "Make public on microStudio": "Hacer público en microStudio",
  "Making your project public will allow it to be listed in the Explore section of the site. Public projects can be run and used by anyone. Making a project public allows anyone to view and possibly reuse the source code.": "Hacer público tu proyecto le permitirá aparecer en la sección Explorar del sitio. Los proyectos públicos pueden ser ejecutados y utilizados por cualquier persona. Hacer público un proyecto permite que cualquiera pueda ver y eventualmente reutilizar el código fuente.",
  "Description": "Descripción",
  "Tags": "Etiquetas",
  "Add": "agregar",
  "Export to HTML5": "Exportar a HTML5",
  "Exporting to HTML5 allows you to distribute your game as a web app or a standalone HTML app. Unzip contents, double-click index.html to start the game, or upload the contents to a subfolder of your existing web site.": "Exportar a HTML5 te permite distribuir tu juego como una aplicación web o como una aplicación HTML independiente. Descomprime el contenido, haz doble clic en index.html para iniciar el juego o bien carga el contenido en una subcarpeta de tu sitio web.",
  "You can also easily publish your HTML5 game on a number of platforms supporting HTML5 games. We have listed a few popular ones below, which you can check out:": "También puedes publicar fácilmente tu juego HTML5 en varias plataformas que admiten juegos HTML5. Hemos enumerado algunos populares a continuación, que puedes visitar:",
  "Build for Android": "Compilar para Android",
  "This will build an APK file of your game. An APK file is what you need to publish \nyour game on the Google Play Store, for Android devices.": "Esto creará un archivo APK de tu juego. Un archivo APK es lo que necesitas para publicar tu juego en Google Play Store para dispositivos Android.",
  "Build for Windows": "Compilar para Windows",
  "This will build your game as an executable for Windows (.EXE).": "Esto compilará tu juego como un ejecutable de Windows (.EXE).",
  "Build for macOS": "Compilar para macOS",
  "This will build your game as an executable for macOS.": "Esto compilará tu juego como un ejecutable de \nmacOS.",
  "Build for Linux": "Compilar para Linux",
  "This will build your game as an executable for Linux (Ubuntu, x86).": "Esto compilará tu juego como un ejecutable para Linux \n(Ubuntu, x86).",
  "Build for Raspberry Pi": "Compilar para Raspberry Pi",
  "This will build your game as an executable for Raspberry Pi (Raspbian).": "Esto compilará tu juego como un ejecutable de Raspberry Pi (Raspbian).",
  "Start creating": "Empieza a crear",
  "Create as a guest": "Crear como invitado",
  "Start using microStudio without creating an account.": "Comienza a usar microStudio sin crear una cuenta.",
  "Create my account": "Crear mi cuanta",
  "Save your projects, work in teams, publish, vote, comment...": "Guarda tus proyectos, trabaja en equipo, publica, vota, comenta...",
  "Log in to your existing account.": "Inicia sesión en tu cuenta existente.",
  "Registered User": "Registrar usuario",
  "Nickname or e-mail": "Nick o correo electrónico",
  "Password": "Contraseña",
  "Forgot password?": "¿Se te olvidó tu contraseña?",
  "Log in": "Iniciar sesión",
  "Don't have an account yet?": "¿Aún no tienes una cuenta?",
  "Password Recovery": "Recuperación de contraseña",
  "E-mail": "Correo electrónico",
  "Send password recovery e-mail": "Enviar correo electrónico de recuperación de contraseña",
  "Back to login": "Volver a iniciar sesión",
  "New User": "Nuevo Usuario",
  "E-mail address": "Dirección de correo electrónico",
  "Accept the": "Acepto",
  "Terms of Use": "Términos de Uso",
  "Receive news (maximum once per month)": "Recibir noticias (máximo una vez al mes)",
  "Already registered?": "¿Ya estás registrado?",
  "Log \nin to existing account": "Iniciar sesión en el perfil existente",
  "Title": "Título",
  "Create Project": "Crear proyecto",
  "Tutorial": "tutoriales",
  "[STORAGE] used of [MAX_STORAGE] ([PERCENT] %)": "[STORAGE] usado de [MAX_STORAGE] ([PERCENT] %)",
  "Mb": "MEGABYTE",
  "Gb": "GB",
  "Delete": "Eliminar",
  "Quit": "Salir",
  "All": "Todos",
  "Welcome!": "¡Bienvenidos!",
  "In this space you can ask for help, share your best tips, read articles, submit bugs or feature requests, follow the roadmap and progress of microStudio.": "En este espacio puedes solicitar ayuda, compartir tus mejores tips, leer artículos, enviar errores o solicitudes de característcas, seguir el roadmap y el progreso progreso de microStudio.",
  "You can discuss programming, game development, art, sound, music, useful tools and resources, microStudio and other game engines.": "Puedes hablar sobre programación, desarrollo de juegos, arte, sonido, música, herramientas y recursos útiles, microStudio y otros motores de juegos.",
  "For anything else there is an Off Topic category.": "Para todo lo demás hay una categoría Off Topic.",
  "DARK THEME": "TEMA OSCURO",
  "Activity": "Actividad",
  "New Post": "Nuevo mensaje",
  "Choose category...": "Elige la categoría...",
  "Title of your post": "Título de tu mensaje",
  "Write your text here ; you can use markdown": "Escribe tu texto aquí; puedes usar markdowns",
  "Preview": "Preview",
  "Cancel": "Cancelar",
  "Validate your e-mail address to participate in the community": "Valida tu dirección de correo electrónico para participar en la comunidad",
  "Post a reply": "Publicar una respuesta",
  "Progress": "Progreso",
  "Status": "Estado",
  "View tutorial source code": "Ver el código fuente del tutorial",
  "Duplicate Frame": "Duplicar fotograma",
  "Move Left": "Mover hacia la izquierda",
  "Move Right": "Mover a la derecha",
  "Build": "Contruir",
  "Delete file": "Eliminar archivo",
  "Warning: %EXP% is not a function": "Advertencia: %EXP% no es una función",
  "%ERROR%, in file %FILE% at line %LINE%, column %COLUMN%": "%ERROR%, en el archivo %FILE% en la línea %LINE%, columna %COLUMN%",
  "Last activity:": "Última actividad:",
  "%DAYS%d": "%DAYS%d",
  "Views:": "Vistas:",
  "Replies:": "Respuestas:",
  "Edit": "Editar",
  "Watch": "Observar",
  "Write": "Escribir",
  "%USER% posted a reply": "%USER% escribió una respuesta",
  "microStudio Community": "Comunidad microStudio",
  "%USER% posted a reply to %POST%:": "%USER% escribió una respuesta a %POST%:",
  "%NUM% days ago": "hace %NUM% días",
  "now": "Ahora",
  "LIGHT THEME": "TEMA CLARO",
  "Account created successfully!": "¡Cuenta creada con éxito!",
  "Microstudio e-mail validation": "Validación de correo electrónico de Microstudio",
  "Thank you for using Microstudio!": "¡Gracias por usar Microstudio!",
  "Click on the link below to validate your e-mail address:": "Haga clic en el siguiente enlace para validar tu dirección de correo electrónico:",
  "Your e-mail address is now validated": "Tu dirección de correo electrónico ahora está validada",
  "%USER% posted in %CATEGORY%": "%USER% comentó en %CATEGORY%",
  "%USER% published a new post in %CATEGORY%:": "%USER% creó una nueva publicación en %CATEGORY%:",
  "View doc": "Ver documentación",
  "%MINUTES%m": "%MINUTES%m",
  "%HOURS%h": "%HOURS%o",
  "Import doc to": "Importación de documentos en",
  "Import to project": "Importar al proyecto",
  "%NUM% hours ago": "Hace %NUM% horas",
  "Import source file to": "Importar el archivo fuente en",
  "email already exists": "el e-mail ya existe",
  "Incorrect nickname. Use 5 characters minimum, only letters, numbers or _": "Nick incorrecto. Utiliza un mínimo de 5 caracteres, solo letras, números o _",
  "Reset your microStudio password": "Restablece tu contraseña de microStudio",
  "Click on the link below to choose a new microStudio password:": "Haz clic en el enlace a continuación para elegir una nueva contraseña de microStudio",
  "Your password was successfully changed": "tu contraseña ha sido cambiada exitosamente",
  "Password too weak": "contraseña demasiado debil",
  "Do you really want to delete %ITEM%?": "¿Realmente deseas eliminar %ITEM%?",
  "nickname already exists": "el nick ya existe",
  "Welcome back!": "¡Bienvenido de nuevo!",
  "Kb": "kb",
  "Editing reply": "Editar respuesta",
  "Incorrect e-mail address": "Dirección de e-mail errónea",
  "Checklist before publishing": "Lista de verificación antes de publicar",
  "Before making your project public, please make sure to understand and comply with the following. Tick the boxes when you comply, then press the publication button again": "Antes de hacer público tu proyecto, asegúrate de comprender y cumplir con lo siguiente. Marca las casillas cuando estés de acuerdo, luego pulsa el botón publicar nuevamente",
  "My project is an original work, not a barely modified clone of an existing project.": "Mi proyecto es un trabajo original, no un clon ligeramente modificado de un proyecto existente.",
  "My project brings something interesting or fun to others, it's not \njust a test.": "Mi proyecto ofrece algo interesante o divertido a los demás, no es solo una prueba.",
  "I have created a nice icon for it (the default project icon is not accepted, please create yours!).": "He creado un bonito icono para el proyecto (el icono predeterminado no es aceptable, ¡crea uno propio!).",
  "I made the assets in my project myself (sprites, sounds, music), or I made sure that I am allowed to use and publish the assets I imported into it.": "Hice los recursos del proyecto yo mismo (sprites, sonidos, música) \no me aseguré de tener permiso para usar y publicar los activos que importé.",
  "If I am using an asset pack, I made sure to add the required credits and generally comply with the license of the asset packs.": "Si estoy usando un paquete de recursos, me aseguré de incluir las referencias requeridas y, en general, respetar la licencia del paquete de activos.",
  "Level %NUM%": "Nivel %NUM%",
  "Level": "Nivel",
  "XP": "PE",
  "Public Projects": "Proyectos públicos",
  "Characters Typed": "Caracteres escritos",
  "Lines of Code": "Líneas de \ncódigo",
  "minutes": "minutos",
  "Coding Time": "Tiempo de escritura del código",
  "New achievement unlocked!": "¡Nuevo logro desbloqueado!",
  "Level %LEVEL% unlocked!": "¡Nivel %LEVEL% desbloqueado!",
  "hours": "horas",
  "Map Editor Time": "Tiempo en el Editor de mapas",
  "Map Cells Painted": "Celdas pintadas en mapas",
  "Pixels Drawn": "píxeles dibujados",
  "Editing post": "Editando mensaje",
  "Stats & Achievements": "Estadísticas y logros",
  "Your Progress": "Tu progreso",
  "Statistics": "Estadísticas",
  "Achievements": "Logros",
  "Drawing Time": "Tiempo de dibujo",
  "Unwatch": "Descuidar",
  "Unlock palette": "Desbloquear paleta",
  "You will receive e-mail notifications when new replies to this post are published.": "Recibirás notificaciones por correo electrónico cuando se publiquen nuevas respuestas a esta publicación.",
  "Download": "Descargar",
  "%NUM% weeks ago": "Hace %NUMBER% semanas",
  "Really quit this project?": "¿Realmente abandonar este proyecto?",
  "Pencil": "Lápiz",
  "Eraser": "Borrador",
  "Fill": "Llenar",
  "Enhance": "Mejorar",
  "Select": "Seleccionar",
  "Copy Color": "Copiar color",
  "Bytes": "bytes",
  "Delete Frame": "Borrar fotograma",
  "Do you want to clone this project?": "¿Quieres clonar este proyecto?",
  "copy": "Copiar",
  "Project cloned! Here is your copy.": "¡Proyecto clonado! Aquí está tu copia.",
  "basic graphics API": "API básica de gráficos",
  "micro 2D - Experimental - Built on Pixi.js": "micro \n2D - Experimental - Basado en Pixi.js",
  "micro 3D - Experimental - Built on Babylon.js": "micro 3D - Experimental - Basado en Babylon.js",
  "Pixi.js - Experimental": "Pixi.js - Experimental",
  "Babylon.js - Experimental": "Babylon.js - Experimental",
  "Additional tools and libraries": "Herramientas y bibliotecas adicionales",
  "matter.js - 2D physics engine": "matter.js - motor de física 2D",
  "Note: this integration is experimental": "Nota: Esta integración es experimental",
  "cannon.js - 3D physics engine": "cannon.js - motor de \nfísica 3D",
  "Unlisted": "No listado",
  "If you mark your public project Unlisted, it will not show up in the main Explore section": "Si marcas tu proyecto público como no listado, no aparecerá en la sección principal de Explorar.",
  "Public link": "Enlace público",
  "Game Jam Contender": "Concursante de Game Jam",
  "You made a submission to a microStudio Game Jam": "Ha creado un proyecto para un microStudio Game Jam",
  "Impressionism": "Impresionismo",
  "You spent 1 hour drawing, amazing!": "Pasaste 1 hora dibujando, ¡increíble!",
  "Joseph Jacquard": "Joseph Jacquard",
  "You spent 2 hours coding, starts looking like an addiction!": "Pasé 2 horas programando, ¡está empezando a ser adictivo!",
  "Joseph Jacquard was a French weaver and merchant. He built and demonstrated the Jacquard loom, a programmable mechanized loom controlled by a tape constructed from punched cards.": "Joseph Jacquard fue un comerciante y tejedor francés. Construyó y presetó el telar Jacquard, un telar controlado por cinta mecanizada programable construida con tarjetas perforadas.",
  "Active Community Member": "Miembro activo de la comunidad",
  "You made a public post in the community forum!": "¡Hiciste una publicación pública en el foro de la comunidad!",
  "Game Programmer": "programador de juegos",
  "You completed the microStudio tutorial series on creating a simple game!": "¡Has completado la serie de tutoriales de microStudio sobre cómo crear un juego simple!",
  "Digital Art Coder": "programador de arte digital",
  "You completed the microStudio tutorials about drawing with code!": "¡Has completado los tutoriales de microstudio sobre cómo dibujar con código!",
  "Trained Programmer": "programador capacitado",
  "You completed the microStudio programming tutorial series!": "¡Has completado la serie de tutoriales de programación de microStudio!",
  "Renaissance": "Renacimiento",
  "You spent 30 minutes drawing, well done!": "Pasaste 30 minutos dibujando, ¡bien hecho!",
  "Gottfried Leibniz": "gottfried leibniz",
  "You spent 1 hour coding, amazing!": "Pasaste 1 hora programando, ¡increíble!",
  "Gottfried Leibniz was a German mathematician, philosopher, scientist and diplomat. He made advances in symbolic logic and his work was crucial for the theoretical foundations of computer science.": "Gottfried Leibniz fue un matemático, filósofo, científico y diplomático alemán. Hizo avances en lógica simbólica y su trabajo fue crucial para los fundamentos teóricos de la informática.",
  "Greek Art": "arte griego",
  "You spent 10 minutes drawing, keep it up!": "Pasaste 10 minutos dibujando, ¡sigue así!",
  "Blaise Pascal": "Blaise Pascual",
  "You spent 30 minutes coding, well done!": "Pasaste \n30 minutos programando, ¡bien hecho!",
  "Blaise Pascal was a French mathematician, physicist, inventor, philosopher. He invented the mechanical calculator.": "Blaise Pascal fue un matemático, físico, inventor y filósofo francés. Inventó la calculadora mecánica.",
  "Cave Art": "arte rupestre",
  "You started drawing!": "¡Has empezado a dibujar!",
  "Al Jazari": "Al-Jazari",
  "You spent 10 minutes coding, keep it up!": "Has pasado 10 minutos programando, ¡sigue así!",
  "Al Jazari was a Muslim scientist, artist, mathematician living in \nMesopotamia. He invented an astronomical clock considered the first programmable analog computer.": "Al Jazari fue un científico, artista y matemático musulmán que vivió en Mesopotamia. Inventó un reloj astronómico considerado como la primera computadora analógica programable. Has pasado 10 minutos programando, ¡sigue así!",
  "Recognition": "Reconocimiento",
  "Your public project received 5 likes!": "¡Tu proyecto público recibió 5 Me gusta!",
  "microStudio Tourist": "Turista de microStudio",
  "You completed the microStudio tour tutorial series!": "¡Has completado la serie de tutoriales de microStudio Tour!",
  "Al Khwarizmi": "Al Juarizmi",
  "You actually started coding!": "¡Has comenzado a programar!",
  "Al Khwarizmi was a Persian polymath who produced vastly influential works in mathematics, astronomy, and geography. His name gave rise to the term 'algorithm'.": "Al Khwarizmi fue un erudito persa que produjo obras muy influyentes en matemáticas, astronomía y geografía. Su nombre dio origen al término 'algoritmo'.",
  "Game Jam Silver": "Game Jam Plata",
  "You won the second prize in a microStudio Game Jam!": "¡Ganaste el segundo premio en un microStudio Game Jam!",
  "This project uses an experimental integration of graphics API:": "Este proyecto utiliza una integración de API de gráficos experimentales:",
  "This project uses an experimental integration of this library:": "Este proyecto utiliza una integración experimental de esta biblioteca:",
  "Surrealism": "Surrealismo",
  "You spent 10 hours drawing, isn't that crazy?": "Pasaste 10 horas dibujando, ¿no es una locura?",
  "Level Design Expert": "Experto en diseño de niveles",
  "You spent 2 hours working on maps, O.M.G!": "¡Pasaste 2 horas trabajando en los mapas, O.M.G!",
  "Senior Level Designer": "Diseñador de nivel Senior",
  "You spent 1 hour working on maps, starts looking like an addiction!": "Has pasado 1 hora trabajando en los mapas, ¡estás empezando a engancharte!",
  "Regular Level Designer": "Diseñador de niveles habitual",
  "You spent 30 minutes working on maps, amazing!": "Pasaste 30 minutos trabajando en los mapas, ¡increíble!",
  "Junior Level Designer": "Diseñador de niveles Junior",
  "You spent 10 minutes working on maps, well done!": "Has pasado 10 minutos trabajando en los mapas, ¡bien hecho!",
  "Level Design Rookie": "Principiante en diseño de niveles",
  "You started creating a map, keep it up!": "Has empezado a hacer un mapa, ¡sigue así!",
  "Expressionism": "Expresionismo",
  "You spent 5 \nhours drawing sprites, O.M.G!": "¡Has pasado 5 horas dibujando sprites, O.M.G!",
  "Ada Lovelace": "ada lovelace",
  "You spent 20 hours coding, seems more than just a hobby!": "Has pasado 20 horas programando, ¡parece más que un pasatiempo!",
  "Ada Lovelace was an English mathematician and writer. She anticipated applications beyond pure calculation to Babbage's Analytical Engine, and created the first algorithms for such a machine.": "Ada Lovelace fue una matemática y escritora inglesa. Anticipó aplicaciones más allá de la computación pura para el motor analítico de Babbage y creó los primeros algoritmos para tal máquina.",
  "George Boole": "Jorge Boole",
  "You spent 10 hours coding, isn't that crazy?": "Pasaste 10 horas programando, ¿no es una locura?",
  "George Boole was an English mathematician, philosopher and logician. He formalized Boolean algebra, the basis for digital logic and computer science.": "George Boole fue un matemático, filósofo y lógico inglés. Formalizó el álgebra booleana, la base de la lógica digital y la informática.",
  "Post Impressionism": "Post impresionismo",
  "You spent 2 hours drawing sprites, starts looking like an addiction!": "Has pasado 2 horas dibujando sprites, ¡Estás empezando a engancharte!",
  "Charles Babbage": "Charles Babbage",
  "You spent 5 hours coding, O.M.G!": "¡Has pasado 5 horas programando, O.M.G.!",
  "Charles Babbage was an English mathematician, philosopher, engineer and inventor. He originated the concept of a programmable general-purpose computer and designed the Analytical Engine.": "Charles Babbage fue un matemático, filósofo, ingeniero e inventor inglés. Él originó el concepto de una computadora programable de propósito general y diseñó el motor analítico.",
  "Experimental features": "Características experimentales",
  "Enable experimental features": "Activar características experimentales",
  "Experimental features can change, break or be removed anytime. You are warned!": "Las \nfunciones experimentales pueden cambiar, fallar o eliminarse en cualquier momento. ¡Estás advertido!",
  "Newsletter": "Boletines",
  "Game Jam Winner": "Ganador de un Game Jam",
  "You won the first prize in a microStudio Game Jam!": "¡Ganaste el primer premio en un microStudio Game Jam!",
  "Game Jam Bronze": "Bronce en un Game Jam",
  "You won the third prize in a microStudio Game Jam!": "¡Ganaste el tercer premio en un microStudio Game Jam!",
  "Emile Baudot": "Emile Baudot",
  "You spent 50 hours coding, keep it up!": "Has pasado 50 \nhoras programando, ¡sigue así!",
  "Emile Baudot was a French telegraph engineer and inventor. He created the first binary encoding system for communications, and today's modem speed unit baud is named after him.": "Emile Baudot fue un ingeniero e inventor de telégrafos francés. Creó el primer sistema de codificación binaria para las comunicaciones, y la unidad de velocidad del módem actual lleva su nombre.",
  "Abstract Art": "arte abstracto",
  "You spent 50 hours drawing, keep it up!": "Llevas 50 horas dibujando, ¡sigue así!",
  "Level Design Master": "Maestro de diseño de niveles",
  "You spent 10 hours working on maps, seems more than just a hobby!": "Has pasado 10 horas trabajando en los mapas, ¡parece \nmás que un pasatiempo!",
  "Level Design Mentor": "Mentor de diseño de niveles",
  "You spent 5 hours working on maps, isn't that crazy?": "Pasaste 5 horas trabajando en los mapas, \n¿no es una locura?",
  "Cubism": "Cubismo",
  "You spent 20 hours drawing, seems more than just a hobby!": "Has pasado 20 horas dibujando, ¡se siente como algo más que un pasatiempo!",
  "microScript v1 - interpreted": "microScript v1 - interpretado",
  "microScript v1 - transpiled": "microScript v1 - transpilado",
  "Language support": "Lenguaje soportado",
  "Standalone, offline application": "Aplicación independiente y fuera de línea",
  "Would you like to work completely offline? Download the microStudio standalone app for Windows, Mac, Linux and Raspberry Pi:": "¿Quieres trabajar completamente offline? Descarga la aplicación microStudio para Windows, Mac, Linux y Raspberry Pi:",
  "Fundamentals": "Fundamentos",
  "Quick Start": "Inicio rápido",
  "microScript programming": "Programación de microscript",
  "API reference": "Referencia de la API",
  "Advanced graphics": "Gráficos avanzados",
  "Optional libs": "Bibliotecas opcionales",
  "More programming languages": "Más lenguajes de programación",
  "(Transpiler activation was moved to project settings)": "(La activación de Transpiler se ha movido a la configuración del proyecto)",
  "Show advanced options": "Mostrar opciones avanzadas",
  "Python": "Python",
  "Lua": "Lua",
  "JavaScript": "JavaScript",
  "Hide advanced options": "Ocultar opciones avanzadas",
  "Translator": "Traductor",
  "You made microStudio more accessible by translating it to your language.": "Has hecho que microStudio sea más accesible al traducirlo a tu idioma.",
  "New": "Nuevo",
  "Top": "Top",
  "Github contributor": "Colaborador de Github",
  "You made microStudio better by contributing code to the project on Github!": "¡Has mejorado microStudio al contribuir con el código del proyecto a Github!",
  "%ERROR%, in file \"%FILE%\" at line %LINE%": "%ERROR%, en el archivo \"%FILE%\" en la línea %LINE%",
  "Relevance": "Relevancia",
  "microScript shines by its simplicity and interactivity. But you can also code in JavaScript, Python or Lua if you prefer.": "microScript brilla por su sencillez e interactividad. Pero también puedes escribir código en JavaScript, Python o Lua si lo prefieres.",
  "microStudio is open source": "microStudio es de código abierto",
  "microStudio is open source software, released under the MIT License:": "microStudio es un software de código abierto, publicado bajo la licencia MIT:",
  "Support me on Patreon": "Apóyame en Patreon",
  "You like microStudio and would like to support me? Check my Patreon!": "¿Te gusta microStudio y quieres apoyarme? ¡Mira mi Patreon!",
  "Run project": "Ejecutar proyecto",
  "Pause execution": "Pausar ejecución",
  "Restart project": "Reiniciar el proyecto",
  "Detach run window": "Separar la ventana de ejecución",
  "Take a picture": "Tomar una foto",
  "Project QR Code": "Código QR del proyecto",
  "Project Type": "Tipo de proyecto",
  "App (game, demo...)": "App (juegos, demos...)",
  "Library": "Biblioteca",
  "Save": "Guardar",
  "Set as project poster image": "Establecer como imagen de póster del proyecto",
  "Close": "Cerrar",
  "Bertrand Russell": "Bertrand Russell",
  "You spent 100 hours coding, keep it up!": "Has pasado 100 horas programando, ¡sigue así!",
  "Bertrand Russell was a British mathematician, philosopher and logician. His work had a considerable influence on computer science.": "Bertrand Russell fue un matemático, filósofo y lógico británico. Su trabajo ha tenido una influencia significativa en la informática.",
  "Really delete %ITEM%?": "¿Estás seguro de eliminar %ITEM%?",
  "Advanced": "Avanzado",
  "microStudio is a free game engine online. Learn, create and share with the community. Use the built-in sprite editor, map editor and code editor to create anything.": "microStudio es un motor de juegos online gratuito. Aprende, crea y comparte con la comunidad. Use el editor de sprites, el editor de mapas y el editor de código incorporados para crear cualquier cosa.",
  "OK": "De acuerdo",
  "%PROJECT% - by %USER%": "%PROJECT% - por %USER%",
  "More Tutorials": "Más tutoriales",
  "Check this great series of microStudio tutorials by mrLman:": "Prueba esta gran serie de tutoriales de microStudio de mrLman:",
  "Level Design Champion": "Campeón de diseño de niveles",
  "You spent 20 hours working on maps, keep it up!": "Has pasado 20 horas trabajando en los mapas, ¡sigue así!",
  "Do you really want to delete this folder and all its contents?": "¿Realmente deseas eliminar esta carpeta y su contenido?",
  "New Folder": "Nueva carpeta",
  "Sound": "Sonido",
  "Horizontal Flip": "Voltear horizontalmente",
  "Vertical Flip": "Voltear verticalmente",
  "Rotate Left": "Girar a la izquierda",
  "Rotate Right": "Gira a la derecha",
  "Contemporary": "Contemporáneo",
  "You spent 100 hours drawing, keep it up!": "Pasaste 100 horas dibujando, ¡Sigue así!",
  "Kurt GÃ¶del": "Kurt Gödel",
  "You \nspent 200 hours coding, keep it up!": "Pasaste 200 horas dibujando, ¡sigue así!",
  "Kurt GÃ¶del was a logician, mathematician and philosopher. His work on the logical consistency of mathematical systems lies at the foundation of modern computer science.": "Kurt Gödel fue un lógico, matemático y filósofo. Su trabajo sobre la consistencia lógica de los sistemas matemáticos es la base de la informática moderna.",
  "Your current code will be overwritten. Do you wish to proceed?": "Su código actual se sobrescribirá. ¿Quieres proceder?",
  "%YEARS%y": "%YEARS%y",
  "Really delete this project?": "¿Estás seguro de eliminar este proyecto?",
  "Active Tabs": "Pestañas activas",
  "microScript v2 - alpha": "microScript v2 - alfa",
  "Copy Code": "Copiar código",
  "Capture icon": "Capturar ícono",
  "You can drop assets here": "Puedes dejar recursos aquí",
  "Show Functions": "Mostrar funciones",
  "Show Objects": "Mostrar objetos",
  "Show Lists": "Mostrar listas",
  "Show Strings": "Mostrar cadenas",
  "Show Numbers": "Mostrar números",
  "Debug Tools": "Herramientas de depuración",
  "Forward": "Adelante",
  "Step Forward": "Paso Adelante",
  "Loop": "Bucle",
  "Step Backward": "Paso atrás",
  "Backward": "Hacia atrás",
  "Record": "Registro",
  "Time Machine": "Máquina del tiempo",
  "One Step Forward": "Un paso adelante",
  "microScript 1.0 - interpreted": "microScript 1.0 - interpretado",
  "microScript 1.0 - transpiled": "microScript 1.0 - transpilado"
}
