{"Create My Account":"Créer mon compte","Login":"Connexion","Explore":"Explorer","Create":"Créer","Documentation":"Documentation","About":"À propos","Settings":"Paramètres","Logout":"Déconnexion","Back":"Retour","Create Games":"Créer des jeux","Learn Programming":"Apprendre à programmer","Play":"Jouer","Share":"Partager","Prototype":"Prototyper","Jam":"Jammer","a free game development environment":"un environnement gratuit de développement de jeux","Go!":"C'est parti !","Run":"Lancer","Clone":"Cloner","Code":"Code","Sprites":"Sprites","Maps":"Maps","Doc":"Doc","User Settings":"Paramètres utilisateur","Nickname":"Pseudo","Change nickname":"Changer de pseudo","Your nickname will be displayed publicly.":"Votre pseudo pourra être affiché publiquement","E-mail Address":"Votre adresse e-mail","Change e-mail":"Modifier l'adresse e-mail","Your e-mail address is not validated yet. Check your e-mails and click on the validation link we sent to you. In case you did not receive the validation e-mail yet, use the button below to resend:":"Votre adresse e-mail n'est pas encore validée. Vérifiez vos mails et cliquez sur le lien de validation que nous vous avons envoyé. Au cas où vous ne l'auriez pas reçu, utilisez le bouton ci-dessous pour le renvoyer :","Resend validation e-mail":"Renvoyer l'e-mail de validation","We have just resent a validation e-mail.":"Nous vous avons renvoyé un e-mail de validation.","Receive newsletter":"Recevoir des informations","We will send you an information email no more than once a month.":"Nous vous enverrons une lettre d'informations, pas plus d'une fois par mois.","Open translation tool":"Ouvrir l'outil de traduction","Create New Project":"Créer un nouveau projet","My Projects":"Mes projets","Back to Projects":"Retour aux projets","Publish":"Publier","Files":"Fichiers","Add File":"Ajouter un fichier","Add Sprite":"Ajouter un sprite","Apply":"Appliquer","Undo":"Annuler","Redo":"Refaire","Copy":"Copier","Cut":"Couper","Paste":"Coller","Delete Sprite":"Supprimer le sprite","Eyedropper tool":"Pipette à couleurs","Add Map":"Ajouter une map","Project Title":"Titre du projet","Project Slug":"Identifiant du projet","Project Secret Code":"Code secret du projet","Secret URL for testing your project when not set to public":"Cette URL secrète permet de tester votre projet lorsqu'il n'est pas public","Orientation":"Orientation","Any":"N'importe","Portrait":"Portrait","Landscape":"Paysage","Aspect ratio":"Proportion","Free":"Libre","Force 2:1":"Forcer le 2:1","Force 16:9":"Forcer le 16:9","Force 4:3":"Forcer le 4:3","Force 1:1 (square)":"Forcer le 1:1 (carré)","2:1 or above":"2:1 ou au-delà","16:9 or above":"16:9 ou au-delà","4:3 or above":"4:3 ou au-delà","1:1 or above":"1:1 ou au-delà","Users":"Utilisateurs","Here is where your grant other users access to edit your project. Users added here are granted full control on your project, except for adding or deleting other users.":"C'est ici que vous pouvez autoriser d'autres utilisateurs à éditer votre projet. Les utilisateurs ajoutés ici peuvent accéder à tout et tout modifier sur votre projet, sauf les options ci-contre et l'ajout d'autres utilisateurs.","nickname":"pseudo","Add User":"Ajouter l'utilisateur","Make public":"Rendre public","You must validate your e-mail address before you can make your project public.":"Vous devez valider votre adresse e-mail avant de pouvoir publier votre projet.","This project is currently private.":"Ce projet est actuellement privé.","Make private again":"Rendre privé à nouveau","This project is currently public.":"Ce projet est actuellement public.","Description":"Description","Tags":"Tags","Add":"Ajouter","Nickname or e-mail":"Pseudo ou e-mail","Password":"Mot de passe","Forgot password?":"Mot de passe oublié ?","Log in":"Connexion","Don't have an account yet?":"Pas encore de compte ?","Create my account":"Créer mon compte","Password Recovery":"Récupération de mot de passe","E-mail":"Adresse e-mail","Send password recovery e-mail":"Envoyer le mail de récupération de mot de passe","Back to login":"Retour à la connexion","E-mail address":"Adresse e-mail","Accept the":"Accepter les","Terms of Use":"Conditions d'utilisation","Receive news (maximum once per month)":"Recevoir des informations (maximum une fois par mois)","Create Account":"Créer un compte","Already registered?":"Déjà inscrit ?","Log in to existing account":"Connexion au compte existant","Title":"Titre","Create Project":"Créer un projet","Welcome back!":"Bienvenue de retour parmi nous !","Incorrect nickname. Use 5 characters minimum, only letters, numbers or _":"Pseudo incorrect. Utilisez 5 caractères ou plus, seulement des lettres, chiffres ou _","Account created successfully!":"Compte créé avec succès !","Microstudio e-mail validation":"microStudio: valider votre adresse e-mail","Thank you for using Microstudio!":"Merci d'utiliser microStudio !","Click on the link below to validate your e-mail address:":"Cliquez sur le lien ci-dessous pour valider votre adresse e-mail :","email already exists":"un compte existe déjà avec cette adresse e-mail","Incorrect e-mail address":"Adresse e-mail incorrecte","Password too weak":"Mot de passe trop faible","Source file imported":"Fichier source importé","View doc":"Voir la doc","Delete file":"Supprimer le fichier","Public page":"Page publique","Your public page displays a list of your public projects.":"Votre page publique affiche la liste de vos projets publics.","Import doc to":"Importer la doc vers","Import to project":"Importer vers le projet","Import source file to":"Importer le fichier source vers","Changelog":"Changelog","Terms of use":"Conditions d'utilisation","Privacy":"Vie Privée","Your e-mail address is now validated":"Votre adresse e-mail est maintenant validée","Free game development environment online. Learn, create and share with the community. Use the built-in sprite editor, map editor and code editor. Change anything while your game is running and see the result instantly.":"Environnement de développement de jeux vidéo gratuit, pour apprendre, créer et partager avec la communauté. Inclut un éditeur de sprites, un éditeur de maps, un éditeur de code. Modifiez tout ce que vous voulez pendant l'exécution du jeu et voyez le résultat instantanément.","free game dev environment online":"environnement de développement de jeux, en ligne et gratuit","Export to HTML5":"Exporter en HTML5","Exporting to HTML5 allows you to distribute your game as a web app or a standalone HTML app. Unzip contents, double-click index.html to start the game, or upload the contents to a subfolder of your existing web site.":"Exporter en HTML5 vous permet de distribuer votre jeu comme une application web ou autonome. Dézippez le contenu, double-cliquez sur index.html pour démarrer le jeu, ou transférez le contenu dans un sous-dossier de votre site web existant.","You can also easily publish your HTML5 game on a number of platforms supporting HTML5 games. We have listed a few popular ones below, which you can check out:":"Vous pouvez aussi facilement publier votre jeu sur diverses plateformes qui acceptent les jeux en HTML5. Nous avons fait une liste non-exhaustive ci-dessous :","Make public on microStudio":"Rendre public sur microStudio","Making your project public will allow it to be listed in the Explore section of the site. Public projects can be run and used by anyone. Making a project public allows anyone to view and possibly reuse the source code.":"Votre projet rendu public sera affiché dans la section Explorer du site. Les projets publics peuvent être exécutés et utilisés par tout le monde. Rendre un projet public permet à quiconque de visualiser et réutiliser le code source.","Export all in a ZIP file":"Tout exporter dans un fichier ZIP","Validate your email to post comments":"Validez votre adresse e-mail pour commenter","Log in to post comments":"Connectez-vous pour commenter","Post":"Poster","Comments":"Commentaires","New User":"Nouvel utilisateur","Free game development environment online. Learn, create and share with the community, using the built-in sprite editor, map editor and code editor.":"Environnement de développement de jeux, en ligne et gratuit. Apprenez, créez et partagez avec la communauté, en utilisant les éditeurs de sprites, de maps et de code intégrés.","microStudio is a free game development environment.":"microStudio est un environnement gratuit pour développer des jeux vidéo.","Create games, learn programming, play, share, prototype and jam!":"Créez des jeux, apprenez la programmation, jouez, partagez, prototypez, jammez !","Online and integrated":"En ligne et intégré","microStudio includes all you need to write code, create sprites and maps for your 2D game.":"microStudio inclut tout ce dont vous avez besoin pour coder, créer des sprites et maps pour votre jeu 2D.","All from your web browser. Your project is stored in the cloud, accessible from anywhere.":"Tout se passe dans le navigateur. Votre projet est stocké dans le cloud, accessible de n'importe où.","Get into programming":"Mettez vous au code","Write your game code in microScript, a simple language inspired by LUA.":"Ecrivez le code de votre jeu en microScript, un langage simple inspiré de LUA.","The documentation is always there to help. Create cool demos in just a few lines of code.":"La documentation est toujours accessible. Créez de super démos en quelques lignes de code.","Design":"Création","Create pixel art sprites and maps with the included editors.":"Dessinez vos sprites en pixel art et vos maps avec les éditeurs inclus.","Using your sprites and maps from code is as easy as 1-2-3.":"Faites facilement référence à vos sprites et maps depuis votre code.","Adjusting is a breeze":"Modification: un jeu d'enfant","Change anything from your PC while testing your game on your mobile.":"Changez tout ce que vous voulez sur votre PC, pendant que vous testez votre jeu sur votre mobile.","Your changes are immediately reflected in your ongoing playing session.":"Vos modifications sont instantanément reflétées dans votre session de jeu en cours.","Bring your friends":"Venez avec vos amis","You can invite others to your project and work in teams.":"Vous pouvez inviter d'autres utilisateurs à travailler sur votre projet, en équipe.","microStudio automagically synchronizes all your project files in real time.":"microStudio synchronise automatiquement tous les fichiers de votre projet en temps réel.","Get your gear ready":"Préparez le matos","Control your game using the gamepad, touchscreen, keyboard or mouse inputs.":"Contrôlez votre jeu avec la manette, l'écran tactile, le clavier ou la souris.","Export your project to HTML5. More export options are coming!":"Exportez votre projet en HTML5. D'autres options d'export arrivent bientôt !","Join the community":"Rejoignez la communauté","Browse public games, demos, resources. Pick up what you need for your own project.":"Explorez les jeux publiés, les démos, les ressources. Récupérez ce dont vous avez besoin pour votre propre projet.","Contribute your best creations and help others.":"Partagez vos meilleures créations et aidez les autres.","So what now?":"Et maintenant ?","Explore public projects":"Explorer les projets publics","Start creating!":"Commencer à créer !","Quit and Delete":"Quitter et supprimer","Create as a guest":"Créer en tant qu'invité","Start using microStudio without creating an account.":"Commencez à utiliser microStudio sans créer de compte.","Save your projects, work in teams, publish, vote, comment...":"Sauvegardez vos projets, travaillez en équipe, publiez, votez, commentez...","Log in to your existing account.":"Connectez-vous à votre compte existant.","Guest":"Invité","Your projects will be displayed here.":"Vos projets seront affichés ici.","Time to create your first project!":"Il est  temps de créer votre premier projet !","Start creating":"Commencer à créer","Tutorials":"Tutoriels","Created in Strasbourg, France. See 'About' for more information":"Créé à Strasbourg, en France. Voir \"A propos\" pour plus d'informations.","You are not tracked here.":"Vous n'êtes pas pisté ici.","microStudio doesn't use any third-party tracking script.":"microStudio n'utilise aucun script de pistage tiers.","Animation":"Animation","Duplicate Frame":"Dupliquer l'étape","Delete Frame":"Supprimer l'étape","Move up":"Déplacer vers le haut","Move Down":"Déplacer vers le bas","Add new Frame":"Ajouter une étape","Learns the basics of programming and how to create games with microStudio:":"Apprenez les bases de la programmation et comment créer des jeux avec microStudio :","Learn the basics of programming and how to create games with microStudio:":"Apprenez les bases de la programmation et la création de jeux avec microStudio :","Tutorial":"Tutoriel","Copied!":"Copié !","Really quit this project?":"Voulez-vous vraiment quitter ce projet ?","Write your game code in microScript, a simple language inspired by Lua.":"Programmez votre jeu en microScript, un langage simple inspiré de Lua.","Learn programming, create video games - microStudio is a free game development environment online.":"Apprendre la programmation, créer des jeux vidéo - microStudio est un environnement en ligne et gratuit pour développer des jeux vidéo.","Zoom in":"Zoomer","Zoom out":"Dézoomer","Hold down space bar to move view":"Maintenir la barre espace pour déplacer la vue","Hot":"Tendance","Move":"Déplacer","Strip to animation":"Bande vers animation","New":"Nouveau","Top":"Meilleurs","Move Left":"Déplacer vers la gauche","Move Right":"Déplacer vers la droite","Add Sound":"Ajouter un son","Delete Sound":"Supprimer le son","Lock palette":"Verrouiller la palette","Learn programming, create games":"Apprendre à programmer, créer des jeux vidéo","Build for Android":"Exporter une app Android","This will build an APK file of your game. An APK file is what you need to publish your game on the Google Play Store, for Android devices.":"Cette option va créer un fichier APK de votre jeu. Un fichier APK est requis pour publier votre jeu dans le Google Play Store, pour les appareils Android.","Build for Windows":"Exporter une app Windows","Build for macOS":"Exporter une app macOS","Build for Linux":"Exporter une app Linux","Build for Raspberry Pi":"Exporter une app pour Raspberry Pi","This will build your game as an executable for Windows (.EXE).":"Cette option va créer un fichier exécutable de votre jeu pour Windows (.EXE).","This will build your game as an executable for macOS.":"Cette option va créer un fichier exécutable de votre jeu pour macOS.","This will build your game as an executable for Linux (Ubuntu, x86).":"Cette option va créer un fichier exécutable de votre jeu pour Linux (Ubuntu, x86).","This will build your game as an executable for Raspberry Pi (Raspbian).":"Cette option va créer un fichier exécutable de votre jeu pour Raspberry Pi (Raspbian).","Export your project in a single click to HTML5, Windows, Linux, macOS. More export options are coming!":"Exportez votre projet en un clic pour Windows, Linux, macOS ou en HTML5. D'autres options d'export arrivent !","Learn programming, create video games - microStudio is a free game engine online.":"Apprendre à programmer, créer des jeux vidéo - microStudio est un moteur de jeu gratuit, en ligne.","microStudio is a free game engine online.":"microStudio est un moteur de jeu gratuit, en ligne.","Sounds":"Sons","Music":"Musique","Synthesizer":"Synthétiseur","Add Music":"Ajouter une musique","Registered User":"Utilisateur enregistré","Quit":"Quitter","Delete":"Supprimer","Do you want to clone this project?":"Voulez-vous cloner ce projet ?","copy":"copie","Project cloned! Here is your copy.":"Projet cloné ! Voici votre copie.","[STORAGE] used of [MAX_STORAGE] ([PERCENT] %)":"[STORAGE] utilisés sur [MAX_STORAGE] ([PERCENT] %)","Bytes":"Octets","Mb":"Mo","Kb":"Ko","%NUM% hours ago":"il y a %NUM% heures","Gb":"Go","Storage used":"Stockage utilisé","Graphics library":"Bibliothèque graphique","Account Type":"Type de compte","Storage":"Stockage","Warning: %EXP% is not defined, defaulting to zero":"Attention : %EXP% n'est pas défini, mise à zéro par défaut","%ERROR%, in file %FILE% at line %LINE%, column %COLUMN%":"%ERROR%, dans le fichier %FILE%, ligne %LINE%, colonne %COLUMN%","%NUM% weeks ago":"il y a %NUM% semaines","Your password was successfully changed":"Votre mot de passe a été modifié avec succès","nickname already exists":"ce pseudo existe déjà","Click on the link below to choose a new microStudio password:":"Cliquez sur le lien ci-dessous pour choisir un nouveau mot de passe :","Reset your microStudio password":"Changement de mot de passe microStudio","Build":"Fabriquer","Warning: %EXP% is not a function":"Attention : %EXP% n'est pas une fonction","Warning: %EXP% is not defined, will be initialized to an empty object":"Attention : %EXP% n'est pas défini, la valeur par défaut sera zéro.","Display warning when using an undefined variable":"Afficher un avertissement lorsqu'une variable non-définie est utilisée","Display warning when calling something that isn't a function":"Afficher un avertissement lorsqu'on appelle quelque chose qui n'est pas une fonction","Display warning when setting property on an undefined variable":"Afficher un avertissement lors d'une tentative d'assigner une propriété à une variable non-définie","You can drop PNG or JPEG files here":"Vous pouvez déposer des fichiers JPG ou PNG ici","You can drop WAV files here":"Vous pouvez déposer des fichiers WAV ici","Drop your sounds on the left. A sleek sound creation app will land here in the future!":"Déposez vos sons sur la gauche. Une super appli de création de sons arrivera bientôt dans microStudio !","You can drop MP3 files here":"Vous pouvez déposer vos fichiers MP3 ici","Drop your music files on the left. A sleek music creation app will land here in the future!":"Déposez vos fichiers musicaux sur la gauche. Une super appli de création de musique fera son apparition dans microStudio dans quelques mois.","Download":"Télécharger","Server will be rebooted for maintenance in %HOURS% hours":"Le serveur sera redémarré pour maintenance dans %HOURS% heures","Server will be rebooted for maintenance in %MINUTES% minutes":"Le serveur va être redémarré pour maintenance dans %MINUTES% minutes","Community":"Communauté","Start Tutorial":"Démarrer le tutoriel","All":"Tout","Welcome!":"Bienvenue !","In this space you can ask for help, share your best tips, read articles, submit bugs or feature requests, follow the roadmap and progress of microStudio.":"Dans cet espace vous pouvez trouver de l'aide, partager vos meilleures astuces, lire des articles, soumettre des bugs ou des suggestions d'améliorations, suivre la feuille de route et les mises à jour de microStudio.","For anything else there is an Off Topic category.":"Pour tout le reste il y a la catégorie Hors-Sujet.","You can discuss programming, game development, art, sound, music, useful tools and resources, microStudio and other game engines.":"Vous pouvez discuter programmation, développement de jeux, graphisme, son, musique, ressources et outils,  de microStudio et d'autres moteurs de jeu.","New Post":"Nouvelle publication","Choose category...":"Choisissez une catégorie...","Title of your post":"Titre de votre publication","Write your text here ; you can use markdown":"Rédigez votre texte ; vous pouvez utiliser Markdown","Preview":"Aperçu","Cancel":"Annuler","Validate your e-mail address to participate in the community":"Validez votre adresse e-mail pour participer à la communauté","Last activity:":"Dernière activité :","%HOURS%h":"%HOURS%h","Views:":"Vues :","Replies:":"Réponses :","Post a reply":"Poster une réponse","Progress":"Avancement","Status":"Statut","Edit":"Modifier","now":"maintenant","%MINUTES%m":"%MINUTES%m","Write":"Rédiger","%NUM% days ago":"il y a %NUM% jours","%DAYS%d":"%DAYS%j","View tutorial source code":"Voir le code source du tutoriel","Editing post":"Modifier la publication","DARK THEME":"THEME SOMBRE","LIGHT THEME":"THEME CLAIR","Post Reply":"Publier une réponse","Activity":"Activité","Likes":"Pouces","Views":"Vues","Replies":"Réponses","Relevance":"Pertinence","Created":"Création","microStudio is getting a new server! Migration planned on %DATE% at %TIME%. Downtime will last 1 hour.":"microStudio va avoir un nouveau serveur ! La migration est prévue le %DATE% à %TIME%. L'arrêt va durer 1 heure.","Profile":"Profil","Export":"Exporter","Your Profile":"Votre profil","User Description":"Votre description","Tell us more about yourself (only if you wish to). This text will be displayed on your public page.":"Dites-nous en plus sur vous (seulement si vous le souhaitez !). Ce texte s'affichera sur votre page publique.","Profile Image":"Image de profil","Remove Profile Image":"Supprimer l'image de profil","Drop your image here. This image will be displayed publicly, along with your nickname.":"Déposez votre image ici. Cette image sera affichée publiquement à côté de votre pseudo.","Check your public page":"Visualiser votre page publique","Your public page displays your nickname, description, profile image and a list of your public projects.":"Votre page publique affiche votre pseudo, votre description, image de profil et la liste de vos projets publics.","Import Project":"Importer un projet","Assets":"Elements","Use transpiler [Caution: alpha version, may not work]":"Utiliser le transpiler [attention, version alpha]","Background":"Arrière plan","Add Asset":"Ajouter un élément","Delete Asset":"Supprimer l'élément","Watch":"Suivre","%USER% posted a reply":"%USER% a posté une réponse","microStudio Community":"Communauté microStudio","%USER% posted a reply to %POST%:":"%USER% a posté une réponse à %POST%","%USER% posted in %CATEGORY%":"%USER% a posté dans %CATEGORY%","%USER% published a new post in %CATEGORY%:":"%USER% a publié un nouveau post dans %CATEGORY%","Unwatch":"Ne plus suivre","wrong password":"mot de passe erroné","Checklist before publishing":"A vérifier avant publication","Before making your project public, please make sure to understand and comply with the following. Tick the boxes when you comply, then press the publication button again":"Avant de publier vérifiez que vous comprenez et êtes en conformité avec les points suivants. Cochez les cases lorsque c'est le cas, puis cliquez une nouvelle fois sur le bouton de publication.","My project is an original work, not a barely modified clone of an existing project.":"Mon projet est un travail original, pas un simple clone à peine modifié d'un projet existant.","My project brings something interesting or fun to others, it's not just a test.":"Mon projet apporte quelque chose d'intéressant ou d'amusant pour les autres, ce n'est pas juste un test.","I have created a nice icon for it (the default project icon is not accepted, please create yours!).":"J'ai créé une belle icône pour mon projet (l'icône de projet par défaut n'est pas acceptée)","I made the assets in my project myself (sprites, sounds, music), or I made sure that I am allowed to use and publish the assets I imported into it.":"J'ai créé les éléments de mon projet moi-même (sprites, sons, musique), ou je me suis assuré d'avoir le droit de publier les éléments que j'ai importés.","If I am using an asset pack, I made sure to add the required credits and generally comply with the license of the asset packs.":"Dans le cas où j'utilise un \"asset pack\", je m'assure d'ajouter les mentions nécessaires et plus généralement de me conformer à la licence prévue pour ledit \"asset pack\".","%NUM% minutes ago":"il y a %NUM% minutes","Stats & Achievements":"Statistiques & Succès","Your Progress":"Votre progression","Statistics":"Statistiques","Achievements":"Succès","Level %NUM%":"Niveau %NUM%","Level":"Niveau","XP":"XP","Public Projects":"Projets Publics","Characters Typed":"Caractères saisis","Lines of Code":"Lignes de code","minutes":"minutes","Coding Time":"Temps passé à coder","New achievement unlocked!":"Nouveau succès débloqué !","Level %LEVEL% unlocked!":"Niveau %LEVEL% débloqué !","Drawing Time":"Temps passé à dessiner"}
