{"Learn programming, create video games - microStudio is a free game engine online.":"Impara a programmare, crea video giochi - microStudio è un editor di giochi gratuito e online","Learn programming, create games":"Impara a programmare, crea giochi","Create My Account":"Crea il Mio Profilo","Login":"Accesso","Explore":"Esplora","Create":"Crea","Tutorials":"Tutorial","Documentation":"Documentazione","Community":"Comunità","About":"Informazioni","Settings":"Opzioni","Profile":"Profilo","Logout":"Disconnessione","Create Account":"Crea Profilo","Quit and Delete":"Esci e Cancella","microStudio is a free game engine online.":"microStudio è un motore di gioco online","Create games, learn programming, play, share, prototype and jam!":"Crea giochi, impara a programmare, gioca, condividi, prototipa e sperimenta!","Online and integrated":"Online e integrato","microStudio includes all you need to write code, create sprites and maps for your 2D game.":"microStudio include tutto ciò di cui hai bisogno, per scrivere codice, creare sprites e mappe per il tuo gioco 2D","All from your web browser. Your project is stored in the cloud, accessible from anywhere.":"Tutto dal tuo browser. Il tuo progetto è salvato in cloud, accessibile ovunque.","Get into programming":"Entra nella programmazione","Write your game code in microScript, a simple language inspired by Lua.":"Scrivi il tuo codice in microScript, un semplice linguaggio ispirato a Lua.","The documentation is always there to help. Create cool demos in just a few lines of code.":"La documentazione è disponibile per aiutarti. Crea bellissime demo in poche righe di codice.","Design":"Progetta","Create pixel art sprites and maps with the included editors.":"Crea arte pixellosa e mappe con gli editor inclusi.","Using your sprites and maps from code is as easy as 1-2-3.":"Usare i tuoi sprites e le mappe tramite il codice è semplice come contare 1-2-3","Adjusting is a breeze":"La modifica è un gioco da ragazzi","Change anything from your PC while testing your game on your mobile.":"Cambia qualsiasi cosa dal tuo PC mentre provi il tuo gioco dal telefono.","Your changes are immediately reflected in your ongoing playing session.":"Le tue modifiche sono applicate immediatamente alla sessione di gioco in corso","Bring your friends":"Porta i tuoi amici","You can invite others to your project and work in teams.":"Puoi invitare altre persone a partecipare al tuo progetto come una squadra","microStudio automagically synchronizes all your project files in real time.":"microStudio magicamente sincronizza tutti i vostri progetti in tempo reale","Get your gear ready":"Prepara il tuo equipaggiamento","Control your game using the gamepad, touchscreen, keyboard or mouse inputs.":"Controlla il tuo gioco tramite gamepad, touchscreen, tastiera o mouse","Export your project in a single click to HTML5, Windows, Linux, macOS. More export options are coming!":"Esporta il tuo progetto in un singolo click in HTML5, Window, Linux, macOS. Altre opzioni di esportazione stanno per arrivare!","Join the community":"Unisciti alla comunità","Browse public games, demos, resources. Pick up what you need for your own project.":"Esplora i giochi pubblici, le demo, risorse. Prendi quello di cui hai bisogno per il tuo progetto.","Contribute your best creations and help others.":"Contribuisci con le tue migliori creazioni e aiuta gli altri.","So what now?":"Quindi adesso?","Explore public projects":"Esplora i progetti pubblici","Start creating!":"Inizia a creare!","Created in Strasbourg, France. See 'About' for more information":"Creato a Strasburgo, Francia. Consulta le 'Informazioni' per ulteriori dettagli","You are not tracked here.":"Non sei tracciato qui.","microStudio doesn't use any third-party tracking script.":"microStudio non usa nessun script di terze parti per la tracciabilità.","Back":"Indietro","Hot":"Hot","Run":"Esegui","Clone":"Clona","Export":"Esporta","Comments":"Commenti","Post":"Commenta","Log in to post comments":"Esegui l'accesso per scrivere commenti","Validate your email to post comments":"Verifica la tua mail per scrivere commenti","Code":"Codice","Sprites":"Sprites","Sounds":"Suoni","Music":"Musica","Doc":"Doc","Export all in a ZIP file":"Esporta tutto in un file ZIP","Changelog":"Ultime modifiche","Terms of use":"Condizioni d'uso","Privacy":"Privacy","Learn the basics of programming and how to create games with microStudio:":"Impara le basi della programmazione e come creare giochi con microStudio:","User Settings":"Impostazioni Utente","Nickname":"Soprannome","Change nickname":"Cambia soprannome","Your nickname will be displayed publicly.":"Il tuo soprannome sarà visualizzato pubblicamente.","E-mail Address":"Indirizzo e-mail","Change e-mail":"Cambia e-mail","Your e-mail address is not validated yet. Check your e-mails and click on the validation link we sent to you. In case you did not receive the validation e-mail yet, use the button below to resend:":"Il tuo indirizzo e-mail non è ancora stato convalidato. Controlla le tue e-mail e clicca sul link di convalida che ti abbiamo inviato. Se non hai ancora ricevuto l'e-mail di convalida, usa il pulsante qui sotto per inviarla nuovamente:","Resend validation e-mail":"Rispedisci l'e-mail di convalida","We have just resent a validation e-mail.":"Abbiamo appena rispedito un'e-mail di convalida.","Receive newsletter":"Ricevi la newsletter","We will send you an information email no more than once a month.":"Ti invieremo un'e-mail informativa non più di una volta al mese.","Account Type":"Tipo di account","Storage":"Spazio di archiviazione","Open translation tool":"Apri lo strumento per la traduzione","Your Profile":"Il tuo Profilo","User Description":"Descrizione dell'utente","Tell us more about yourself (only if you wish to). This text will be displayed on your public page.":"Dicci di più su di te (solo se lo desideri). Questo testo sarà visualizzato sulla tua pagina pubblica.","Profile Image":"Immagine del profilo","Remove Profile Image":"Rimuovere l'immagine del profilo","Drop your image here. This image will be displayed publicly, along with your nickname.":"Carica qui la tua immagine. Questa immagine sarà visualizzata pubblicamente, insieme al tuo soprannome.","Check your public page":"Consulta la tua pagina pubblica","Your public page displays your nickname, description, profile image and a list of your public projects.":"La tua pagina pubblica mostra il tuo soprannome, la descrizione, l'immagine del profilo e un elenco dei tuoi progetti pubblici.","My Projects":"I miei progetti","Create New Project":"Creare un nuovo progetto","Import Project":"Importa progetto","Back to Projects":"Ritorna ai progetti","Maps":"Mappe","Assets":"Risorse","Publish":"Pubblica","Files":"Files","Add File":"Aggiungi File","Display warning when using an undefined variable":"Visualizza un avviso quando si usa una variabile non definita","Display warning when calling something that isn't a function":"Visualizzare un avvertimento quando si chiama qualcosa che non è una funzione","Display warning when setting property on an undefined variable":"Visualizza un avviso quando si imposta una proprietà su una variabile non definita","Use transpiler [Caution: alpha version, may not work]":"Usa il transpiler [Attenzione: versione alfa, potrebbe non funzionare].","You can drop PNG or JPEG files here":"Puoi rilasciare qui i file PNG o JPEG","Add Sprite":"Aggiungi Sprite","Apply":"Applica","Undo":"Annulla","Redo":"Ripeti","Copy":"Copia","Cut":"Taglia","Paste":"Incolla","Delete Sprite":"Cancella Sprite","Hold down space bar to move view":"Tenere premuta la barra spaziatrice per spostare la vista","Zoom in":"Ingrandisci","Zoom out":"Rimpicolisci","Animation":"Animazione","Add new Frame":"Aggiungi un fotogramma","Eyedropper tool":"Raccogli colore","Lock palette":"Blocca la tavolozza","Move":"Sposta","Strip to animation":"Striscia di animazione","Add Map":"Aggiungi mappa","Background":"Sfondo","Add Asset":"Aggiungi Risorsa","Delete Asset":"Cancella Risorsa","You can drop WAV files here":"Puoi rilasciare file WAV qui","Add Sound":"Aggiungi Suono","Delete Sound":"Cancella Suono","Drop your sounds on the left. A sleek sound creation app will land here in the future!":"Rilascia i tuoi suoni sulla sinistra. Una raffinata app per la creazione di suoni approderà qui in futuro!","Synthesizer":"Sintetizzatore","You can drop MP3 files here":"Puoi rilasciare file MP3 qui","Add Music":"Aggiungi Musica","Drop your music files on the left. A sleek music creation app will land here in the future!":"Rilascia i tuoi file musicali sulla sinistra. Una raffinata app per la creazione di musica sarà presto disponibile.","Start Tutorial":"Inizia Tutorial","Project Title":"Titolo del Progetto","Project Slug":"Slug del Progetto","Project Secret Code":"Codice segreto del Progetto","Secret URL for testing your project when not set to public":"URL segreto per testare il tuo progetto quando non è impostato su pubblico","Orientation":"Orientamento","Any":"Qualsiasi","Portrait":"Verticale","Landscape":"Orizzontale","Aspect ratio":"Formato","Free":"Libero","Force 2:1":"Forza 2:1","Force 16:9":"Forza 16:9","Force 4:3":"Forza 4:3","Force 1:1 (square)":"Forza 1:1 (quadrato)","2:1 or above":"2:1 o maggiore","16:9 or above":"16:9 o maggiore","4:3 or above":"4:3 o maggiore","1:1 or above":"1:1: o maggiore","Graphics library":"Libreria grafica","Storage used":"Spazio utilizzato","Users":"Utenti","Here is where your grant other users access to edit your project. Users added here are granted full control on your project, except for adding or deleting other users.":"Qui è dove concedi ad altri utenti l'accesso per modificare il tuo progetto. Agli utenti aggiunti qui viene concesso il controllo completo sul progetto, ad eccezione dell'aggiunta o dell'eliminazione di altri utenti.","nickname":"soprannome","Add User":"Aggiungi Utente","Make public":"Rendi pubblico","You must validate your e-mail address before you can make your project public.":"Devi convalidare il tuo indirizzo e-mail prima di poter rendere pubblico il tuo progetto.","This project is currently private.":"Questo progetto è attualmente privato.","Make private again":"Rendere nuovamente privato","This project is currently public.":"Questo progetto è attualmente pubblico.","Make public on microStudio":"Rendi pubblico su microStudio","Making your project public will allow it to be listed in the Explore section of the site. Public projects can be run and used by anyone. Making a project public allows anyone to view and possibly reuse the source code.":"Rendere pubblico il tuo progetto ti permetterà di essere elencato nella sezione Explore del sito. I progetti pubblici possono essere eseguiti e utilizzati da chiunque. Rendere pubblico un progetto permette a chiunque di visualizzare ed eventualmente riutilizzare il codice sorgente.","Description":"Descrizione","Tags":"Etichette","Add":"Aggiungi","Export to HTML5":"Esporta in HTML5","Exporting to HTML5 allows you to distribute your game as a web app or a standalone HTML app. Unzip contents, double-click index.html to start the game, or upload the contents to a subfolder of your existing web site.":"L'esportazione in HTML5 ti permette di distribuire il tuo gioco come web app o come app HTML indipendente. Decomprimi il contenuto, fai doppio clic su index.html per avviare il gioco, o carica il contenuto in una sottocartella del tuo sito web.","You can also easily publish your HTML5 game on a number of platforms supporting HTML5 games. We have listed a few popular ones below, which you can check out:":"Puoi anche pubblicare facilmente il tuo gioco HTML5 su una serie di piattaforme che supportano i giochi HTML5. Ne abbiamo elencate alcune popolari qui sotto, che puoi visitare:","Build for Android":"Compilare per Android","This will build an APK file of your game. An APK file is what you need to publish your game on the Google Play Store, for Android devices.":"Questo costruirà un file APK del tuo gioco. Un file APK è ciò di cui hai bisogno per pubblicare il tuo gioco sul Google Play Store, per i dispositivi Android.","Build for Windows":"Compila per Windows","This will build your game as an executable for Windows (.EXE).":"Questo compilerà il vostro gioco come un eseguibile per Windows (.EXE).","Build for macOS":"Compila per macOS","This will build your game as an executable for macOS.":"Questo compilerà il vostro gioco come eseguibile per macOS.","Build for Linux":"Compila per Linux","This will build your game as an executable for Linux (Ubuntu, x86).":"Questo compilerà il tuo gioco come eseguibile per Linux (Ubuntu, x86).","Build for Raspberry Pi":"Compila per Raspberry Pi","This will build your game as an executable for Raspberry Pi (Raspbian).":"Questo compilerà il vostro gioco come eseguibile per Raspberry Pi (Raspbian).","Start creating":"Inizia a creare","Create as a guest":"Crea come ospite","Start using microStudio without creating an account.":"Inizia ad usare microStudio senza creare un profilo.","Create my account":"Crea il mio Profilo","Save your projects, work in teams, publish, vote, comment...":"Salva i tuoi progetti, lavora in team, pubblica, vota, commenta...","Log in to your existing account.":"Accedi al tuo profilo esistente.","Registered User":"Registra Utente","Nickname or e-mail":"Soprannome o e-mail","Password":"Password","Forgot password?":"Password dimenticata?","Log in":"Accedi","Don't have an account yet?":"Non hai ancora un profilo?","Password Recovery":"Recupero Password","E-mail":"E-mail","Send password recovery e-mail":"Invia e-mail di recupero password","Back to login":"Torna all'accesso","New User":"Nuovo Utente","E-mail address":"Indirizzo e-mail","Accept the":"Accetta i","Terms of Use":"Condizioni di utilizzo","Receive news (maximum once per month)":"Ricevere notizie (massimo una volta al mese)","Already registered?":"Sei già registrato?","Log in to existing account":"Accedi all profilo esistente","Title":"Titolo","Create Project":"Crea Progetto","Tutorial":"Tutorial","[STORAGE] used of [MAX_STORAGE] ([PERCENT] %)":"[STORAGE] usato di [MAX_STORAGE] ([PERCENT] %)","Mb":"Mb","Gb":"Gb","Delete":"Cancella","Quit":"Esci","All":"Tutto","Welcome!":"Benvenuto!","In this space you can ask for help, share your best tips, read articles, submit bugs or feature requests, follow the roadmap and progress of microStudio.":"In questo spazio puoi chiedere aiuto, condividere i tuoi migliori consigli, leggere articoli, inviare bug o richieste di funzionalità, seguire la pianificazione e i progressi di microStudio.","You can discuss programming, game development, art, sound, music, useful tools and resources, microStudio and other game engines.":"Puoi discutere di programmazione, sviluppo di giochi, arte, suono, musica, strumenti e risorse utili, microStudio e altri motori di gioco.","For anything else there is an Off Topic category.":"Per qualsiasi altra cosa c'è una categoria Off Topic.","DARK THEME":"TEMA SCURO","Activity":"Attività","New Post":"Nuovo Messaggio","Choose category...":"Scegli la categoria...","Title of your post":"Titolo del tuo messaggio","Write your text here ; you can use markdown":"Scrivi qui il tuo testo; puoi usare il markdown","Preview":"Anteprima","Cancel":"Annulla","Validate your e-mail address to participate in the community":"Convalida il tuo indirizzo e-mail per partecipare alla comunità","Post a reply":"Pubblica una risposta","Progress":"Progressi","Status":"Stato","View tutorial source code":"Visualizza il codice sorgente del tutorial","Duplicate Frame":"Dupliaca Fotogramma","Move Left":"Sposta a sinistra","Move Right":"Sposta a destra","Build":"Compila","Delete file":"Cancella file","Warning: %EXP% is not a function":"Attenzione: %EXP% non è una funzione","%ERROR%, in file %FILE% at line %LINE%, column %COLUMN%":"%ERROR%, nel file %FILE% alla linea %LINE%, colonna %COLUMN%","Last activity:":"Ultima attività:","%DAYS%d":"%DAYS%g","Views:":"Visualizzazioni:","Replies:":"Risposte:","Edit":"Modifica","Watch":"Osserva","Write":"Scrivi","%USER% posted a reply":"%USER% ha scritto una risposta","microStudio Community":"microStudio Community","%USER% posted a reply to %POST%:":"%USER% ha scritto una risposta a %POST%:","%NUM% days ago":"%NUM% giorni fa","now":"ora","LIGHT THEME":"TEMA CHIARO","Account created successfully!":"Profilo creato correttamente!","Microstudio e-mail validation":"Convalida e-mail Microstudio","Thank you for using Microstudio!":"Grazie per aver utilizzato Microstudio!","Click on the link below to validate your e-mail address:":"Clicca sul link sottostante per convalidare il tuo indirizzo e-mail:","Your e-mail address is now validated":"Il tuo indirizzo e-mail è ora convalidato","%USER% posted in %CATEGORY%":"%USER% ha commentato in %CATEGORY%","%USER% published a new post in %CATEGORY%:":"%USER% ha creato un nuovo messaggio in %CATEGORY%:","View doc":"Vedi documentazione","%MINUTES%m":"%MINUTES%m","%HOURS%h":"%HOURS%o","Import doc to":"Importazione di documenti in","Import to project":"Importa nel progetto","%NUM% hours ago":"%NUM% ore fa","Import source file to":"Importare il file sorgente in","email already exists":"l'email esiste già","Incorrect nickname. Use 5 characters minimum, only letters, numbers or _":"Soprannome scorretto. Usa un minimo di 5 caratteri, solo lettere, numeri o _","Reset your microStudio password":"Resetta la tua password microStudio","Click on the link below to choose a new microStudio password:":"Clicca sul link qui sotto per scegliere una nuova password di microStudio","Your password was successfully changed":"La tua password è stata cambiata correttamente","Password too weak":"Password troppo debole","Do you really want to delete %ITEM%?":"Vuoi veramente cancellare %ITEM%?","nickname already exists":"il soprannome esiste già","Welcome back!":"Bentornato!","Kb":"Kb","Editing reply":"Modifica la risposta","Incorrect e-mail address":"Indirizzo e-mail errato","Checklist before publishing":"Lista di controllo prima di pubblicare","Before making your project public, please make sure to understand and comply with the following. Tick the boxes when you comply, then press the publication button again":"Prima di rendere pubblico il tuo progetto, assicurati di capire e rispettare quanto segue. Spunta le caselle quando sei d'accordo, poi premi di nuovo il pulsante di pubblicazione","My project is an original work, not a barely modified clone of an existing project.":"Il mio progetto è un lavoro originale, non un clone leggermente modificato di un progetto esistente.","My project brings something interesting or fun to others, it's not just a test.":"Il mio progetto offre qualcosa di interessante o divertente agli altri, non è solo un test.","I have created a nice icon for it (the default project icon is not accepted, please create yours!).":"Ho creato una bella icona per il progetto (l'icona di default non è accettabile, per favore crea la tua!).","I made the assets in my project myself (sprites, sounds, music), or I made sure that I am allowed to use and publish the assets I imported into it.":"Ho fatto io stesso gli asset del progetto (sprites, suoni, musica), o mi sono assicurato di avere il permesso di usare e pubblicare gli asset che ho importato.","If I am using an asset pack, I made sure to add the required credits and generally comply with the license of the asset packs.":"Se sto usando un pacchetto di assets, mi sono assicurato di inserire i riferimenti richiesti e in generale di rispettare la licenza dei pacchetti di assets.","Level %NUM%":"Livello %NUM%","Level":"Livello","XP":"XP","Public Projects":"Progetti pubblici","Characters Typed":"Caratteri digitati","Lines of Code":"Linee di codice","minutes":"minuti","Coding Time":"Tempo scrittura codice","New achievement unlocked!":"Nuovo risultato sbloccato!","Level %LEVEL% unlocked!":"Livello %LEVEL% sbloccato!","hours":"ore","Map Editor Time":"Tempo editor mappe","Map Cells Painted":"Celle nella mappa disegnate","Pixels Drawn":"Pixel disegnati","Editing post":"Editando messaggio","Stats & Achievements":"Statistiche & Risultati","Your Progress":"Il tuo progresso","Statistics":"Statistiche","Achievements":"Risultati","Drawing Time":"Tempo di disegno","Unwatch":"Disattiva","Unlock palette":"Sblocca palette","You will receive e-mail notifications when new replies to this post are published.":"Riceverai notifiche via e-mail quando verranno pubblicate nuove risposte a questo post.","Download":"Scarica","%NUM% weeks ago":"%NUM% settimane fa","Really quit this project?":"Veramente abbandonare questo progetto?","Pencil":"Matita","Eraser":"Gomma","Fill":"Riempi","Enhance":"Migliora","Select":"Seleziona","Copy Color":"Copia colore","Bytes":"Bytes","Delete Frame":"Cancella Fotogramma","Do you want to clone this project?":"Vuoi clonare questo progetto?","copy":"copia","Project cloned! Here is your copy.":"Progetto clonato! Ecco la tua copia.","basic graphics API":"API di base","micro 2D - Experimental - Built on Pixi.js":"micro 2D - Sperimentale - Basata su Pixi.js","micro 3D - Experimental - Built on Babylon.js":"micro 3D - Sperimentale - Basata su Babylon.js","Pixi.js - Experimental":"Pixi.js - Sperimentale ","Babylon.js - Experimental":"Babylon.js - Sperimentale ","Additional tools and libraries":"Strumenti aggiuntivi e librerie","matter.js - 2D physics engine":"matter.js - motore fisico 2D ","Note: this integration is experimental":"Nota: questa integrazione è sperimentale","cannon.js - 3D physics engine":"cannon.js -  motore fisico 3D","Unlisted":"Non elencato","If you mark your public project Unlisted, it will not show up in the main Explore section":"Se contrassegni il tuo progetto pubblico come non elencato, non apparirà nella sezione principale di Esplora.","Public link":"Link pubblico","Game Jam Contender":"Concorrente a Game  Jam","You made a submission to a microStudio Game Jam":"Hai creato un progetto per a una Game Jam microStudio ","Impressionism":"Impressionismo","You spent 1 hour drawing, amazing!":"Hai trascorso 1 ora a disegnare, incredibile!","Joseph Jacquard":"Joseph Jacquard","You spent 2 hours coding, starts looking like an addiction!":"Hai trascorso 2 ore a codificare, inizia a sembrare una dipendenza!","Joseph Jacquard was a French weaver and merchant. He built and demonstrated the Jacquard loom, a programmable mechanized loom controlled by a tape constructed from punched cards.":"Joseph Jacquard era un tessitore e mercante francese. Costruì e presentò il telaio Jacquard, un telaio meccanizzato programmabile controllato da un nastro costruito con schede perforate.","Active Community Member":"Membro attivo della comunità","You made a public post in the community forum!":"Hai fatto un post pubblico nel forum della comunità!","Game Programmer":"Programmatore di giochi","You completed the microStudio tutorial series on creating a simple game!":"Hai completato la serie di tutorial di microStudio sulla creazione di un semplice gioco!","Digital Art Coder":"Programmatore di arte digitale","You completed the microStudio tutorials about drawing with code!":"Hai completato i tutorial di microStudio sul disegno con il codice!","Trained Programmer":"Programmatore formato","You completed the microStudio programming tutorial series!":"Hai completato la serie di tutorial sulla programmazione di microStudio!","Renaissance":"Rinascimento","You spent 30 minutes drawing, well done!":"Hai trascorso 30 minuti a disegnare, ben fatto!","Gottfried Leibniz":"Gottfried Leibniz","You spent 1 hour coding, amazing!":"Hai trascorso 1 ora a codificare, incredibile!","Gottfried Leibniz was a German mathematician, philosopher, scientist and diplomat. He made advances in symbolic logic and his work was crucial for the theoretical foundations of computer science.":"Gottfried Leibniz era un matematico, filosofo, scienziato e diplomatico tedesco. Ha fatto progressi nella logica simbolica e il suo lavoro è stato cruciale per le basi teoriche dell'informatica.","Greek Art":"Arte greca","You spent 10 minutes drawing, keep it up!":"Hai trascorso 10 minuti a disegnare, continua così!","Blaise Pascal":"Blaise Pascal","You spent 30 minutes coding, well done!":"Hai trascorso 30 minuti a codificare, ben fatto!","Blaise Pascal was a French mathematician, physicist, inventor, philosopher. He invented the mechanical calculator.":"Blaise Pascal era un matematico, fisico, inventore e filosofo francese. Ha inventato la calcolatrice meccanica.","Cave Art":"Arte delle caverne","You started drawing!":"Hai iniziato a disegnare!","Al Jazari":"Al Jazari","You spent 10 minutes coding, keep it up!":"Hai trascorso 10 minuti a codificare, continua così!","Al Jazari was a Muslim scientist, artist, mathematician living in Mesopotamia. He invented an astronomical clock considered the first programmable analog computer.":" Al Jazari era uno scienziato, artista e matematico musulmano che viveva in Mesopotamia. Ha inventato un orologio astronomico considerato il primo computer analogico programmabile. Hai trascorso 10 minuti a codificare, continua così!","Recognition":"Riconoscimento","Your public project received 5 likes!":"Il tuo progetto pubblico ha ricevuto 5 like!","microStudio Tourist":"Turista microStudio ","You completed the microStudio tour tutorial series!":"Hai completato la serie di tutorial del tour di microStudio!","Al Khwarizmi":"Al Khwarizmi","You actually started coding!":"Hai iniziato a programmare!","Al Khwarizmi was a Persian polymath who produced vastly influential works in mathematics, astronomy, and geography. His name gave rise to the term 'algorithm'.":"Al Khwarizmi era un polimata persiano che produsse opere molto influenti in matematica, astronomia e geografia. Il suo nome ha dato origine al termine 'algoritmo'.","Game Jam Silver":"Game Jam Silver","You won the second prize in a microStudio Game Jam!":"Hai vinto il secondo premio in una microStudio Game Jam!","This project uses an experimental integration of graphics API:":"Questo progetto utilizza un'integrazione sperimentale delle API grafiche:","This project uses an experimental integration of this library:":"Questo progetto usa un'integrazione sperimentale di questa libreria:","Surrealism":"Surrealismo","You spent 10 hours drawing, isn't that crazy?":"Hai trascorso 10 ore a disegnare, non è pazzesco?","Level Design Expert":"Esperto di progettazione di livelli","You spent 2 hours working on maps, O.M.G!":"Hai trascorso 2 ore a lavorare sulle mappe, O.M.D!","Senior Level Designer":"Progettista di livello senior","You spent 1 hour working on maps, starts looking like an addiction!":"Hai trascorso 1 ora a lavorare sulle mappe, inizia a sembrare una dipendenza!","Regular Level Designer":"Designer di livello abituale","You spent 30 minutes working on maps, amazing!":"Hai trascorso 30 minuti a lavorare sulle mappe, incredibile!","Junior Level Designer":"Progettista di livello junior","You spent 10 minutes working on maps, well done!":"Hai trascorso 10 minuti a lavorare sulle mappe, ben fatto!","Level Design Rookie":"Principiante del design di livello","You started creating a map, keep it up!":"Hai iniziato a creare una mappa, continua così!","Expressionism":"Espressionismo","You spent 5 hours drawing sprites, O.M.G!":"Hai trascorso 5 ore a disegnare sprites, O.M.D!","Ada Lovelace":"Ada Lovelace","You spent 20 hours coding, seems more than just a hobby!":"Hai trascorso 20 ore a programmare, sembra più di un semplice hobby!","Ada Lovelace was an English mathematician and writer. She anticipated applications beyond pure calculation to Babbage's Analytical Engine, and created the first algorithms for such a machine.":"Ada Lovelace era una matematica e scrittrice inglese. Ha anticipato le applicazioni al di là del puro calcolo al motore analitico di Babbage, e ha creato i primi algoritmi per una tale macchina.","George Boole":"George Boole","You spent 10 hours coding, isn't that crazy?":"Hai trascorso 10 ore a codificare, non è pazzesco?","George Boole was an English mathematician, philosopher and logician. He formalized Boolean algebra, the basis for digital logic and computer science.":"George Boole era un matematico, filosofo e logico inglese. Ha formalizzato l'algebra booleana, la base della logica digitale e dell'informatica.","Post Impressionism":"Post Impressionismo","You spent 2 hours drawing sprites, starts looking like an addiction!":"Hai trascorso 2 ore a disegnare sprites, inizia a sembrare una dipendenza!","Charles Babbage":"Charles Babbage","You spent 5 hours coding, O.M.G!":"Hai passato 5 ore a scrivere codice, O.M.D.!","Charles Babbage was an English mathematician, philosopher, engineer and inventor. He originated the concept of a programmable general-purpose computer and designed the Analytical Engine.":"Charles Babbage era un matematico, filosofo, ingegnere e inventore inglese. Ha dato origine al concetto di un computer programmabile di uso generale e ha progettato il motore analitico.","Experimental features":"Caratteristiche sperimentali","Enable experimental features":"Attiva le funzioni sperimentali","Experimental features can change, break or be removed anytime. You are warned!":"Le caratteristiche sperimentali possono cambiare, fallire o essere rimosse in qualsiasi momento. Siete avvisati!","Newsletter":"Newsletter","Game Jam Winner":"Vincitore di una Game Jam","You won the first prize in a microStudio Game Jam!":"Hai vinto il primo premio in una microStudio Game Jam!","Game Jam Bronze":"Bronzo in una Game Jam","You won the third prize in a microStudio Game Jam!":"Hai vinto il terzo premio in una microStudio Game Jam!","Emile Baudot":"Emile Baudot","You spent 50 hours coding, keep it up!":"Hai passato 50 ore a scrivere codice, continua così!","Emile Baudot was a French telegraph engineer and inventor. He created the first binary encoding system for communications, and today's modem speed unit baud is named after him.":"Emile Baudot era un ingegnere telegrafico e inventore francese. Ha creato il primo sistema di codifica binaria per le comunicazioni, e l'unità di velocità del modem di oggi prende il nome da lui.","Abstract Art":"Arte astratta","You spent 50 hours drawing, keep it up!":"Hai passato 50 ore a disegnare, continua così!","Level Design Master":"Maestro del design dei livelli","You spent 10 hours working on maps, seems more than just a hobby!":"Hai passato 10 ore a lavorare sulle mappe, sembra più di un semplice hobby!","Level Design Mentor":"Mentore del design di livello","You spent 5 hours working on maps, isn't that crazy?":"Hai passato 5 ore a lavorare sulle mappe, non è pazzesco?","Cubism":"Cubismo","You spent 20 hours drawing, seems more than just a hobby!":"Hai passato 20 ore a disegnare, sembra più di un semplice hobby!","microScript v1 - interpreted":"microScript v1 - interpreted","microScript v1 - transpiled":"microScript v1 - transpiled","Language support":"Linguaggio supportato","Standalone, offline application":"Applicazione standalone e offline","Would you like to work completely offline? Download the microStudio standalone app for Windows, Mac, Linux and Raspberry Pi:":"Vuoi lavorare completamente offline? Scarica l'applicazione standalone microStudio per Windows, Mac, Linux e Raspberry Pi:","Fundamentals":"Fondamentali","Quick Start":"Avvio rapido","microScript programming":"Programmazione microScript","API reference":"Riferimento alle API","Advanced graphics":"Grafica avanzata","Optional libs":"Librerie opzionali","More programming languages":"Altri linguaggi di programmazione","(Transpiler activation was moved to project settings)":"(L'attivazione del transpiler è stata spostata nelle impostazioni del progetto)","Show advanced options":"Mostra opzioni avanzate","Python":"Python","Lua":"Lua","JavaScript":"JavaScript","Hide advanced options":"Nascondi opzioni avanzate","Translator":"Traduttore","You made microStudio more accessible by translating it to your language.":"Hai reso microStudio più accessibile traducendolo nella tua lingua.","New":"Novità","Top":"Migliore","Github contributor":"Collaboratore Github","You made microStudio better by contributing code to the project on Github!":"Hai reso microStudio migliore contribuendo al codice del progetto su Github!","%ERROR%, in file \"%FILE%\" at line %LINE%":"%ERROR%, nel file \"%FILE%\" alla riga %LINE%","Relevance":"Pertinenza","microScript shines by its simplicity and interactivity. But you can also code in JavaScript, Python or Lua if you prefer.":"microScript brilla per la sua semplicità e interattività. Ma potete anche scrivere codice in JavaScript, Python o Lua se preferite.","microStudio is open source":"microStudio è open source","microStudio is open source software, released under the MIT License:":"microStudio è un software open source, rilasciato sotto la MIT License:","Support me on Patreon":"Sostienimi su Patreon","You like microStudio and would like to support me? Check my Patreon!":"Ti piace microStudio e vuoi sostenermi? Controlla il mio Patreon!","Run project":"Esegui progetto","Pause execution":"Pausa l'esecuzione","Restart project":"Riavviare il progetto","Detach run window":"Staccare la finestra di esecuzione","Take a picture":"Scatta una foto","Project QR Code":"Codice QR del progetto","Project Type":"Tipo di progetto","App (game, demo...)":"App (game, demo...)","Library":"Libreria","Save":"Salva","Set as project poster image":"Imposta come immagine lcoandina del progetto","Close":"Chiudi","Bertrand Russell":"Bertrand Russell","You spent 100 hours coding, keep it up!":"Hai trascorso 100 ore a scrivere codice, continua così!","Bertrand Russell was a British mathematician, philosopher and logician. His work had a considerable influence on computer science.":"Bertrand Russell era un matematico, filosofo e logico britannico. Il suo lavoro ha avuto una notevole influenza sull'informatica.","Really delete %ITEM%?":"Cancellare veramente %ITEM%?","Advanced":"Avanzate","microStudio is a free game engine online. Learn, create and share with the community. Use the built-in sprite editor, map editor and code editor to create anything.":"microStudio è un motore di gioco gratuito online. Impara, crea e condividi con la comunità. Usa l'editor degli sprite integrato, l'editor delle mappe e l'editor di codice per creare qualsiasi cosa.","OK":"OK","%PROJECT% - by %USER%":"%PROJECT% - di %USER%","More Tutorials":"Altri Tutorials","Check this great series of microStudio tutorials by mrLman:":"Prova questa ottima serie di tutorial su microStudio da mrLman:","Level Design Champion":"Campione di design di livelli","You spent 20 hours working on maps, keep it up!":"Hai trascorso 20 ore lavorando sulle mappe, continua così!","Do you really want to delete this folder and all its contents?":"Vuoi cancellare veramente questa cartella e il suo contenuto?","New Folder":"Nuova Cartella","Sound":"Suono","Horizontal Flip":"Capovolgi orizzontalmente","Vertical Flip":"Capovolgi verticalmente","Rotate Left":"Ruota a sinistra","Rotate Right":"Ruota a destra","Contemporary":"Contemporaneo","You spent 100 hours drawing, keep it up!":"Ha trascorso 100 ore a disegnare, continua così!","Kurt Gödel":"Kurt Gödel","You spent 200 hours coding, keep it up!":"Ha trascorso 200 ore a disegnare, continua così!","Kurt Gödel was a logician, mathematician and philosopher. His work on the logical consistency of mathematical systems lies at the foundation of modern computer science.":"Kurt Gödel era un logico, matematico e filosofo. Il suo lavoro sulla consistenza logica dei sistemi matematici è alla base dell'informatica moderna.","Your current code will be overwritten. Do you wish to proceed?":"Il tuo attuale codice verrà sovrascritto. Desideri procedere?","%YEARS%y":"%ANNI%y","Really delete this project?":"Cancellare veramente questo progetto?","Active Tabs":"Schede attive","microScript v2 - alpha":"microScript v2 - alpha","Copy Code":"Copia Codice","Capture icon":"Acquisisci l'icona","You can drop assets here":"Puoi rilasciare le risorse qui","Show Functions":"Mostra Funzioni","Show Objects":"Mostra Oggetti","Show Lists":"Mostra Liste","Show Strings":"Mostra Stringhe","Show Numbers":"Mostra Numeri","Debug Tools":"Strumenti di Debug","Forward":"Avanti","Step Forward":"Passo Avanti","Loop":"Ciclo continuo","Step Backward":"Passo Indietro","Backward":"Indietro","Record":"Registra","Time Machine":"Macchina Temporale","One Step Forward":"Un passo Avanti","microScript 1.0 - interpreted":"microScript 1.0 - interpreted","microScript 1.0 - transpiled":"microScript 1.0 - transpiled"}
