{"Quit":"Wyjdź","Learn programming, create video games - microStudio is a free game engine online.":"Ucz się programować, twórz gry wideo - microStudio jest darmowym silnikiem do tworzenia gier online.","Learn programming, create games":"Ucz się programować, twórz gry wideo","Create My Account":"Stwórz konto","Login":"Zaloguj","Explore":"Przeglądaj","Create":"Twórz","Tutorials":"Tutoriale","Documentation":"Dokumentacja","About":"O microStudio","Settings":"Ustawienia","Logout":"Wyloguj","Create Account":"Stwórz konto","Quit and Delete":"Wyjdź i usuń","microStudio is a free game engine online.":"microStudio jest darmowym silnikiem do tworzenia gier online.","Create games, learn programming, play, share, prototype and jam!":"Twórz gry, ucz się programować, graj, dziel się, prototypuj i jamuj!","Online and integrated":"Online i zintegrowany","microStudio includes all you need to write code, create sprites and maps for your 2D game.":"microStudio posiada wszystko, czego potrzebujesz, by pisać kod, tworzyć sprite'y i mapy do swoich gier 2D","All from your web browser. Your project is stored in the cloud, accessible from anywhere.":"To wszystko z Twojej przeglądarki. Twój projekt przechowywany jest w chmurze, dostępny dla każdego","Get into programming":"Wejdź w programowanie","Write your game code in microScript, a simple language inspired by Lua.":"Pisz kod do swojej gry w microScript, prostym jęzuku inspirowanym Lua.","The documentation is always there to help. Create cool demos in just a few lines of code.":"Dokumentacja jest zawsze dostępna, by Ci pomóc. Twórz super dema pisząc raptem kilka linii kodu.","Design":"Projektuj","Create pixel art sprites and maps with the included editors.":"Twórz pixel-artowe sprite'y i mapy korzystająć z wbudowanych edytorów.","Using your sprites and maps from code is as easy as 1-2-3.":"Używanie Twoich sprite'ów i map z kodu jest proste jak 1-2-3.","Adjusting is a breeze":"Poprawianie to pestka","Change anything from your PC while testing your game on your mobile.":"Zmieniaj cokolwiek chcesz na swoim komputerze podczas testowania gry na telefonie.","Your changes are immediately reflected in your ongoing playing session.":"Twoje zmiany są natychmiast widoczne w trakcie trwającej rozgrywki.","Bring your friends":"Sprowadź przyjaciół","You can invite others to your project and work in teams.":"Możesz zaprosić innych do swoich projektów i pracować w zespołach.","microStudio automagically synchronizes all your project files in real time.":"microStudio automagicznie synchronizuje wszystkie pliki projektu w czasie rzeczywistym.","Get your gear ready":"Przygotuj swój sprzęt","Control your game using the gamepad, touchscreen, keyboard or mouse inputs.":"Kontroluj swoją grę używając padów, ekranu dotykowego, klawiatury i myszki.","Export your project in a single click to HTML5, Windows, Linux, macOS. More export options are coming!":"Eksportuj swój projekt jednym kliknięciem do gry HTML5, na Windowsa, Linuxa, czy macOS. Więcej opcji eksportu już wkrótce!","Join the community":"Dołącz do społeczności","Browse public games, demos, resources. Pick up what you need for your own project.":"Przeglądaj publiczne gry, dema, zasoby. Wybierz to, czego potrzebujesz do swojego własnego projektu.","Contribute your best creations and help others.":"Podziel się swoimi tworami i pomóż innym.","So what now?":"Więc co teraz?","Explore public projects":"Przeglądaj publiczne projekty","Start creating!":"Zacznij tworzyć!","Created in Strasbourg, France. See 'About' for more information":"Stworzone w Strasburgu we Francji. Sprawdź 'O microStudio', by uzyskać więcej informacji","You are not tracked here.":"Nikt Cię tutaj nie śledzi.","microStudio doesn't use any third-party tracking script.":"microStudio nie używa żadnych skryptów śledzących firm trzecich.","Back":"Wróć","Hot":"Gorące","Run":"Uruchom","Clone":"Sklonuj","Comments":"Komentarze","Post":"Wyślij","Log in to post comments":"Zaloguj się, by pisać komentarze","Validate your email to post comments":"Zweryfikuj swój adres email, by pisać komentarze","Code":"Kod","Sprites":"Sprite'y","Doc":"Dok.","Export all in a ZIP file":"Eksportuj wszystko w archiwum ZIP","Changelog":"Spis zmian","Terms of use":"Warunki użytkowania","Privacy":"Prywatność","Learn the basics of programming and how to create games with microStudio:":"Ucz się podstaw programowania i tworzenia gier w microStudio:","User Settings":"Ustawienia użytkownika","Nickname":"Pseudonim","Change nickname":"Zmień pseudonim","Your nickname will be displayed publicly.":"Twój pseudonim będzie wyświetlany publicznie.","Public page":"Strona publiczna","Your public page displays a list of your public projects.":"Twoja strona publiczna wyświetla listę Twoich publicznych projektów","E-mail Address":"Adres e-mail","Change e-mail":"Zmień e-mail","Your e-mail address is not validated yet. Check your e-mails and click on the validation link we sent to you. In case you did not receive the validation e-mail yet, use the button below to resend:":"Twój adres e-mail nie jest jeszcze zweryfikowany. Sprawdź swoją skrzynkę e-mail i kliknij w link weryfikacyjny","Resend validation e-mail":"Wyślij ponownie e-mail weryfikacyjny","We have just resent a validation e-mail.":"Wysłaliśmy właśnie ponownie e-mail weryfikacyjny","Receive newsletter":"Otrzymuj newsletter","We will send you an information email no more than once a month.":"Będziemy Ci wysyłać wiadomość e-mail z informacjami nie częściej, niż raz w miesiącu.","Account Type":"Typ konta","Storage":"Pamięć","Open translation tool":"Otwórz narzędzie do tłumaczeń","Create New Project":"Stwórz nowy projekt","My Projects":"Moje projekty","Back to Projects":"Wroć do projektów","Maps":"Mapy","Assets":"Assety","Sounds":"Dźwięki","Music":"Muzyka","Publish":"Opublikuj","Files":"Pliki","Add File":"Dodaj plik","Add Sprite":"Dodaj sprite","Apply":"Zatwierdź","Undo":"Cofnij","Redo":"Powtórz","Copy":"Kopiuj","Cut":"Wytnij","Paste":"Wklej","Delete Sprite":"Usuń sprite","Hold down space bar to move view":"Przytrzymaj Spację, by przesunąć widok","Zoom in":"Przybliż","Zoom out":"Oddal","Animation":"Animacja","Add new Frame":"Dodaj klatkę","Eyedropper tool":"Pobierz kolor","Lock palette":"Zablokuj paletę","Move":"Przesuń","Strip to animation":"Potnij do animacji","Add Map":"Dodaj mapę","Add Asset":"Dodaj asset","Delete Asset":"Usuń asset","Add Sound":"Dodaj dźwięk","Delete Sound":"Usuń dźwięk","Synthesizer":"Syntezator","Add Music":"Dodaj muzykę","Project Title":"Tytuł projektu","Project Slug":"Slug projektu","Project Secret Code":"Sekretny kod projektu","Secret URL for testing your project when not set to public":"Sekretny adres do testowania projektu, kiedy nie jest on publiczny","Orientation":"Orientacja","Any":"Jakakolwiek","Portrait":"Pionowa","Landscape":"Pozioma","Aspect ratio":"Współczynnik wymiarów","Free":"Dowolny","Force 2:1":"Wymuś 2:1","Force 16:9":"Wymuś 16:9","Force 4:3":"Wymuś 4:3","Force 1:1 (square)":"Wymuś 1:1 (kwardrat)","2:1 or above":"2:1 lub wyższy","16:9 or above":"16:9 lub wyższy","4:3 or above":"4:3 lub wyższy","1:1 or above":"1:1 lub wyższy","Graphics library":"Biblioteka graficzna","Storage used":"Wykorzystana pamięć","Users":"Użytkownicy","Here is where your grant other users access to edit your project. Users added here are granted full control on your project, except for adding or deleting other users.":"Tutaj możesz nadać innym użytkownikom dostęp do edytowania Twojego projektu. Użytkownicy dodani tutaj mają pełną kontrolę nad Twoim projektem poza dodawaniem i usuwaniem innych użytkowników.","nickname":"pseudonim","Add User":"Dodaj użytkownika","Make public":"Upublicznij","You must validate your e-mail address before you can make your project public.":"Musisz zweryfikować swój adres e-mail zanim upublicznisz swój projekt.","This project is currently private.":"Ten projekt jest aktualnie prywatny.","Make private again":"Ustaw ponownie jako prywatny","This project is currently public.":"Ten projekt jest aktualnie publiczny.","Make public on microStudio":"Upublicznij na microStudio","Making your project public will allow it to be listed in the Explore section of the site. Public projects can be run and used by anyone. Making a project public allows anyone to view and possibly reuse the source code.":"Upublicznienie Twojego projektu sprawi, że będzie on wyświetlony w sekcji Przeglądaj na stornie. Projekty publiczne mogą być uruchamiane i używane przez każdego. Ustawienie projektu jako publiczny pozwala innym na wyświetlanie oraz wykorzystywanie Twojego kodu.","Description":"Opis","Tags":"Tagi","Add":"Dodaj","Export to HTML5":"Eksportuj do HTML5","Exporting to HTML5 allows you to distribute your game as a web app or a standalone HTML app. Unzip contents, double-click index.html to start the game, or upload the contents to a subfolder of your existing web site.":"Wyeksportowanie do HTML5 pozwala Ci rozpowszechniać Twoją grę jako aplikację internetową lub samodzielną aplikację HTML. Rozpakuj zawartość archiwum i kliknij dwukrotnie w plik index.html lub umieść zawartość archiwum w podfolderze na Twojej istniejąćej stronie internetowej.","You can also easily publish your HTML5 game on a number of platforms supporting HTML5 games. We have listed a few popular ones below, which you can check out:":"Możesz łatwo opublikować swoją grę HTML5 na wielu platformach obsługujących gry HTML5. Wymieniliśmy kilka popularnych serwisów, które możesz sprawdzić:","Build for Android":"Zbuduj na Androida","Registered User":"Zarejestrowany użytkownik","Log in to your existing account.":"Zaloguj się do istniejącego konta","Create my account":"Stwórz konto","Start using microStudio without creating an account.":"Zacznij używać microStudio bez tworzenia konta.","Save your projects, work in teams, publish, vote, comment...":"Zapisuj swoje projekty, pracuj w zespołach, publikuj, głosuj, komentuj...","Nickname or e-mail":"Pseudonim lub e-mail","Password":"Hasło","Forgot password?":"Nie pamiętasz hasła?","Log in":"Zaloguj","Don't have an account yet?":"Nie masz jeszcze konta?","Password Recovery":"Odzyskiwanie hasła","E-mail":"E-mail","Send password recovery e-mail":"Wyślij wiadomość do odzyskiwania hasła","Back to login":"Wróć do logowania","New User":"Nowy użytkownik","E-mail address":"Adres e-mail","Accept the":"Zaakceptuj","Terms of Use":"Warunki użytkowania","Receive news (maximum once per month)":"Otrzymuj informacje (maksymalnie raz w miesiącu)","Already registered?":"Masz już konto?","Log in to existing account":"Zaloguj się do istniejącego konta","Title":"Tytuł","Create Project":"Stwórz projekt","Tutorial":"Tutorial","[STORAGE] used of [MAX_STORAGE] ([PERCENT] %)":"[STORAGE] wykorzystane z [MAX_STORAGE] ([PERCENT] %)","Kb":"Kb","Gb":"Gb","Delete":"Usuń","This will build an APK file of your game. An APK file is what you need to publish your game on the Google Play Store, for Android devices.":"Ta opcja zbuduje APK twojej gry. APK to plik, któego potrzebujesz, by opublikować swoją grę w Google Play Store dla użądzeń z systemem Android.","Build for Windows":"Zbuduj na Windowsa","This will build your game as an executable for Windows (.EXE).":"Ta opcja zbuduje twoją grę jako plik wykonywalny dla Windowsa (.EXE).","Build for macOS":"Zbuduj na macOS","This will build your game as an executable for macOS.":"Ta opcja zbuduje twoją grę jako plik wykonywalny dla macOS.","Build for Linux":"Zbuduj na Linuxa","This will build your game as an executable for Linux (Ubuntu, x86).":"Ta opcja zbuduje twoją grę jako plik wykonywalny dla Linuxa (Ubuntu, x86).","Build for Raspberry Pi":"Zbuduj na Raspberry Pi","This will build your game as an executable for Raspberry Pi (Raspbian).":"Ta opcja zbuduje twoją grę jako plik wykonywalny dla Raspberry Pi (Raspbian).","Start creating":"Zacznij tworzyć","Create as a guest":"Twórz jako gość","%NUM% hours ago":"%NUM% godzin temu","Reset your microStudio password":"Zresetuj hasło do konta microStudio","Click on the link below to choose a new microStudio password:":"Kliknij w link poniżej, by stworzyć nowe hasło do konta microStudio:","Incorrect e-mail address":"Niepoprawny adres e-mail","email already exists":"ten e-mail już istnieje","Build":"Zbuduj","Duplicate Frame":"Duplikuj klatkę","Move Left":"Przesuń w lewo","Move Right":"Przesuń w prawo","Delete file":"Usuń plik","New":"Nowe","Account created successfully!":"Konto utworzone!","Microstudio e-mail validation":"Weryfikacja adresu e-mail microStudio","Thank you for using Microstudio!":"Dziękujemy za korzystanie z microStudio!","Click on the link below to validate your e-mail address:":"Kliknij w link poniżej, by zweryfikować swój adres e-mail:","Your e-mail address is now validated":"Twój adres e-mail jest już zweryfikowany","View doc":"Wyświetl dokumentację","Incorrect nickname. Use 5 characters minimum, only letters, numbers or _":"Niepoprawny pseudonim. Podaj przynajmniej 5 znaków, możesz używać tylko liter, cyfr i _","Password too weak":"Hasło jest zbyt słabe","Top":"Najwyżej oceniane","nickname already exists":"konto z tym pseudonimem już istnieje","Delete Frame":"Usuń klatkę","Warning: %EXP% is not defined, defaulting to zero":"Ostrzeżenie: %EXP% nie jest zdefiniowane, wstawiona zostanie domyślna wartość 0","%ERROR%, in file %FILE% at line %LINE%, column %COLUMN%":"%ERROR% - w pliku %FILE% w linii %LINE%, kolumnie %COLUMN%","Mb":"Mb","Welcome back!":"Witaj z powrotem!","%NUM% weeks ago":"%NUM% tygodni temu","Your password was successfully changed":"Twoje hasło zostało zmienione","Warning: %EXP% is not a function":"Ostrzeżenie: %EXP% nie jest funkcją","Warning: %EXP% is not defined, will be initialized to an empty object":"Ostrzeżenie: %EXP% nie jest zdefiniowany, zostanie zainicjowany pustym obiektem","%NUM% days ago":"%NUM% dni temu","now":"teraz","Server will be rebooted for maintenance immediately":"Serwer zostanie natychmiastowo zrestartowany w celu konserwacji","Drop your music files on the left. A sleek music creation app will land here in the future!":"Upuść swoje pliki muzyczne po lewej. Elegancka aplikacja do tworzenia muzyki wyląduje tutaj w przyszłości!","You can drop MP3 files here":"Możesz tutaj upuścić swoje pliki MP3","Drop your sounds on the left. A sleek sound creation app will land here in the future!":"Upuść swoje pliki dźwiękowe po lewej. Elegancka aplikacja do tworzenia dźwięków wyląduje tutaj w przyszłości!","You can drop WAV files here":"Możesz tutaj upuścić swoje pliki WAV","You can drop PNG or JPEG files here":"Możesz tutaj upuścić pliki PNG lub JPEG","Display warning when setting property on an undefined variable":"Wyświetlaj ostrzeżenie przy zmianie wartości właściwości na niezdefiniowanej zmiennej","Display warning when calling something that isn't a function":"Wyświetlaj ostrzeżenie przy próbie wywołania czegoś, co nie jest funkcją","Display warning when using an undefined variable":"Wyświetlaj ostrzeżenie przy używaniu niezdefiniowanej zmiennej","Community":"Społeczność","Profile":"Profil","Your Profile":"Twój profil","User Description":"Opis użytkownika","Tell us more about yourself (only if you wish to). This text will be displayed on your public page.":"Powiedz nam coś o sobie (tylko, jeśli chcesz). Ten tekst będzie wyświetlany na stronie Twojego publicznego profilu.","Profile Image":"Zdjęcie profilowe","Remove Profile Image":"Usuń zdjęcie profilowe","Drop your image here. This image will be displayed publicly, along with your nickname.":"Upuść swoje zdjęcie tutaj. Ten obrazek będzie wyświetlany publicznie razem z Twoim pseudonimem","Check your public page":"Sprawdź swoją publiczną stronę","Your public page displays your nickname, description, profile image and a list of your public projects.":"Twoja publiczna strona wyświetla Twój pseudonim, opis, zdjęcie profilowe i listę Twoich publicznych projektów. ","Use transpiler [Caution: alpha version, may not work]":"Użyj transpilera [Uwaga: wersja alfa, może nie działać]","Background":"Tło","Start Tutorial":"Rozpocznij tutorial","View tutorial source code":"Pokaż kod źrółowy tutoriala","All":"Wszystkie","Welcome!":"Witaj!","LIGHT THEME":"JASNY STYL","New Post":"Nowy post","Choose category...":"Wybierz kategorię...","Title of your post":"Tytuł Twojego posta","Write your text here ; you can use markdown":"Napisz tutaj swój tekst; możesz używać markdown","Preview":"Podgląd","Cancel":"Anuluj","Validate your e-mail address to participate in the community":"Potwierdź swój adres e-mail, by dołączyć do społeczności","Last activity:":"Ostatnia aktywność:","%HOURS%h":"%HOURS% godz.","%DAYS%d":"%DAYS% d","Views:":"Wyświetleń:","Replies:":"Odpowiedzi:","DARK THEME":"CIEMNY STYL","Post a reply":"Wyślij odpowiedź","Progress":"Postęp","Status":"Status","For anything else there is an Off Topic category.":"Na wszysgko inne jest kategoria Off Topic","In this space you can ask for help, share your best tips, read articles, submit bugs or feature requests, follow the roadmap and progress of microStudio.":"Możesz tutaj prosić o pomoc, dzielić się poradami, czytać artykuły, zgłaszać  błędy lub prośby o nowe funkcjonalności, śledzić roadmapę i rozwój microStudio.","You can discuss programming, game development, art, sound, music, useful tools and resources, microStudio and other game engines.":"Możesz rozmawiać na temat programowania, tworzenia gier, grafiki, dźwięków, muzyki, przydatnych narzędzi i zasobów, microStudio i innych silników.","Activity":"Aktywność","Export":"Eksportuj","Import Project":"Zaimportuj projekt","Project imported successfully":"Projekt zaimportowany poprawnie","Edit":"Edytuj","Watch":"Śledź","%USER% posted a reply":"%USER% napisał odpowiedź","microStudio Community":"Społeczność mictoStudio","%USER% posted a reply to %POST%:":"%USER% napisał odpowiedź na %POST%:","%MINUTES%m":"%MINUTES%m"}
