{"Explore":"Explorar","Create":"Criar","Tutorials":"Tutoriais","Documentation":"Documentação","Community":"Comunidade","About":"Sobre","Settings":"Configurar","Profile":"Perfil","Stats & Achievements":"Estatísticas e Conquistas","Create My Account":"Criar Minha Conta","Learn programming, create games":"Aprenda a programar, crie jogos","Learn programming, create video games - microStudio is a free game engine online.":"Aprenda a programar, crie videogames - microStudio é um engine gratuito e online para criação de jogos.","Changelog":"Registro de alterações","Terms of use":"Termos de uso","Privacy":"Privacidade","Statistics":"Estatísticas","Achievements":"Conquistas","My Projects":"Meus Projetos","Create New Project":"Criar Novo Projeto","Import Project":"Importar Projeto","Level %NUM%":"Nível %NUM%","Create Account":"Criar Conta","Quit and Delete":"Sair e Deletar","microStudio is a free game engine online.":"microStudio é um engine gratuito e online para criação de jogos.","Create games, learn programming, play, share, prototype and jam!":"Crie jogos, aprenda a programar, jogue, compartilhe, crie protótipos e participe de jams!","Online and integrated":"Online e integrado","microStudio includes all you need to write code, create sprites and maps for your 2D game.":"microStudio inclui tudo que você precisa para escrever código, criar sprites e mapas para o seu jogo 2D.","All from your web browser. Your project is stored in the cloud, accessible from anywhere.":"Tudo a partir do seu navegador. Seu projeto é armazenado na nuvem, acessível em qualquer lugar.","Write your game code in microScript, a simple language inspired by Lua.":"Escreva o código do seu jogo em microScript, uma linguagem simples inspirada em Lua.","Get into programming":"Programe","The documentation is always there to help. Create cool demos in just a few lines of code.":"A documentação está sempre disponível para ajudar. Crie demonstrações bacanas em apenas algumas linhas de código. ","Design":"Desenhe","Create pixel art sprites and maps with the included editors.":"Crie sprites e mapas em pixel art com os editores inclusos.","Using your sprites and maps from code is as easy as 1-2-3.":"Usar  seus prites e mapas no código é tão fácil como 1-2-3.","Adjusting is a breeze":"Ajustar é muito fácil","Change anything from your PC while testing your game on your mobile.":"Mude qualquer coisa em seu PC enquanto testa em seu celular.","Your changes are immediately reflected in your ongoing playing session.":"Suas mudanças são imediatamente refletidas na sessão de jogo em andamento.","Bring your friends":"Traga seus amigos","You can invite others to your project and work in teams.":"Você pode convidar outras pessoas para o seu projeto e trabalhar em equipes.","microStudio automagically synchronizes all your project files in real time.":"O microStudio sincroniza automaticamente todos os seus arquivos de projeto em tempo real.","Control your game using the gamepad, touchscreen, keyboard or mouse inputs.":"Controle o seu jogo usando as entradas do gamepad, touchscreen, teclado ou mouse.","Export your project in a single click to HTML5, Windows, Linux, macOS. More export options are coming!":"Exporte seu projeto em um único clique para HTML5, Windows, Linux, macOS. Mais opções de exportação estão chegando!","Join the community":"Junte-se à comunidade","Get your gear ready":"Prepare o seu equipamento","Browse public games, demos, resources. Pick up what you need for your own project.":"Navegue por jogos, demonstrações e recursos públicos. Pegue o que você precisa para seu próprio projeto.","Contribute your best creations and help others.":"Contribua com suas melhores criações e ajude outras pessoas.","So what now?":"Bem, e agora?","Explore public projects":"Explore projetos públicos","Start creating!":"Comece a criar!","Created in Strasbourg, France. See 'About' for more information":"Criado em Estrasburgo, França. Veja 'Sobre' para mais informações","You are not tracked here.":"Você não é rastreado aqui.","microStudio doesn't use any third-party tracking script.":"microStudio não usa nenhum script de rastreamento de terceiros.","Login":"Entrar","Logout":"Sair","Open translation tool":"Abrir a ferramenta de tradução","Your Profile":"Seu Perfil","User Description":"Descrição do Usuário","Storage":"Armazenamento","Account Type":"Tipo de Conta","Back":"Voltar","Hot":"Quente","Clone":"Clonar","Export":"Exportar","Comments":"Cometários","Post":"Postar","Log in to post comments":"Entre para postar comentários","Validate your email to post comments":"Valide seu email para postar comentários","Code":"Código","Sprites":"Sprites","Sounds":"Sons","Music":"Músicas","Doc":"Doc.","Export all in a ZIP file":"Exportar tudo para um arquivo ZIP","Run":"Executar","Learn the basics of programming and how to create games with microStudio:":"Aprenda o básico sobre programação e como criar jogos com microStudio:","User Settings":"Configurações de Usuário","Nickname":"Apelido","Change nickname":"Mudar Apelido","Your nickname will be displayed publicly.":"Seu apelido será exibido publicamente.","E-mail Address":"Endereço de E-mail","Change e-mail":"Mudar e-mail","Your e-mail address is not validated yet. Check your e-mails and click on the validation link we sent to you. In case you did not receive the validation e-mail yet, use the button below to resend:":"Seu endereço de e-mail ainda não foi validado. Verifique seus e-mails e clique no link de validação que enviamos para você. Caso você ainda não tenha recebido o e-mail de validação, utilize o botão abaixo para reenviar: ","Resend validation e-mail":"Reenviar e-mail de validação ","We have just resent a validation e-mail.":"Acabamos de reenviar um e-mail de validação. ","Receive newsletter":"Receber novidades","We will send you an information email no more than once a month.":"Enviaremos a você um e-mail de informações no máximo uma vez por mês. ","Tell us more about yourself (only if you wish to). This text will be displayed on your public page.":"Conte-nos mais sobre você (apenas se desejar). Este texto será exibido em sua página pública. ","Profile Image":"Imagem de Perfil","Remove Profile Image":"Remover Imagem de Perfil","Drop your image here. This image will be displayed publicly, along with your nickname.":"Solte sua imagem aqui. Esta imagem será exibida publicamente, junto com seu apelido. ","Check your public page":"Verifique sua página pública ","Your public page displays your nickname, description, profile image and a list of your public projects.":"Sua página pública exibe seu apelido, descrição, imagem de perfil e uma lista de seus projetos públicos. ","Your Progress":"Seu Progresso","%USER% posted a reply to %POST%:":"%USER% postou uma resposta ao %POST%:","microStudio Community":"Comunidade microStudio","now":"agora","Back to Projects":"Voltar aos Projetos","Maps":"Mapas","Assets":"Recursos","Publish":"Publicar","Files":"Arquivos","Add File":"Adicionar Arquivo","Display warning when using an undefined variable":"Exibir aviso ao usar uma variável indefinida","Display warning when calling something that isn't a function":"Exibir aviso ao chamar algo que não seja uma função ","Display warning when setting property on an undefined variable":"Exibir aviso ao definir propriedade em uma variável indefinida ","Use transpiler [Caution: alpha version, may not work]":"Use o transpilador [Cuidado: versão alfa, pode não funcionar] ","You can drop PNG or JPEG files here":"Você pode soltar arquivos PNG ou JPEG aqui","Add Sprite":"Adicionar Sprite","Apply":"Aplicar","Undo":"Desfazer","Redo":"Refazer","Copy":"Copiar","Cut":"Cortar","Paste":"Colar","Delete Sprite":"Apagar Sprite","Hold down space bar to move view":"Segure a barra de espaço para mover a view","Zoom in":"Mais zoom","Zoom out":"Menos zoom","Animation":"Animação","Add new Frame":"Adicionar novo quadro","Eyedropper tool":"Ferramenta conta-gotas ","Lock palette":"Bloquear paleta","Move":"Mover","Delete":"Apagar","Mb":"Mb","Gb":"Gb","Quit":"Sair","All":"Todos","Welcome!":"Bem-vindo!","LIGHT THEME":"TEMA CLARO","Activity":"Atividade","New Post":"Nova Postagem","Level":"Nível","minutes":"minutos","Lines of Code":"Linhas de Código","DARK THEME":"TEMA ESCURO","Duplicate Frame":"Duplicar Quadro","Move Left":"Mover para Esquerda","Move Right":"Mover para Direita","Public Projects":"Projetos Públicos","Delete file":"Apagar arquivo","Unlock palette":"Desbloquear paleta","hours":"horas","Account created successfully!":"Conta criada com sucesso!","Thank you for using Microstudio!":"Agrademos por usar o microStudio!","You can drop WAV files here":"Você pode soltar arquivos WAV aqui","Add Sound":"Adicionar Som","Delete Sound":"Apagar Som","Drop your sounds on the left. A sleek sound creation app will land here in the future!":"Solte seus sons à esquerda. Um elegante aplicativo de criação de som estará aqui no futuro! ","Synthesizer":"Sintetizador","You can drop MP3 files here":"Você pode soltar arquivos MP3 aqui ","Add Music":"Adicionar Música","Drop your music files on the left. A sleek music creation app will land here in the future!":"Solte suas músicas à esquerda. Um elegante aplicativo de criação de música estará aqui no futuro! ","Start Tutorial":"Iniciar Tutorial","Project Title":"Título do Projeto","Project Slug":"Slug do Projeto","Project Secret Code":"Código Secreto do Projeto","Secret URL for testing your project when not set to public":"URL secreto para testar seu projeto quando não estiver definido como público ","Orientation":"Orientação","Any":"Qualquer","Portrait":"Retrato","Landscape":"Paisagem","Aspect ratio":"Proporção da tela","Free":"Livre","Force 2:1":"Forçar 2:1","Force 16:9":"Forçar 16:9","Force 4:3":"Forçar 4:3","Force 1:1 (square)":"Forçar 1:1 (quadrado)","2:1 or above":"2:1 ou superior","16:9 or above":"16:9 ou superior","4:3 or above":"4:3 ou superior","1:1 or above":"1:1 ou superior","Graphics library":"Bibliotecas gráficas","Storage used":"Armazenamento utilizado","Users":"Usuários","nickname":"apelido","Add User":"Adicionar usuário","Make public":"Tornar público","Here is where your grant other users access to edit your project. Users added here are granted full control on your project, except for adding or deleting other users.":"Aqui é onde você concede a outros usuários acesso para editar seu projeto. Os usuários adicionados aqui têm controle total sobre seu projeto, exceto para adicionar ou excluir outros usuários. ","You must validate your e-mail address before you can make your project public.":"Você deve validar seu endereço de e-mail antes de tornar seu projeto público. ","This project is currently private.":"Este projeto é privado.","Make private again":"Tornar privado novamente","This project is currently public.":"Este projeto é público.","Make public on microStudio":"Tornar público no microStudio","Add Map":"Adicionar Mapa","Background":"Fundo","Add Asset":"Adicionar Recurso","Delete Asset":"Apagar Recurso","Checklist before publishing":"Lista de verificação antes de publicar","My project is an original work, not a barely modified clone of an existing project.":"Meu projeto é um trabalho original, não um clone modificado de um projeto existente. ","My project brings something interesting or fun to others, it's not just a test.":"Meu projeto traz algo interessante ou divertido para outras pessoas, não é apenas um teste. ","I have created a nice icon for it (the default project icon is not accepted, please create yours!).":"Eu criei um belo ícone para ele (o ícone do projeto padrão não é aceito, por favor, crie o seu!). ","I made the assets in my project myself (sprites, sounds, music), or I made sure that I am allowed to use and publish the assets I imported into it.":"Eu mesmo criei os recursos do meu projeto (sprites, sons, música) ou me certifiquei de que tenho permissão para usar e publicar os recursos que importei para ele. ","If I am using an asset pack, I made sure to add the required credits and generally comply with the license of the asset packs.":"Se eu estiver usando um pacote de recursos, certifiquei-me de adicionar os créditos necessários e, em geral, cumprir a licença dos pacotes de recursos. ","Making your project public will allow it to be listed in the Explore section of the site. Public projects can be run and used by anyone. Making a project public allows anyone to view and possibly reuse the source code.":"Tornar seu projeto público permitirá que ele seja listado na seção Explorar do site. Projetos públicos podem ser executados e usados por qualquer pessoa. Tornar um projeto público permite que qualquer pessoa visualize e possivelmente reutilize o código-fonte. ","Description":"Descrição","Tags":"Tags","Add":"Adicionar","Export to HTML5":"Exportar para HTML5","Before making your project public, please make sure to understand and comply with the following. Tick the boxes when you comply, then press the publication button again":"Antes de tornar seu projeto público, certifique-se de compreender e cumprir o que se segue. Marque as caixas ao concordar e pressione o botão de publicação novamente ","Strip to animation":"Cortar para animação","Your password was successfully changed":"Sua senha foi alterada com sucesso","%USER% posted a reply":"%USER% postou uma resposta","Write":"Escrever","%MINUTES%m":"%MINUTES%m","Editing post":"Editando post","Your e-mail address is now validated":"Seu endereço de e-mail foi validado ","Incorrect nickname. Use 5 characters minimum, only letters, numbers or _":"Apelido incorreto. Use no mínimo 5 caracteres, apenas letras, números ou _ ","email already exists":"email já existe","Click on the link below to validate your e-mail address:":"Clique no link abaixo para validar seu endereço de e-mail: ","Microstudio e-mail validation":"Validação de e-mail microStudio","Build":"Gerar","Exporting to HTML5 allows you to distribute your game as a web app or a standalone HTML app. Unzip contents, double-click index.html to start the game, or upload the contents to a subfolder of your existing web site.":"Exportar para HTML5 permite que você distribua seu jogo como um aplicativo da web ou um aplicativo HTML independente. Descompacte o conteúdo, clique duas vezes em index.html para iniciar o jogo ou carregue o conteúdo em uma subpasta do seu site. ","You can also easily publish your HTML5 game on a number of platforms supporting HTML5 games. We have listed a few popular ones below, which you can check out:":"Você também pode publicar facilmente seu jogo em HTML5 em várias plataformas com suporte para jogos em HTML5. Listamos alguns populares abaixo, que você pode conferir: ","Build for Android":"Gerar para Android","This will build an APK file of your game. An APK file is what you need to publish your game on the Google Play Store, for Android devices.":"Essa opção gerará um arquivo APK do seu jogo. Um arquivo APK é o que você precisa para publicar seu jogo na Google Play Store, para dispositivos Android. ","Build for Windows":"Gerar para Windows","This will build your game as an executable for Windows (.EXE).":"Essa opção gerará seu jogo como um executável para Windows (.EXE). ","Build for macOS":"Gerar para macOS","This will build your game as an executable for macOS.":"Essa opção gerará seu jogo como um executável para macOS. ","Build for Linux":"Gerar para Linux","This will build your game as an executable for Linux (Ubuntu, x86).":"Essa opção gerará seu jogo como um executável para Linux (Ubuntu, x86).","Build for Raspberry Pi":"Gerar para Raspberry Pi","This will build your game as an executable for Raspberry Pi (Raspbian).":"Essa opção gerará seu jogo como um executável para Raspberry Pi (Raspbian).","Start creating":"Comece a criar","Create as a guest":"Criar como convidado ","Start using microStudio without creating an account.":"Comece a usar o microStudio sem criar uma conta.","Create my account":"Criar minha conta","Save your projects, work in teams, publish, vote, comment...":"Salve seus projetos, trabalhe em equipes, publique, vote, comente ... ","Log in to your existing account.":"Entre em sua conta existente. ","Registered User":"Usuário Registrado","Nickname or e-mail":"Apelido ou e-mail","Password":"Senha","Forgot password?":"Esqueceu a senha?","Log in":"Entrar","Don't have an account yet?":"Ainda não tem uma conta?","Password Recovery":"Recuperação de Senha","E-mail":"E-mail","Send password recovery e-mail":"Enviar e-mail de recuperação de senha","New User":"Novo Usuário","E-mail address":"Endereço de E-mail","Terms of Use":"Termos de Uso","Title":"Título","Create Project":"Criar Projeto","Tutorial":"Tutorial","[STORAGE] used of [MAX_STORAGE] ([PERCENT] %)":"[STORAGE] usados de [MAX_STORAGE] ([PERCENT] %)","Reset your microStudio password":"Redefina sua senha do microStudio ","Click on the link below to choose a new microStudio password:":"Clique no link abaixo para escolher uma nova senha do microStudio:","Back to login":"Voltar","Accept the":"Aceite os","Receive news (maximum once per month)":"Receber notícias (máximo uma vez por mês) ","Already registered?":"Já é registrado?","Log in to existing account":"Entre com uma conta existente","Characters Typed":"Caracteres Digitados","Pixels Drawn":"Pixels Desenhados","Map Cells Painted":"Células de Mapa Pintadas","Coding Time":"Tempo Programando","Drawing Time":"Tempo Desenhando","Map Editor Time":"Tempo no Editor de Mapas","View tutorial source code":"Ver o código-fonte do tutorial ","XP":"XP","In this space you can ask for help, share your best tips, read articles, submit bugs or feature requests, follow the roadmap and progress of microStudio.":"Neste espaço você pode pedir ajuda, compartilhar suas melhores dicas, ler artigos, enviar bugs ou solicitações de recursos, seguir as propostas e progressos do microStudio.","You can discuss programming, game development, art, sound, music, useful tools and resources, microStudio and other game engines.":"Você pode discutir programação, desenvolvimento de jogos, arte, som, música, ferramentas e recursos úteis, microStudio e outros engines para jogos.","For anything else there is an Off Topic category.":"Para qualquer outra coisa, há uma categoria \"Off Topic\". ","%DAYS%d":"%DAYS%d","%HOURS%h":"%HOURS%h","Views:":"Visualizações:","Replies:":"Respostas:","Edit":"Editar","Unwatch":"Deixar de seguir","Last activity:":"Última atividade:","Status":"Estado","Progress":"Progresso","Post a reply":"Poste uma resposta","Validate your e-mail address to participate in the community":"Valide seu endereço de e-mail para participar da comunidade","Cancel":"Cancelar","Preview":"Visualizar","Write your text here ; you can use markdown":"Escreva seu texto aqui; você pode usar markdown","Choose category...":"Escolha uma categoria...","Title of your post":"Título da sua postagem","%NUM% weeks ago":"%NUM% semanas atrás","%NUM% days ago":"%NUM% dias atrás","Import source file to":"Importar o código para","Import to project":"Importar o sprite para","Import doc to":"Importar o documento para","Level %LEVEL% unlocked!":"Nível %LEVEL% desbloqueado!","New achievement unlocked!":"Nova conquista desbloqueada!","Download":"Download","View doc":"Visualizar documentação","You will receive e-mail notifications when new replies to this post are published.":"Você receberá notificações por e-mail quando novas respostas a esta postagem forem publicadas. ","Watch":"Observar","%NUM% hours ago":"%NUM% horas atrás","Really quit this project?":"Deseja mesmo sair deste projeto?","%USER% posted in %CATEGORY%":"%USER% postou em %CATEGORY%","%USER% published a new post in %CATEGORY%:":"%USER% publicou uma nova postagem em %CATEGORY%:","Incorrect e-mail address":"Endereço de e-mail incorreto","Warning: %EXP% is not a function":"Aviso: %EXP% não é uma função","%ERROR%, in file %FILE% at line %LINE%, column %COLUMN%":"%ERROR%, no arquivo %FILE% na linha %LINE%, coluna %COLUMN%","Editing reply":"Editando resposta","Pencil":"Lápis","Eraser":"Borracha","Fill":"Preencher","Select":"Selecionar","Enhance":"Realçar","Copy Color":"Copiar Cor","Bytes":"Bytes","Kb":"Kb","Delete Frame":"Deletar Quadro","Do you want to clone this project?":"Você quer clonar este projeto?","copy":"copiar","Project cloned! Here is your copy.":"Projeto clonado! Aqui está sua cópia.","nickname already exists":"apelido já existe","Welcome back!":"Bem-vindo de volta","Password too weak":"Senha muito fraca","Really delete this project?":"Quer mesmo deletar este projeto?","Impressionism":"Impressionismo","You spent 1 hour drawing, amazing!":"Você passou 1 hora desenhando. Incrível!","Joseph Jacquard":"Joseph Jacquard","You spent 2 hours coding, starts looking like an addiction!":"Você passou 2 horas programando. Começa a parecer um vício!","Active Community Member":"Membro Ativo da Comunidade","You made a public post in the community forum!":"Você fez uma postagem pública no fórum da comunidade!","Renaissance":"Renascença","You spent 30 minutes drawing, well done!":"Você passou 30 minutos desenhando. Muito bem!","You spent 1 hour coding, amazing!":"Você passou 1 hora programando. Incrível!","Gottfried Leibniz":"Gottfried Leibniz","Greek Art":"Arte Grega","You spent 10 minutes drawing, keep it up!":"Você passou 10 minutos desenhando. Continue assim!","Blaise Pascal":"Blaise Pascal","You spent 30 minutes coding, well done!":"Você passou 30 minutos desenhando. Muito bem!","Cave Art":"Arte Rupreste","You started drawing!":"Você começou a desenhar!","Al Jazari":"Al Jazari","You spent 10 minutes coding, keep it up!":"Você passou 10 minutos programando. Continue assim!","Recognition":"Reconhecimento","Your public project received 5 likes!":"Seu projeto público recebeu 5 likes!","microStudio Tourist":"Turista do microStudio","You completed the microStudio tour tutorial series!":"Você completou o tour pela série de tutoriais do microStudio!","Al Khwarizmi":"Al Khwarizmi","You actually started coding!":"Você começou a programar!","Ada Lovelace":"Ada Lovelace","New":"Novo","Cubism":"Cubismo","Surrealism":"Surrealismo","Expressionism":"Expressionismo","Game Jam Contender":"Concorrente do Game Jam","You made a submission to a microStudio Game Jam":"Você submeteu um jogo para um Game Jam microStudio","Game Jam Winner":"Vencedor do Game Jam","You won the first prize in a microStudio Game Jam!":"Você ganhou o primeiro prêmio em um Game Jam microStudio!","Game Jam Silver":"Gam Jam Prata","You won the second prize in a microStudio Game Jam!":"Você ganhou o segundo prêmio em um Game Jam microStudio!","Game Jam Bronze":"Game Jam Bronze","You won the third prize in a microStudio Game Jam!":"You won the terceiro prize in a microStudio Game Jam!","Translator":"Tradutor","You made microStudio more accessible by translating it to your language.":"Vocês fez o microStudio mais acessível traduzindo-o para o seu idioma.","Github contributor":"Contribuidor Github","You made microStudio better by contributing code to the project on Github!":"Você fez o microStudio melhor contribuindo com código para o projeto no Github!","Top":"Melhores","You spent 5 hours drawing sprites, O.M.G!":"Você passou 5 horas desenhando sprites. Meu Deus!","Level Design Expert":"Expert em Design de Níveis","You spent 2 hours working on maps, O.M.G!":"Você passou 2 horas trabalhando em mapas. Meu Deus!","You spent 10 hours drawing, isn't that crazy?":"Você passou 10 horas desenhando.  Não é uma loucura?","You spent 20 hours drawing, seems more than just a hobby!":"Você passou 20 horas desenhando. Parece que não é mais um mero hobby!","Joseph Jacquard was a French weaver and merchant. He built and demonstrated the Jacquard loom, a programmable mechanized loom controlled by a tape constructed from punched cards.":"Joseph Jacquard era um tecelão e comerciante francês. Ele construiu e demonstrou o tear Jacquard, um tear mecanizado programável controlado por uma fita construída a partir de cartões perfurados.","Gottfried Leibniz was a German mathematician, philosopher, scientist and diplomat. He made advances in symbolic logic and his work was crucial for the theoretical foundations of computer science.":"Gottfried Leibniz foi um matemático, filósofo, cientista e diplomata alemão. Ele avançou na lógica simbólica e seu trabalho foi crucial para os fundamentos teóricos da ciência da computação.","Blaise Pascal was a French mathematician, physicist, inventor, philosopher. He invented the mechanical calculator.":"Blaise Pascal foi um matemático, físico, inventor e filósofo francês. Ele inventou a calculadora mecânica.","Al Jazari was a Muslim scientist, artist, mathematician living in Mesopotamia. He invented an astronomical clock considered the first programmable analog computer.":"Al Jazari era um cientista, artista e matemático muçulmano que vivia na Mesopotâmia. Ele inventou um relógio astronômico considerado o primeiro computador analógico programável.","Al Khwarizmi was a Persian polymath who produced vastly influential works in mathematics, astronomy, and geography. His name gave rise to the term 'algorithm'.":"Al Khwarizmi foi um polímata persa que produziu obras de grande influência em matemática, astronomia e geografia. Seu nome deu origem ao termo 'algoritmo'.","Abstract Art":"Arte Abstrata","You spent 50 hours drawing, keep it up!":"Você passou 50 horas desenhando. Continue assim!","Level Design Master":"Mestre em Design de Níveis","You spent 10 hours working on maps, seems more than just a hobby!":"Você passou 10 horas trabalhando em mapas. Parece que não é mais um mero hobby!","Level Design Mentor":"Mentor em Design de Níveis","You spent 5 hours working on maps, isn't that crazy?":"Você passou 5 horas trabalhando em mapas. Não é uma loucura?","You spent 20 hours coding, seems more than just a hobby!":"Você passou 20 horas programando. Parece que não é mais um mero hobby!","Post Impressionism":"Pós-impressionismo","George Boole":"George Boole","Ada Lovelace was an English mathematician and writer. She anticipated applications beyond pure calculation to Babbage's Analytical Engine, and created the first algorithms for such a machine.":"Ada Lovelace foi uma matemática e escritora inglesa. Ela antecipou aplicativos além do cálculo puro para a máquina analítica de Babbage e criou os primeiros algoritmos para tal máquina.","You spent 2 hours drawing sprites, starts looking like an addiction!":"Você passou 2 horas desenhando sprites. Começa a parecer um vício!","You spent 10 hours coding, isn't that crazy?":"Você passpu 10 horas programando. Não é uma loucura?","George Boole was an English mathematician, philosopher and logician. He formalized Boolean algebra, the basis for digital logic and computer science.":"George Boole foi um matemático, filósofo e lógico inglês. Ele formalizou a álgebra booleana, a base da lógica digital e da ciência da computação.","Charles Babbage":"Charles Babbage","You spent 5 hours coding, O.M.G!":"Você passou 5 horas programando. Meu Deus!","Charles Babbage was an English mathematician, philosopher, engineer and inventor. He originated the concept of a programmable general-purpose computer and designed the Analytical Engine.":"Charles Babbage foi um matemático, filósofo, engenheiro e inventor inglês. Ele originou o conceito de um computador programável de uso geral e projetou a Máquina Analítica.","Regular Level Designer":"Designer de Níveis Regular","You spent 30 minutes working on maps, amazing!":"Você passou 30 minutos trabalhando em mapas. Incrível!","Junior Level Designer":"Designer de Níveis Junior","You spent 10 minutes working on maps, well done!":"Você passou 10 minutos trabalhando em mapas. Muito bem!","Level Design Rookie":"Designer de Níveis Iniciante","You started creating a map, keep it up!":"Você iniciou a criação de um mapa. Continue assim!","Senior Level Designer":"Designer de Níveis Senior","You spent 1 hour working on maps, starts looking like an addiction!":"Você passou 1 hora trabalhando em mapas. Começa a parecer um vício!","Game Programmer":"Programador de Jogos","You completed the microStudio tutorial series on creating a simple game!":"Você concluiu a série de tutoriais do microStudio sobre como criar um jogo simples!","Digital Art Coder":"Programador de Arte Digital","You completed the microStudio tutorials about drawing with code!":"Você concluiu os tutoriais do microStudio sobre desenho com código!","Trained Programmer":"Programador Treinado","You completed the microStudio programming tutorial series!":"Você concluiu a série de tutoriais de programação do microStudio!","Do you really want to delete this comment?":"Você deseja apagar este comentário?","Do you really want to delete your reply?":"Você deseja apagar a sua resposta?","Experimental features":"Recursos experimentais","Enable experimental features":"Habilitar recursos experimentais","Experimental features can change, break or be removed anytime. You are warned!":"Os recursos experimentais podem ser alterados, interrompidos ou removidos a qualquer momento. Você está avisado!","Newsletter":"Newsletter","basic graphics API":"API básica de gráficos","micro 2D - Experimental - Built on Pixi.js":"micro 2D - Experimental - Construída em Pixi.js","micro 3D - Experimental - Built on Babylon.js":"micro 3D - Experimental - Construída em Babylon.js","Pixi.js - Experimental":"Pixi.js - Experimental","Babylon.js - Experimental":"Babylon.js - Experimental","Additional tools and libraries":"Ferramentas e bibliotecas adicionais","matter.js - 2D physics engine":"matter.js - Engine de física 2D","Note: this integration is experimental":"Nota: esta integração é experimental ","cannon.js - 3D physics engine":"cannon.js - Engine de física 3D","Unlisted":"Não listado","If you mark your public project Unlisted, it will not show up in the main Explore section":"Se você marcar seu projeto público como Não listado, ele não aparecerá na seção Explorar","Public link":"Link público","Emile Baudot":"Emile Baudot","You spent 50 hours coding, keep it up!":"Você passou 2 horas programando. Continue assim!","This project uses an experimental integration of this library:":"Este projeto usa uma integração experimental desta biblioteca:","Emile Baudot was a French telegraph engineer and inventor. He created the first binary encoding system for communications, and today's modem speed unit baud is named after him.":"Emile Baudot foi um engenheiro telegráfico francês e inventor. Ele criou o primeiro sistema de codificação binária para comunicações. Atualmente, a unidade baud de velocidade do modem, leva o seu nome.","This project uses an experimental integration of graphics API:":"Este projeto usa uma integração experimental de API gráfica: ","microScript v1 - interpreted":"microScript v1 - interpretado","microScript v1 - transpiled":"microScript v1 - transpilado","Language support":"Suporte a linguagens","(Transpiler activation was moved to project settings)":"(Ativação do transpilador foi movida para as configurações do projeto)","microScript shines by its simplicity and interactivity. But you can also code in JavaScript, Python or Lua if you prefer.":"O microScript se destaca por sua simplicidade e interatividade. Mas você também pode programar em JavaScript, Python ou Lua, se preferir. ","Standalone, offline application":"Aplicativo standalone e offline","Would you like to work completely offline? Download the microStudio standalone app for Windows, Mac, Linux and Raspberry Pi:":"Você gostaria de trabalhar totalmente offline? Baixe o aplicativo microStudio para Windows, Mac, Linux e Raspberry Pi. ","Fundamentals":"Fundamentos","Quick Start":"Início Rápido","microScript programming":"Programação microScript","API reference":"Referência da API","Advanced graphics":"Gráficos Avançados","Optional libs":"Bibliotecas Opcionais","More programming languages":"Mais linguagens de programação","Show advanced options":"Mostrar opções avançadas","Python":"Python","Lua":"Lua","JavaScript":"JavaScript","Hide advanced options":"Esconder opções avançadas","Your current code will be overwritten. Do you wish to proceed?":"Seu código atual será sobrescrito. Deseja continuar?","%ERROR%, in file \"%FILE%\" at line %LINE%":"%ERROR%, no arquivo \"%FILE%\" na linha %LINE%","Relevance":"Relevância","microStudio is open source":"microStudio tem código aberto","microStudio is open source software, released under the MIT License:":"microStudio é um software de código aberto, lançado sob a licença MIT: ","Support me on Patreon":"Apoie-me no Patreon ","You like microStudio and would like to support me? Check my Patreon!":"Você gosta do microStudio e gostaria de me apoiar? Verifique meu Patreon! ","Run project":"Executar projeto","Pause execution":"Pausar execução","Restart project":"Reiniciar projeto","Detach run window":"Destacar janela de execução","Project QR Code":"Código QR do projeto","Project Type":"Tipo do Projeto","App (game, demo...)":"App (jogo, demo...)","Library":"Biblioteca","Advanced":"Avançado","Take a picture":"Tirar uma foto","Save":"Salvar","Set as project poster image":"Definir como imagem de pôster do projeto","Close":"Fechar","Bertrand Russell":"Bertrand Russell","You spent 100 hours coding, keep it up!":"Você passou 100 horas programando. Continue assim!","Bertrand Russell was a British mathematician, philosopher and logician. His work had a considerable influence on computer science.":"Bertrand Russell foi um matemático, filósofo e lógico britânico. Seu trabalho teve uma influência considerável na ciência da computação."}
