{"Create":"Создать","Learn programming, create video games - microStudio is a free game engine online.":"Изучайте программирование, создавайте видеоигры - microStudio - это бесплатный игровой движок онлайн.","Learn programming, create games":"Изучайте программирование, создавайте игры","Create My Account":"Создать аккаунт","Login":"Войти","Explore":"Обзор","Tutorials":"Уроки","Documentation":"Документация","Community":"Сообщество","About":"О проекте","Settings":"Настройки","Profile":"Профиль","Stats & Achievements":"Статистика/Ачивки","Logout":"Выйти","Create Account":"Создать аккаунт","Quit and Delete":"Выйти и удалить","microStudio is a free game engine online.":"microStudio - это бесплатный онлайн игровой движок.","Create games, learn programming, play, share, prototype and jam!":"Создавайте игры, изучайте программирование, играйте, обменивайтесь опытом, создавайте прототипы и участвуйте в Game Jam'ах!","Online and integrated":"Онлайн и интегрированный","microStudio includes all you need to write code, create sprites and maps for your 2D game.":"microStudio включает все необходимое для написания кода, создания спрайтов и карт для вашей 2D или 3D-игры.","All from your web browser. Your project is stored in the cloud, accessible from anywhere.":"И все это из вашего веб-браузера. Ваш проект хранится в облаке и доступен из любого места.","Get into programming":"Приступить к программированию","Write your game code in microScript, a simple language inspired by Lua.":"Пишите код игры на microScript, простом языке, вдохновленном Lua.","The documentation is always there to help. Create cool demos in just a few lines of code.":"Документация всегда готова прийти на помощь. Создавайте классные демонстрации всего за несколько строк кода.","microScript shines by its simplicity and interactivity. But you can also code in JavaScript, Python or Lua if you prefer.":"microScript отличается своей простотой и интерактивностью. Но при желании вы можете писать свой код на JavaScript, Python или Lua.","Design":"Дизайн","Create pixel art sprites and maps with the included editors.":"Создавайте спрайты и карты в стиле пиксель-арт с помощью встроенных редакторов.","Using your sprites and maps from code is as easy as 1-2-3.":"Использовать спрайты и карты из кода так же просто, как 2×2.","Adjusting is a breeze":"Тестируйте легко и просто","Change anything from your PC while testing your game on your mobile.":"Изменяйте что-либо на своем компьютере, пока тестируете игру на мобильном.","Your changes are immediately reflected in your ongoing playing session.":"Ваши изменения мгновенно отражаются в текущей игровой сессии.","Bring your friends":"Пригласите своих друзей","You can invite others to your project and work in teams.":"Вы можете приглашать других людей в свой проект и работать в команде.","microStudio automagically synchronizes all your project files in real time.":"microStudio автоматически синхронизирует все файлы вашего проекта в режиме реального времени.","Get your gear ready":"Приготовьте свое оборудование","Control your game using the gamepad, touchscreen, keyboard or mouse inputs.":"Управляйте игрой с помощью геймпада, сенсорного экрана, клавиатуры или мыши.","Export your project in a single click to HTML5, Windows, Linux, macOS. More export options are coming!":"Экспортируйте свой проект одним щелчком мыши в HTML5, Windows, Android, Linux, macOS. На подходе еще больше вариантов экспорта!","Join the community":"Присоединяйтесь к сообществу","Browse public games, demos, resources. Pick up what you need for your own project.":"Просмотрите общедоступные игры, демо-версии, ресурсы. Возьмите то, что вам нужно для вашего собственного проекта.","Contribute your best creations and help others.":"Выкладывайте свои лучшие творения и помогайте другим.","So what now?":"Готовы попробовать?","Explore public projects":"Изучить публичные проекты","Start creating!":"Начать творить!","Standalone, offline application":"Автономное, офлайн приложение","Would you like to work completely offline? Download the microStudio standalone app for Windows, Mac, Linux and Raspberry Pi:":"Хотите работать полностью офлайн? Загрузите автономное приложение microStudio для Windows, Mac, Linux и Raspberry Pi:","microStudio is open source":"microStudio имеет открытый исходный код","microStudio is open source software, released under the MIT License:":"microStudio - это программное обеспечение с открытым исходным кодом, выпускаемый  под лицензией MIT:","Support me on Patreon":"Поддержите меня на Patreon","You like microStudio and would like to support me? Check my Patreon!":"Вам нравится microStudio и вы хотели бы поддержать меня? Посетите мой Patreon!","Created in Strasbourg, France. See 'About' for more information":"Создано в Страсбурге, Франция. Дополнительную информацию см. в разделе \"О проекте\"","You are not tracked here.":"Здесь вас не отслеживают.","microStudio doesn't use any third-party tracking script.":"microStudio не использует никаких сторонних скриптов отслеживания.","Back":"Назад","Hot":"Горячие","Run":"Запустить","Clone":"Клонировать","Export":"Экспорт","Comments":"Комментарии","Post":"Отправить","Log in to post comments":"Войдите, чтобы оставить комментарий","Validate your email to post comments":"Подтвердите свой email, чтобы оставлять комментарии","Code":"Код","Sprites":"Спрайты","Sounds":"Звуки","Music":"Музыка","Doc":"Документ","Export all in a ZIP file":"Экспорт всех данных в ZIP-файл","Fundamentals":"Основы","Quick Start":"Быстрый старт","microScript programming":"Программирование на microScript","API reference":"Справка по API","Advanced graphics":"Продвинутая графика","Optional libs":"Необязательные библиотеки","More programming languages":"Больше языков программирования","Changelog":"Журнал изменений","Terms of use":"Условия использования","Privacy":"Конфиденциальность","Learn the basics of programming and how to create games with microStudio:":"Изучите основы программирования и научитесь создавать игры с помощью microStudio:","User Settings":"Пользовательские настройки","Nickname":"Никнейм","Your nickname will be displayed publicly.":"Ваш ник будет отображаться в открытом доступе.","Change nickname":"Изменить никнейм","E-mail Address":"E-mail адрес","Change e-mail":"Изменить e-mail","Your e-mail address is not validated yet. Check your e-mails and click on the validation link we sent to you. In case you did not receive the validation e-mail yet, use the button below to resend:":"Ваш адрес электронной почты еще не подтвержден. Проверьте свою электронную почту и нажмите на ссылку для подтверждения, которую мы вам отправили. Если вы еще не получили письмо с подтверждением, воспользуйтесь кнопкой ниже для повторной отправки:","Resend validation e-mail":"Повторная отправка письма с подтверждением","We have just resent a validation e-mail.":"Мы только что повторно отправили письмо с подтверждением.","Newsletter":"Рассылка","Receive newsletter":"Получать рассылку","We will send you an information email no more than once a month.":"Мы будем отправлять вам информационное письмо не чаще одного раза в месяц.","Account Type":"Тип аккаунта","Storage":"Хранилище","Experimental features":"Экспериментальные возможности","Enable experimental features":"Включить экспериментальные функции","Experimental features can change, break or be removed anytime. You are warned!":"Экспериментальные функции могут измениться, поломаться или быть удалены в любой момент. Предупреждаем!","Open translation tool":"Открыть инструмент перевода","Your Profile":"Ваш профиль","User Description":"Пользовательское описание","Tell us more about yourself (only if you wish to). This text will be displayed on your public page.":"Расскажите нам больше о себе (только если вы хотите). Этот текст будет отображаться на вашей публичной странице.","Profile Image":"Изображение профиля","Remove Profile Image":"Удалить изображение профиля","Drop your image here. This image will be displayed publicly, along with your nickname.":"Переместите свое изображение сюда. Это изображение будет публично отображаться вместе с вашим ником.","Check your public page":"Посмотреть свою публичную страницу","Your public page displays your nickname, description, profile image and a list of your public projects.":"На вашей публичной странице отображается ваш псевдоним, описание, изображение профиля и список ваших публичных проектов.","Your Progress":"Ваш прогресс","Statistics":"Статистика","Achievements":"Достижения","My Projects":"Мои проекты","Create New Project":"Создать новый проект","Import Project":"Импорт проекта","Back to Projects":"Назад к проектам","Maps":"Карты","Assets":"Ассеты","Publish":"Экспорт","Files":"Файлы","Add File":"Добавить файл","Run project":"Запустить проект","Pause execution":"Приостановить выполнение","Restart project":"Перезапуск проекта","Detach run window":"Открепить окно запуска","Take a picture":"Сделать скриншот","Project QR Code":"QR код проекта","Display warning when using an undefined variable":"Вывод предупреждения при использовании неопределенной переменной","Display warning when calling something that isn't a function":"Вывод предупреждения при вызове того, что не является функцией","Display warning when setting property on an undefined variable":"Вывод предупреждения при установке свойства на неопределенную переменную","(Transpiler activation was moved to project settings)":"(Активация транслятора была перенесена в настройки проекта)","You can drop PNG or JPEG files here":"Вы можете поместить файлы PNG или JPEG здесь","Add Sprite":"Добавить спрайт","Apply":"Готово","Undo":"Отменить","Redo":"Восстановить","Copy":"Копировать","Cut":"Вырезать","Paste":"Вставить","Delete Sprite":"Удалить спрайт","Hold down space bar to move view":"Удерживайте пробел, чтобы переместить вид","Zoom in":"Увеличить","Zoom out":"Уменьшить","Animation":"Анимация","Add new Frame":"Добавить новый кадр","Copy Color":"Скопировать цвет","Eyedropper tool":"Пипетка","Lock palette":"Заблокировать палитру","Move":"Переместить","Strip to animation":"Разделить для анимации","Add Map":"Добавить карту","Background":"Фон","Add Asset":"Добавить ассет","Delete Asset":"Удалить ассет","You can drop WAV files here":"Вы можете переместить WAV файлы сюда","Add Sound":"Добавить звук","Synthesizer":"Синтезатор","Delete Sound":"Удалить звук","Drop your sounds on the left. A sleek sound creation app will land here in the future!":"Перетащите свои звуки в левое поле. В будущем здесь появится удобное приложение для создания звуков!","You can drop MP3 files here":"Вы можете переместить MP3 файлы сюда","Add Music":"Добавить музыку","Drop your music files on the left. A sleek music creation app will land here in the future!":"Перетащите свои музыкальные файлы в левое поле. В будущем здесь появится удобное приложение для создания музыки!","Start Tutorial":"Начать обучение","Project Title":"Название проекта","Project Slug":"Метка проекта","Project Secret Code":"Секретный код проекта","Secret URL for testing your project when not set to public":"Секретный URL для тестирования вашего проекта, если он не установлен как общедоступный","Orientation":"Ориентация","Any":"Любая","Portrait":"Портретная","Landscape":"Альбомная","Aspect ratio":"Соотношение сторон","Free":"Свободное","Force 2:1":"2:1","2:1 or above":"2:1 и выше","Force 16:9":"16:9","Force 4:3":"4:3","Force 1:1 (square)":"1:1 (квадрат)","16:9 or above":"16:9 и выше","4:3 or above":"4:3 и выше","1:1 or above":"1:1 и выше","Storage used":"Использование хранилища","Show advanced options":"Показать дополнительные параметры","Project Type":"Тип проекта","App (game, demo...)":"Приложение (игра, демо...)","Library":"Библиотека","Tutorial":"Урок","Language support":"Языковая поддержка","microScript v1 - interpreted":"microScript v1 - интерпретированный","microScript v1 - transpiled":"microScript v1 - транслированный","Python":"Python","Lua":"Lua","JavaScript":"JavaScript","Graphics library":"Графическая библиотека","basic graphics API":"Базовый графический API","micro 2D - Experimental - Built on Pixi.js":"micro 2D - Эксп. - На основе Pixi.js","micro 3D - Experimental - Built on Babylon.js":"micro 3D - Эксп. - На основе Babylon.js","Pixi.js - Experimental":"Pixi.js - Экспериментальный","Babylon.js - Experimental":"Babylon.js - Экспериментальный","Additional tools and libraries":"Доп. инструменты и библиотеки","matter.js - 2D physics engine":"matter.js - 2D физический движок","Note: this integration is experimental":"Примечание: данная интеграция является экспериментальной","cannon.js - 3D physics engine":"cannon.js - 3D физический движок","Users":"Участники","Here is where your grant other users access to edit your project. Users added here are granted full control on your project, except for adding or deleting other users.":"Здесь вы предоставляете другим пользователям доступ к редактированию вашего проекта. Пользователи, добавленные здесь, получают полный контроль над вашим проектом, за исключением добавления или удаления других пользователей.","nickname":"никнейм","Add User":"Добавить пользователя","Make public":"Сделать публичным","You must validate your e-mail address before you can make your project public.":"Вы должны подтвердить свой адрес электронной почты, прежде чем опубликовать свой проект.","This project is currently private.":"В настоящее время этот проект является приватным.","Make private again":"Снова сделать приватным","This project is currently public.":"В настоящее время этот проект является публичным.","Unlisted":"Не в списке","If you mark your public project Unlisted, it will not show up in the main Explore section":"Если вы пометите свой публичный проект как \"Не в списке\", он не будет отображаться в основном разделе Обзор.","Making your project public will allow it to be listed in the Explore section of the site. Public projects can be run and used by anyone. Making a project public allows anyone to view and possibly reuse the source code.":"Если сделать ваш проект публичным, он будет размещен в разделе Обзор. Публичные проекты могут запускаться и использоваться всеми желающими. Публикация проекта позволяет всем желающим просматривать и, возможно, повторно использовать исходный код.","Public link":"Публичная ссылка","Make public on microStudio":"Сделать публичным на microStudio","Checklist before publishing":"Контрольный список перед публикацией","Before making your project public, please make sure to understand and comply with the following. Tick the boxes when you comply, then press the publication button again":"Прежде чем опубликовать свой проект, пожалуйста, убедитесь, что вы поняли и выполнили следующие требования. Поставьте галочки, если вы их соблюдаете, а затем снова нажмите кнопку публикации","My project is an original work, not a barely modified clone of an existing project.":"Мой проект - это оригинальная работа, а не едва измененный клон уже существующего проекта.","My project brings something interesting or fun to others, it's not just a test.":"Мой проект приносит что-то интересное или веселое другим, это не просто тест.","I have created a nice icon for it (the default project icon is not accepted, please create yours!).":"Я создал для него красивую иконку (иконка проекта по умолчанию не принимается, пожалуйста, создайте свою!)","I made the assets in my project myself (sprites, sounds, music), or I made sure that I am allowed to use and publish the assets I imported into it.":"Я сам создал ассеты в своем проекте (спрайты, звуки, музыку), или я убедился, что мне разрешено использовать и публиковать ассеты, которые я импортировал в проект.","If I am using an asset pack, I made sure to add the required credits and generally comply with the license of the asset packs.":"Если я использую пакет ассетов, я обязательно добавляю необходимые титры и в целом соблюдаю лицензию пакетов ассетов.","Description":"Описание","Tags":"Теги","Add":"Добавить","Export to HTML5":"Экспорт в HTML5","Exporting to HTML5 allows you to distribute your game as a web app or a standalone HTML app. Unzip contents, double-click index.html to start the game, or upload the contents to a subfolder of your existing web site.":"Экспорт в HTML5 позволяет распространять игру в виде веб-приложения или отдельного HTML-приложения. Распакуйте содержимое, дважды щелкните по файлу index.html, чтобы запустить игру, или загрузите содержимое в подпапку существующего веб-сайта.","You can also easily publish your HTML5 game on a number of platforms supporting HTML5 games. We have listed a few popular ones below, which you can check out:":"Вы также можете легко опубликовать свою HTML5-игру на ряде платформ, поддерживающих HTML5-игры. Ниже мы перечислили несколько популярных платформ, с которыми вы можете ознакомиться:","Build for Android":"Сборка для Android","This will build an APK file of your game. An APK file is what you need to publish your game on the Google Play Store, for Android devices.":"Это позволит создать APK-файл вашей игры. APK-файл - это то, что вам нужно для публикации вашей игры в Google Play Store для устройств Android.","Build for Windows":"Сборка для Windows","This will build your game as an executable for Windows (.EXE).":"Это создаст вашу игру в виде исполняемого файла для Windows (.EXE).","Build for macOS":"Сборка для macOS","This will build your game as an executable for macOS.":"Это создаст вашу игру в виде исполняемого файла для macOS.","Build for Linux":"Сборка для Linux","This will build your game as an executable for Linux (Ubuntu, x86).":"Это создаст вашу игру в виде исполняемого файла для Linux (Ubuntu, x86).","This will build your game as an executable for Raspberry Pi (Raspbian).":"Это создаст вашу игру в виде исполняемого файла для Raspberry Pi (Raspbian).","Build for Raspberry Pi":"Сборка для Raspberry Pi","Start creating":"Начать создавать","Create as a guest":"Создать как гость","Start using microStudio without creating an account.":"Начните использовать microStudio без создания учетной записи.","Create my account":"Создать аккаунт","Save your projects, work in teams, publish, vote, comment...":"Сохраняйте свои проекты, работайте в командах, публикуйте, голосуйте, комментируйте...","Log in to your existing account.":"Войдите в существующую учетную запись.","Registered User":"Войти","Nickname or e-mail":"Никнейм или e-mail","Password":"Пароль","Forgot password?":"Забыли пароль?","Log in":"Войти","Don't have an account yet?":"У вас еще нет аккаунта?","Password Recovery":"Восстановление пароля","E-mail":"E-mail","Send password recovery e-mail":"Отправить письмо для восстановления пароля","Back to login":"Назад к входу","New User":"Новый пользователь","E-mail address":"E-mail адрес","Accept the":"Принять","Terms of Use":"Условия использования","Receive news (maximum once per month)":"Получать новости (не более раза в месяц)","Already registered?":"Уже зарегистрированы?","Log in to existing account":"Войдите в существующую учетную запись","Title":"Название","Welcome!":"Добро пожаловать!","Create Project":"Создать проект","Advanced":"Дополнительно","Pencil":"Карандаш","Eraser":"Ластик","Fill":"Заполнить","Enhance":"Улучшить","Select":"Выбрать","[STORAGE] used of [MAX_STORAGE] ([PERCENT] %)":"[STORAGE] использовано из [MAX_STORAGE] ([PERCENT] %)","Mb":"Мб","Gb":"Гб","Level %NUM%":"Уровень %NUM%","Delete":"Удалить","Quit":"Выйти","DARK THEME":"ТЕМНАЯ ТЕМА","All":"Всё","Post a reply":"Опубликовать ответ","Progress":"Прогресс","Status":"Статус","Write your text here ; you can use markdown":"Напишите здесь свой текст; вы можете использовать разметку","Preview":"Предварительный просмотр","Cancel":"Отмена","In this space you can ask for help, share your best tips, read articles, submit bugs or feature requests, follow the roadmap and progress of microStudio.":"В этом разделе вы можете попросить о помощи, поделиться своими лучшими советами, прочитать статьи, отправить информацию об ошибках или пожелания о возможностях, следить за планом развития и прогрессом microStudio.","Validate your e-mail address to participate in the community":"Подтвердите свой e-mail адрес для того, чтобы быть участником сообщества","You can discuss programming, game development, art, sound, music, useful tools and resources, microStudio and other game engines.":"Вы можете обсуждать программирование, разработку игр, искусство, звук, музыку, полезные инструменты и ресурсы, microStudio и другие игровые движки.","For anything else there is an Off Topic category.":"Для всего остального есть категория \"Не по теме\".","Activity":"Деятельность","New Post":"Новая запись","Choose category...":"Выберите категорию...","Title of your post":"Название вашей записи","Characters Typed":"Набрано символов","Lines of Code":"Строк кода","Pixels Drawn":"Нарисовано пикселей","Map Cells Painted":"Ячеек карты","hours":"часов","Coding Time":"Время кодирования","Drawing Time":"Время рисования","minutes":"минут","Map Editor Time":"Время создания карт","Public Projects":"Публичные проекты","Level":"Уровень","XP":"XP","Junior Level Designer":"Младший дизайнер уровней","You spent 10 minutes working on maps, well done!":"Вы потратили 10 минут на работу с картами, молодец!","Level Design Rookie":"Новичок в дизайне уровней","You started creating a map, keep it up!":"Вы начали создавать карту, продолжайте в том же духе!","Emile Baudot":"Эмиль Бодо","You spent 50 hours coding, keep it up!":"Вы потратили 50 часов на кодирование, продолжайте в том же духе!","Emile Baudot was a French telegraph engineer and inventor. He created the first binary encoding system for communications, and today's modem speed unit baud is named after him.":"Эмиль Бодо был французским инженером-телеграфистом и изобретателем. Он создал первую систему двоичного кодирования для связи, и в его честь названа сегодняшняя единица скорости модема - бод.","Expressionism":"Экспрессионизм","You spent 5 hours drawing sprites, O.M.G!":"Вы потратили 5 часов на рисование спрайтов, O.M.G!","Game Jam Bronze":"Бронза Game Jam","You won the third prize in a microStudio Game Jam!":"Вы выиграли третий приз в игре microStudio Game Jam!","Game Jam Contender":"Участник Game Jam","You made a submission to a microStudio Game Jam":"Вы приняли участие в конкурсе MicroStudio Game Jam","Post Impressionism":"Пост-импрессионизм","You spent 2 hours drawing sprites, starts looking like an addiction!":"Вы потратили 2 часа на рисование спрайтов, начинает выглядеть как зависимость!","Ada Lovelace":"Ада Лавлейс","You spent 20 hours coding, seems more than just a hobby!":"Вы потратили 20 часов на кодирование, похоже, это больше, чем просто хобби!","Ada Lovelace was an English mathematician and writer. She anticipated applications beyond pure calculation to Babbage's Analytical Engine, and created the first algorithms for such a machine.":"Ада Лавлейс была английским математиком и писательницей. Она предвидела применение Аналитического двигателя Бэббиджа, выходящего за рамки чистого вычисления, и создала первые алгоритмы для такой машины.","George Boole":"Джордж Буль","You spent 10 hours coding, isn't that crazy?":"Вы потратили 10 часов на кодирование, разве это не круто?","George Boole was an English mathematician, philosopher and logician. He formalized Boolean algebra, the basis for digital logic and computer science.":"Джордж Буль был английским математиком, философом и логиком. Он формализовал булеву алгебру, которая легла в основу цифровой логики и информатики.","Impressionism":"Импрессионизм","You spent 1 hour drawing, amazing!":"Вы потратили 1 час на рисование, потрясающе!","Renaissance":"Возрождение","You spent 30 minutes drawing, well done!":"Вы потратили 30 минут на рисование, молодец!","Charles Babbage":"Чарльз Бэббидж","You spent 5 hours coding, O.M.G!":"Вы потратили 5 часов на кодирование, O.M.G!","Charles Babbage was an English mathematician, philosopher, engineer and inventor. He originated the concept of a programmable general-purpose computer and designed the Analytical Engine.":"Чарльз Бэббидж был английским математиком, философом, инженером и изобретателем. Он создал концепцию программируемого компьютера общего назначения и сконструировал аналитический двигатель.","Github contributor":"Участник Github","You made microStudio better by contributing code to the project on Github!":"Вы сделали microStudio лучше, внеся свой код в проект на Github!","Joseph Jacquard":"Жозеф Жаккард","You spent 2 hours coding, starts looking like an addiction!":"Вы потратили 2 часа на кодирование, начинает выглядеть как зависимость!","Joseph Jacquard was a French weaver and merchant. He built and demonstrated the Jacquard loom, a programmable mechanized loom controlled by a tape constructed from punched cards.":"Жозеф Жаккард был французским ткачом и торговцем. Он построил и продемонстрировал жаккардовый ткацкий станок - программируемый механизированный ткацкий станок, управляемый лентой, сконструированной из перфокарт.","Greek Art":"Греческое искусство","You spent 10 minutes drawing, keep it up!":"Вы потратили 10 минут на рисование, продолжайте в том же духе!","Gottfried Leibniz":"Готфрид Лейбниц","You spent 1 hour coding, amazing!":"Вы потратили 1 час на кодирование, потрясающе!","Gottfried Leibniz was a German mathematician, philosopher, scientist and diplomat. He made advances in symbolic logic and his work was crucial for the theoretical foundations of computer science.":"Готфрид Лейбниц был немецким математиком, философом, ученым и дипломатом. Он добился успехов в области символической логики, и его работы сыграли решающую роль в создании теоретических основ информатики.","Blaise Pascal":"Блез Паскаль","You spent 30 minutes coding, well done!":"Вы потратили 30 минут на кодирование, молодцы!","Blaise Pascal was a French mathematician, physicist, inventor, philosopher. He invented the mechanical calculator.":"Блез Паскаль был французским математиком, физиком, изобретателем, философом. Он изобрел механический калькулятор.","Recognition":"Узнаваемость","Your public project received 5 likes!":"Ваш публичный проект получил 5 лайков!","Al Jazari":"Аль-Джазари","You spent 10 minutes coding, keep it up!":"Вы потратили 10 минут на кодирование, продолжайте в том же духе!","Al Jazari was a Muslim scientist, artist, mathematician living in Mesopotamia. He invented an astronomical clock considered the first programmable analog computer.":"Аль-Джазари был мусульманским ученым, художником, математиком, жившим в Месопотамии. Он изобрел астрономические часы, которые считаются первым программируемым аналоговым компьютером.","Cave Art":"Пещерное искусство","You started drawing!":"Вы начали рисовать!","Game Programmer":"Игровой программист","You completed the microStudio tutorial series on creating a simple game!":"Вы завершили серию уроков microStudio по созданию простой игры!","Digital Art Coder":"Кодер цифрового искусства","You completed the microStudio tutorials about drawing with code!":"Вы завершили серию уроков microStudio по рисованию с помощью кода!","Trained Programmer":"Обученный программист","You completed the microStudio programming tutorial series!":"Вы завершили серию уроков по программированию в microStudio!","microStudio Tourist":"Турист microStudio","You completed the microStudio tour tutorial series!":"Вы завершили серию уроков про microStudio!","Al Khwarizmi":"Аль-Хорезми","You actually started coding!":"Вы действительно начали кодировать!","Al Khwarizmi was a Persian polymath who produced vastly influential works in mathematics, astronomy, and geography. His name gave rise to the term 'algorithm'.":"Аль-Хорезми был персидским эрудитом, создавшим очень влиятельные труды по математике, астрономии и географии. Его имя дало начало термину \"алгоритм\".","Translator":"Переводчик","You made microStudio more accessible by translating it to your language.":"Вы сделали microStudio более доступной, переведя ее на свой язык.","Account created successfully!":"Аккаунт успешно создан!","Microstudio e-mail validation":"microStudio подтверждение e-mail","Thank you for using Microstudio!":"Спасибо, что используете microStudio!","Click on the link below to validate your e-mail address:":"Нажмите на ссылку ниже, чтобы подтвердить свой адрес электронной почты:","Your e-mail address is now validated":"Ваш e-mail адрес подтвержден","View tutorial source code":"Просмотреть исходный код урока","LIGHT THEME":"СВЕТЛАЯ ТЕМА","Senior Level Designer":"Дизайнер старшего уровня","You spent 1 hour working on maps, starts looking like an addiction!":"Вы потратили 1 час на работу с картами, это начинает выглядеть как зависимость!","Active Community Member":"Активный участник сообщества","You made a public post in the community forum!":"Вы сделали пост на форуме сообщества!","Regular Level Designer":"Дизайнер среднего уровня","Level Design Expert":"Эксперт по проектированию уровней","You spent 2 hours working on maps, O.M.G!":"Вы потратили 2 часа на работу над картами, O.M.G!","You spent 30 minutes working on maps, amazing!":"Вы потратили 30 минут на работу с картами, потрясающе!","Duplicate Frame":"Дублировать кадр","Move Left":"Сдвинуть влево","Move Right":"Сдвинуть вправо","Build":"Построить","Delete file":"Удалить файл","Game Jam Silver":"Серебро Game Jam","You won the second prize in a microStudio Game Jam!":"Вы выиграли второй приз в microStudio Game Jam!","New":"Новые","Top":"Топ","Incorrect nickname. Use 5 characters minimum, only letters, numbers or _":"Неправильный никнейм.  Используйте не менее 5 символов, только буквы, цифры или _","Game Jam Winner":"Победитель Game Jam","You won the first prize in a microStudio Game Jam!":"Вы выиграли первый приз в microStudio Game Jam!","nickname already exists":"Ник уже занят","Surrealism":"Сюрреализм","You spent 10 hours drawing, isn't that crazy?":"Вы потратили 10 часов на рисование, разве это не круто?","View doc":"Посмотреть документацию","microStudio Community":"microStudio Сообщество","%USER% posted in %CATEGORY%":"%USER% опубликовал в %CATEGORY%","%USER% published a new post in %CATEGORY%:":"%USER% опубликовал новое сообщение в %CATEGORY%:","Last activity:":"Последняя активность:","%MINUTES%m":"%MINUTES%м","Views:":"Просмотры:","Replies:":"Ответы:","Edit":"Редактировать","Watch":"Следить","%DAYS%d":"%DAYS%д","Unwatch":"Не следить","%USER% posted a reply":"%USER% добавил ответ","%USER% posted a reply to %POST%:":"%USER% опубликовал ответ на %POST%:","Password too weak":"Слишком слабый пароль","%HOURS%h":"%HOURS%ч","Bertrand Russell":"Бертран Рассел","You spent 100 hours coding, keep it up!":"Вы потратили 100 часов на кодирование, продолжайте в том же духе!","Bertrand Russell was a British mathematician, philosopher and logician. His work had a considerable influence on computer science.":"Бертран Рассел был британским математиком, философом и логиком. Его работы оказали значительное влияние на информатику.","Abstract Art":"Абстрактное искусство","You spent 50 hours drawing, keep it up!":"Вы потратили 50 часов на рисование, продолжайте в том же духе!","Level Design Master":"Мастер по проектированию уровней","You spent 10 hours working on maps, seems more than just a hobby!":"Вы потратили 10 часов на работу над картами, похоже, это больше, чем просто хобби!","Level Design Mentor":"Наставник по проектированию уровней","You spent 5 hours working on maps, isn't that crazy?":"Вы потратили 5 часов на работу над картами, разве это не курто?","Cubism":"Кубизм","You spent 20 hours drawing, seems more than just a hobby!":"Вы потратили 20 часов на рисование, похоже, это больше, чем просто хобби!","This project uses an experimental integration of graphics API:":"В этом проекте используется экспериментальная интеграция графического API:","Incorrect e-mail address":"Некорректный адрес электронной почты","Editing reply":"Редактирование ответа","%ERROR%, in file \"%FILE%\" at line %LINE%":"%ERROR%, в файле \"%FILE%\" в строке %LINE%","Hide advanced options":"Скрыть дополнительные параметры","%NUM% hours ago":"%NUM% ч. назад","Import doc to":"Импорт документа в","Import to project":"Импорт в проект","Import source file to":"Импорт исходного файла в","email already exists":"Электронная почта уже существует","%NUM% minutes ago":"%NUM% минут назад","OK":"ОК","Reset your microStudio password":"Сброс пароля microStudio","Click on the link below to choose a new microStudio password:":"Нажмите на ссылку ниже, чтобы выбрать новый пароль для microStudio:","Your password was successfully changed":"Ваш пароль был успешно изменен","Likes":"Лайки","%NUM% days ago":"%NUM% д. назад","Really delete this project?":"Действительно удалить этот проект?","Really quit this project?":"Действительно выйти из этого проекта?","now":"сейчас","More Tutorials":"Больше уроков","Check this great series of microStudio tutorials by mrLman:":"Посмотрите эту замечательную серию уроков по microStudio от mrLman:","Really delete %ITEM%?":"Точно удалить %ITEM%?","%PROJECT% - by %USER%":"%PROJECT% - от %USER%","Save":"Сохранить","Close":"Закрыть","Set as project poster image":"Установить в качестве плаката проекта","microStudio is a free game engine online. Learn, create and share with the community. Use the built-in sprite editor, map editor and code editor to create anything.":"microStudio - это бесплатный игровой движок онлайн. Учитесь, создавайте и делитесь с сообществом. Используйте встроенный редактор спрайтов, редактор карт и редактор кода для создания чего угодно.","Editing post":"Редактирование поста","Write":"Продолжить","Level Design Champion":"Чемпион по дизайну уровней","You spent 20 hours working on maps, keep it up!":"Вы потратили 20 часов на работу над картами, продолжайте в том же духе!","Sound":"Звук","New Folder":"Новая папка","Do you really want to delete this folder and all its contents?":"Вы действительно хотите удалить эту папку и все ее содержимое?","Do you really want to delete %ITEM%?":"Вы действительно хотите удалить %ITEM%?","Unlock palette":"Разблокировать палитру","Welcome back!":"С возвращением!","microScript v2 - pre-alpha":"microScript v2 - пре-альфа","Rotate Right":"Поворот вправо","Rotate Left":"Поворот влево","Horizontal Flip":"Горизонтальный флип","Vertical Flip":"Вертикальный флип","You can drop assets here":"Вы можете закинуть ассеты сюда","Capture icon":"Значок захвата","Copy Code":"Копировать код","Active Tabs":"Активные вкладки","Project imported successfully":"Проект успешно импортирован","Load Model":"Загрузить модель","Load Font":"Загрузить шрифт","Use Font":"Использовать шрифт"}
